{
  "category": "HEADSETS",
  "totalProducts": 53,
  "scrapedAt": "2025-02-07T08:41:38.908Z",
  "products": [
    {
      "title": "AirPods Max",
      "price": "₵10,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/AirPods-Max-300x275.jpg",
      "url": "https://telefonika.com/product/airpods-max/",
      "description": "Apple-designed dynamic driver provides high-fidelity audio Active Noise Cancellation blocks outside noise, so you can immerse yourself in music Transparency"
    },
    {
      "title": "Bose Quiet Comfort Ultra Headphones – Dark Black",
      "price": "₵9,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/03/Bose-Quiet-Comfort-Ultra-Headphones-Dark-Black-300x275.jpg",
      "url": "https://telefonika.com/product/bose-quiet-comfort-ultra-headphones-dark-black/",
      "description": "LEVELED-UP LISTENING: Bose QuietComfort Ultra Headphones with spatial audio give you an immersive experience that makes music feel more real;"
    },
    {
      "title": "Bose Quiet Comfort Headphones – White",
      "price": "₵7,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/03/Bose-Quiet-Comfort-Headphones-White-300x275.jpg",
      "url": "https://telefonika.com/product/bose-quiet-comfort-headphones-white/",
      "description": "LEGENDARY NOISE CANCELLATION: Effortlessly combines noise cancelling headphones technology with passive features so you can shut off the outside world,"
    },
    {
      "title": "Bose QuietComfort 45 Wireless Noise Canceling Headphone",
      "price": "₵7,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/Bose-QuietComfort-45-Wireless-Noise-Canceling-Headphone-300x275.jpg",
      "url": "https://telefonika.com/product/bose-quietcomfort-45-wireless-noise-canceling-headphone/",
      "description": "Noise cancelling wireless headphones – The perfect balance of quiet, comfort, and sound. Bose uses tiny mics to measure, compare,"
    },
    {
      "title": "Sony WH-1000XM5 Wireless Headphones",
      "price": "₵6,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/07/Sony-WH-1000XM5-Wireless-Headphones_-medium.png",
      "url": "https://telefonika.com/product/sony-wh-1000xm5-wireless-headphones/",
      "description": "Industry Leading noise cancellation-two processors control 8 microphones for unprecedented noise cancellation. With Auto NC Optimizer, noise canceling is automatically"
    },
    {
      "title": "Bose Quiet Comfort 35 II W/L Headphone with Google Assistant",
      "price": "₵6,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Bose-Quite-Comfort-35-300x300.jpg",
      "url": "https://telefonika.com/product/bose-quiet-comfort-35-ii/",
      "description": "Our best headphones yet You wanted wireless QuietComfort headphones. So we re-engineered them with Bluetooth® technology and our world-class noise"
    },
    {
      "title": "Bose Quiet Comfort 35 II W/L Headphone with Google Assistant Limited Edition",
      "price": "₵6,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Bose-Quite-Comfort-35-300x300.jpg",
      "url": "https://telefonika.com/product/bose-quiet-comfort-35-ii-w-l-headphone-with-google-assistant-limited-edition/",
      "description": "Our best headphones yet You wanted wireless QuietComfort headphones. So we re-engineered them with Bluetooth® technology and our world-class noise"
    },
    {
      "title": "Sony WH-G900WZE/H9 Wireless Noise Cancelling Gaming Headset",
      "price": "₵5,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WH-G900WZEH9-Wireless-Noise-Cancelling-Gaming-Headset-medium.jpg",
      "url": "https://telefonika.com/product/sony-wh-g900wze-h9-wireless-noise-cancelling-gaming-headset/",
      "description": "Personalized 360 Spatial Sound for Gaming provides precise rival detection Dual Sensor Noise Canceling Technology keeps out surrounding noise while"
    },
    {
      "title": "JBL Tour One M2 On-Ear Wireless Headphones",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tour-One-M2-On-Ear-Wireless-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tour-one-m2-on-ear-wireless-headphones/",
      "description": "Made for comfort, designed for inspiration: the adaptive noise reduction technology of the JBL Tour ONE M2 headphones reliably eliminates"
    },
    {
      "title": "Beats Solo 4 – Wireless Bluetooth On-Ear Headphones",
      "price": "₵4,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/06/BEATS-SOLO-4-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/beats-solo-4-wireless-bluetooth-on-ear-headphones/",
      "description": "Custom acoustic architecture and updated drivers for powerful Beats sound. Personalized Spatial Audio with dynamic head tracking. Ultralight ergonomic design"
    },
    {
      "title": "PlayStation Pulse Elite Wireless Headset",
      "price": "₵3,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PlayStation-Pulse-Elite-Wireless-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/playstation-pulse-elite-wireless-headset/",
      "description": "Box Contents: PULSE Elite wireless headset, PlayStation Link USB adapter, PULSE Elite charging hanger, mounting plate, USB cable, Printed Materials"
    },
    {
      "title": "Sony WH-G500BZ H5 Wireless Gaming Headset",
      "price": "₵3,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-INZONE-H5-Wireless-Gaming-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wh-g500bz-h5-wireless-gaming-headset/",
      "description": "Approved by the best, for you – Designed in collaboration with professional gamers to help you get the edge over"
    },
    {
      "title": "Sony WH-ULT900 BC Noise Cancelling Headphones, Black",
      "price": "₵3,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/SONY-WH-ULT900-BC-WL-NOISE-CANCELLING-ULT-Power-Sound-Headp-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wh-ult900-bc-noise-cancelling-headphones-black/",
      "description": "Introducing ULT WEAR: Featuring huge, powerful bass, next-level clarity, and seriously impressive noise cancelling, take the ULT POWER SOUND experience, wherever you go. At the tap of the ULT button, these headphones offer two unique sound settings to deliver exhilarating audio experiences for the power sound obsessives: Deep Bass, which adds huge resonating depth to the lower frequencies, and Attack Bass, bringing impressive drive and energy to the music. And thanks to its Noise Cancelling and Ambient Sound modes, you can use the ULT WEAR however you want, wherever you are. The battery life is impressive. Even with noise cancelling"
    },
    {
      "title": "JBL Quantum One",
      "price": "₵3,090.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Quantum-One-1a-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-quantum-one/",
      "description": "In competitive gaming, sound is survival, and JBL knows great sound: from the thrill of tracking enemies in FPS games, to engaging in epic MOBA battles, the JBL Quantum ONE amplifies every victory in PC gaming. Features JBL QuantumSPHERE 360 technology with integrated head-tracking sensor allows you to pinpoint sound during game play for a true competitive edge, so you never have to miss a step, shot or jump during gameplay. JBL Quantum ONE gaming headset incorporates True Active Noise Cancellation which actively monitors your environment and blocks out unnecessary noise so that you can focus on the game in"
    },
    {
      "title": "Logitech Zone Wired Noise Cancelling Headset",
      "price": "₵2,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/Logitech-Zone-Wired-Noise-Cancelling-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-zone-wired-noise-cancelling-headset/",
      "description": "Zone Wired is designed with generously-sized 40mm drivers to deliver full-bodied bass, crisp higher frequencies and incredibly low distortion creating amazing sound for video call and music. By isolating your voice from any acoustic clutter around you, this Open Office-certified headset with noise-canceling dual mic technology delivers superbly clearer calls and video meetings. The Teflon-coated stainless steel headband features a silicone head cushion and memory-foam ear pads that provide a comfortable fit throughout the workday in a lightweight, contemporary style. Intuitive in-line controls on the tangle-free cable that are always at your fingertips to adjust volume, mute, answer/end/reject calls, and"
    },
    {
      "title": "JBL Quantum 810 – Wired Over-Ear Performance Gaming Headset",
      "price": "₵2,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Quantum-810_-medium.jpg",
      "url": "https://telefonika.com/product/jbl-quantum-810-wired-over-ear-performance-gaming-headset/",
      "description": "Dual surround sound: Feel like you’re stepping inside the game with JBL QuantumSURROUND and DTS Headphone:X version 2.0 technology that lets you experience immersive, multichannel 3D audio all around you. Hear every detail with Hi-Res drivers: Fully immerse yourself in JBL QuantumSOUND. Hi-Res 50mm drivers position even the tiniest audio details with pinpoint accuracy, from the twig snap of an enemy moving into position to the steps of a zombie horde shuffling up behind you. When it comes to gaming, sound is survival. Dual wireless: Never miss a second with the dual solutions of lossless 2.4GHz wireless and Bluetooth 5.2"
    },
    {
      "title": "JBL Live 770NC True Adaptive Noise Cancellation Headphones",
      "price": "₵2,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Live-770NC-True-Adaptive-Noise-Cancellation-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-live-770nc-true-adaptive-noise-cancellation-headphones/",
      "description": "ADAPTIVE NOISE CANCELLATION: Adjusts sound automatically to your surroundings, eliminating the distractions. When you wish to hear your surroundings, easily switch to Smart Ambient, without removing your headphones. THEATRE-LIKE AUDIO: Along with powerful JBL Signature Sound, the 40mm drivers offer immersive JBL Spatial Sound that turns any stereo content from any device into virtual surround sound. 65 HOURS PLAYTIME: Enjoy up to 65 hours of playback, or up to 50 hours with True Adaptive Noise Cancelling and Bluetooth enabled. Speed charge for 5 minutes to get an extra 4 hours of battery life. CUSTOMIZABLE SOUND: Personi-Fi 2.0 helps you tailor your sound"
    },
    {
      "title": "JBL Quantum 600, Wired Over-Ear Gaming Headset, Black",
      "price": "₵2,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/12/JBL-Quantum-600-Wireless-Over-Ear-Gaming-Headset-Black-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-quantum-600-wired-over-ear-gaming-headset-black/",
      "description": "In competitive gaming, sound is survival, and JBL knows great sound: From the thrill of tracking enemies in FPS games, to engaging in epic MOBA battles, the JBL Quantum 600 amplifies every victory Features JBL Quantum Surround sound technology which is engineered for accuracy and delivers immersive gaming audio for a competitive edge, so users never have to miss a step, shot or jump during gameplay JBL Quantum 600 gaming headset incorporates a boom microphone with echo cancelling technology, allowing users to focus on their teammates’ voice rather than background noise, for crystal clear communication. Memory foam ear cushions on"
    },
    {
      "title": "JBL Live 670 NC Headphone",
      "price": "₵2,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Live-670NC-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-live-670-nc-headphone/",
      "description": "Wireless On-Ear Headphones with True Adaptive Noise Cancelling and Smart Ambient, delivering JBL Signature Sound JBL Live 670NC headphones deliver powerful JBL Signature Sound in a comfortable on-ear headband style. When you’re deep in your flow, True Adaptive Noise Cancelling with Smart Ambient technology keeps you free from distractions. Then, when you want to keep an ear open to the world around you, you can stay aware as you continue listening to your favorite playlist—or even have a conversation without taking the headphones off. Easily access your preferred voice assistant with a tap on the ear cup to cue up"
    },
    {
      "title": "Anker Soundcore Space One Pro A3062H11 Super Foldable, Super",
      "price": "₵2,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Anker-Soundcore-Space-One-Pro-A3062H11-Super-Foldable-Super-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-space-one-pro-a3062h11-super-foldable-super/",
      "description": "Foldable Like No Other: soundcore-engineered FlexiCurve Structure reduces the size by 50%. Space One Pro Noise Cancelling Headphones’ compact and foldable design lets you pack more. Exclusive 4-Stage Noise Cancelling System: Enhanced and improved, soundcore’s Space One Pro Noise Cancelling Headphones target and cancel out a wider range of on-the-go noise in real time, adapting to your dynamic movements. Rich, Lossless Listening Experience: Space One Pro’s advanced drivers feature triple composite diaphragms for perfect audio balance and LDAC mode for Hi-Res audio. Indulge in high-fidelity, undistorted audio with less than 3% Total Harmonic Distortion. 60 Hours Nonstop Playback with Ultra-Fast"
    },
    {
      "title": "JBL Live 650",
      "price": "₵1,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Live-650-300x300.jpg",
      "url": "https://telefonika.com/product/jbl-live-650/",
      "description": "JBL Signature Sound 30 Hours Battery Life | 2 Hours Recharging Time Bluetooth technology Active Noise Cancellation Ambient Aware and TalkThru Technology"
    },
    {
      "title": "Sony WH-CH720N/LCE Wireless Headphones",
      "price": "₵1,950.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WH-CH720NLCE-Wireless-Headphones-01-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wh-ch720n-lce-the-lightest-noise-canceling-wireless-headphones/",
      "description": "Noise Cancelling with Dual Noise Sensor technology and the Integrated Processor V1 from the award-winning WH-1000XM5. All-day listening with up to 35 hours of battery life. DSEE restores high frequency sound and fine fade-out sound lost in compression. Easy and clear hands-free calling and voice assistant with wake word."
    },
    {
      "title": "HyperX Cloud Gaming Headset – PlayStation®4",
      "price": "₵1,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/HYPERX-CLOUD-GAMING-HEADSET-FOR-PS4-BLUE-300x275.jpg",
      "url": "https://telefonika.com/product/hyperx-cloud-gaming-headset-playstation-4/",
      "description": "HyperX Cloud headset is a PlayStation® Official Licensed Product. Experience HyperX signature comfort with its plush memory foam ear cushions wrapped in premium leatherette. Immersive yourself in the game world with crystal-clear audio and enhanced bass. Take on new adventures with a headset that was designed to be durable, featuring a sturdy aluminum frame. The noise-cancelling mic is detachable so you can chat with your friend or remove it when it’s not required. When you need to quickly mute yourself or adjust the volume, in-line audio controls are at your fingertips."
    },
    {
      "title": "JBL Quantum 350 – Wireless PC Gaming Headset",
      "price": "₵1,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Quantum-350-Wireless-PC-Gaming-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-quantum-350-wireless-pc-gaming-headset/",
      "description": "When split-second timing is key, you can’t be tied down to your system. Gaming grade lossless 2.4GH wireless gives you total freedom of movement, with no audio drops in the heat of battle. From the quietest footsteps to the loudest laser blasts, JBL’s cinematic QuantumSOUND signature makes every scene epic. Powered by 40mm drivers, the JBL Quantum 350 Wireless fully immerses you in the game for a true competitive edge. Even when games get noisy, the JBL Quantum 350 Wireless’s detachable, directional voice focus boom mic means your squad will always hear you clearly. There’s also a handy mute feature"
    },
    {
      "title": "Logitech H650E USB Headset Stereo",
      "price": "₵1,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Logitech-H650E-USB-Headset-Stereo-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-h650e-usb-headset-stereo/",
      "description": "Enterprise-Grade Corded Double-Ear Stereo Headset With Wideband Audio, Digital Signal Processing (Dsp) And Noise-Cancelling Boom Mic For Crystal-Clear Conversations Useful Accessories Broad Uc Compatibility: Optimized For Microsoft Lync; Cisco Compatible; Compatible With Most Leading Uc Platforms Which Ensures Enterprise-Quality Audio And An Integrated Experience Enterprise-grade corded double-ear stereo headset with Wideband Audio, Digital Signal Processing (DSP) and noise-cancelling boom mic for crystal-clear conversations Broad UC compatibility: Optimized for Microsoft Lync; Cisco compatible; compatible with most leading UC platforms which ensures enterprise-quality audio and an integrated experience This business product ships in brown box with no retail packaging"
    },
    {
      "title": "Sony MDR-G300WZE/H3 Wired Gaming Headset",
      "price": "₵1,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-MDR-G300WZEH3-Wired-Gaming-Headset-medium.jpg",
      "url": "https://telefonika.com/product/sony-mdr-g300wze-h3-wired-gaming-headset/",
      "description": "Personalized 360 Spatial Sound for Gaming provides precise rival detection Game for hours in comfort with soft headband and smooth ear pads Discord certified, clear communications via a flexible flip-up boom microphone with mute function Ergonomically designed controls for effortless operation Personalize your experience through the INZONE Hub software For PC and PlayStation 5 Elevate gaming experience with INZONE gaming monitors (available Summer 2022)"
    },
    {
      "title": "JBL T770 Over Ear Headphone",
      "price": "₵1,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-T770-Over-Ear-Headphone-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-t770-over-ear-headphone/",
      "description": "Adaptive Noise Cancelling with Smart Ambient Adaptive Noise Cancelling means zero distractions when it’s time to focus on your studies—or get your groove on. And if you want to hear the world around you without removing your headphones, Ambient Aware and TalkThru sharpen the sounds of your surroundings or voices. Easily activate these Ambient Sound Control modes through the JBL Headphones app Bluetooth 5.3 with LE Audio Wirelessly stream high-quality JBL Pure Bass Sound from your smartphone with the help of the latest Bluetooth technology. Optimize the Bluetooth performance with the Smart Audio & Video feature in the JBL Headphones"
    },
    {
      "title": "Logitech G335 Wired Gaming Headset",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Logitech-G335-Wired-Gaming-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-g335-wired-gaming-headset/",
      "description": "Lightweight Design: Weighing in at only 240 g (8.5 oz), G335 is smaller and lighter than the G733, features a suspension headband to help distribute weight and is adjustable for a customised fit All-day Comfort: Soft memory foam earphone pads and sports mesh material are comfortable for extended use so you can take your gaming to the next level in style and comfort Plug and Play: Quickly jump into your game and simply connect with the 3.5 mm audio jack; these colourful headphones are compatible with PC, laptop, gaming consoles, and select mobile devices Headset Controls: The volume roller is"
    },
    {
      "title": "Logitech H570E Headset Stereo USB Black",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/03/LOGITECH-H570e-HEADSET-STEREO-USB-BLACK-981-000575-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-h570e-headset-stereo-usb-black/",
      "description": "GREAT VALUE FOR GREAT FEATURES The H570e Headset offers premium features at an affordable price. Acoustic echo cancellation, a noise-cancelling mic, and digital signal processing (DSP) block out unwanted noise for clear conversations with great sound quality. Choose H570e Mono or H570e Stereo for one or two speakers. CHOOSING THE RIGHT HEADSET COMFORTABLE AND LONG-LASTING Business people on the phone for hours will enjoy the comfort of this headset. Stylish, lightweight design and durable materials mean you can wear the H570e all day. Leatherette ear pads, plus padded headband with metal reinforcement provides strength and flexibility, with a fit that"
    },
    {
      "title": "Anker Soundcore Space One  A3035011 B2C Noise Cancelling Up.,Crowd Noise Down Headphone",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Anker-Soundcore-Space-One-Blue-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-space-one-a3035011-b2c-noise-cancelling-up-crowd-noise-down-headphone-black/",
      "description": "2X Stronger Voice Reduction: Stay focused during bustling journeys with our upgraded noise cancelling structure. Space One excels in blocking out mid to high-frequency sounds with 2X more* voice reduction. *Compared with soundcore Life Q30 headphones. Reduce Noise By Up to 98%*: Adaptive noise cancelling detects external sounds and sound leakage, auto-calibrating to deliver optimal noise reduction. Escape unwanted distractions, whether you’re on a noisy train, in a bustling café, or your headphones aren’t sitting on your ears properly. *Tested by soundcore under laboratory conditions. Journey with Hi-Res Audio: Space One’s 40mm customized dynamic drivers support LDAC for Hi-Res Wireless"
    },
    {
      "title": "JBL Tune 670NC, On-ear wireless Noice Cancelling headphones",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-670-OVER-EAR-NOISE-CANCELLING-WL-HEADPHONE-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-670nc-on-ear-wireless-noice-cancelling-headphones/",
      "description": "Wireless on-ear headphones with active noise cancelling & up to 44 hours battery life and Blueooth 5.3 – Blue."
    },
    {
      "title": "JBL Quantum 300",
      "price": "₵1,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Quantum-300-300x300.jpg",
      "url": "https://telefonika.com/product/jbl-quantum-300/",
      "description": "In competitive gaming, sound is survival, and JBL knows great sound: From the thrill of tracking enemies in FPS games, to engaging in epic MOBA battles, the JBL Quantum 300 amplifies every victory on PC, Mac, Xbox, PS4 and Nintendo Switch. Features JBL Quantum Surround sound technology which is engineered for accuracy and delivers immersive gaming audio for a competitive edge, so users never have to miss a step, shot or jump during gameplay. JBL Quantum 300 gaming headset incorporates a boom microphone with echo cancelling technology, allowing users to focus on their teammates’ voice rather than background noise, for"
    },
    {
      "title": "JBL JR460NC Wireless Over-Ear Noise Cancelling Kids Headphones",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Jr460NC-Wireless-Over-Ear-Noise-Cancelling-Kids-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-jr460nc-wireless-over-ear-noise-cancelling-kids-headphones/",
      "description": "JBL SAFE SOUND: Quality sound has no age, but you want to be sure your kids are safe while having fun. With a maximum volume set under 85dB, these wireless headphones are free to enjoy JBL quality sound, safely, wirelessly. ACTIVE NOISE CANCELLING: Shut out all that noise and distraction with Active Noise Cancelling headphones. Your kids can stay focused whether they’re listening to music, enjoying their favorite show or learning online. BUILT-IN MIC: Help your kids stay connected to the world with the built-in mic. With these Bluetooth headphones they can chat easily with friends and family during downtime,"
    },
    {
      "title": "Logitech H540 High-performance USB Headset",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Logitech-H540-High-performance-USB-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-h540-high-performance-usb-headset/",
      "description": "Includes 2 free 1 foot USB extenders to extend the length of your device. Compatible with Win10 Plug-and-play USB connection: Instantly enjoy music, movies and calls in rich digital stereo sound Rotating boom microphone: Reduces background noise for clear chats, rotates up and hides away when you’re listening to music On-ear controls and mute indicator light: Easy to adjust volume, mute the microphone and see when the mic is muted Ultra-comfortable design: Soft, padded leatherette headband and ear cups feel good even after hours of listening Premium headset for PC calls and music: High-performance laser-tuned drivers and built-in EQ for"
    },
    {
      "title": "JBL Tune 720 Over Ear Wireless Headphone",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-720-Over-Ear-Wireless-Headphone-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-720-over-ear-wireless-headphone/",
      "description": "JBL Pure Bass Sound The JBL Tune 720BT utilizes the renowned JBL Pure Bass sound, the same technology that powers the most famous venues all around the world. Wireless Bluetooth 5.3 technology Wirelessly stream high-quality sound from your smartphone without messy cords with the help of the latest Bluetooth technology. Customize your listening experience Download the free JBL Headphones App to tailor the sound to your taste with the EQ. Voice prompts in your desired language guide you through the Tune 720BT features."
    },
    {
      "title": "JBL Quantum 200",
      "price": "₵890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Quantum-200-300x300.jpg",
      "url": "https://telefonika.com/product/jbl-quantum-200/",
      "description": "In competitive gaming, sound is survival, and JBL knows great sound: From the thrill of tracking enemies in FPS games, to engaging in epic MOBA battles, the JBL Quantum 200 amplifies every victory on PC, Mac, Xbox, PS4 and Nintendo Switch. Features JBL Quantum Sound Signature which is engineered for accuracy and delivers immersive gaming audio for a competitive edge, so users never have to miss a step, shot or jump during gameplay JBL Quantum 200 gaming headset incorporates a flip-up boom microphone with echo cancelling technology, allowing users to focus on their teammates’ voice rather than background noise, for"
    },
    {
      "title": "Sony WH-CH520 Wireless Headphones Bluetooth On-Ear Headset",
      "price": "₵890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WH-CH520-Wireless-Headphones-Bluetooth-On-Ear-Headset-300x300.jpg",
      "url": "https://telefonika.com/product/sony-wh-ch520-wireless-headphones-bluetooth-on-ear-headset/",
      "description": "With up to 50-hour battery life and quick charging, you’ll have enough power for multi-day road trips and long festival weekends. Great sound quality customizable to your music preference with EQ Custom on the Sony | Headphones Connect App. Boost the quality of compressed music files and enjoy streaming music with high quality sound through DSEE. Designed to be lightweight and comfortable for all-day use. Crystal clear hands-free calling with built-in mic. Multipoint connection allows you to quickly switch between two devices at once. Find your headphones easily with Fast Pair. Connect to your PC easily with Swift Pair. 360"
    },
    {
      "title": "JBL Tune 520BT",
      "price": "₵750.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/JBL-Tune-520BT-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-520bt/",
      "description": "JBL Pure Bass Sound The JBL Tune 520BT utilizes the renowned JBL Pure Bass sound, the same technology that powers the most famous venues all around the world. Wireless Bluetooth 5.3 technology Wirelessly stream high-quality sound from your smartphone without messy cords with the help of the latest Bluetooth technology. Customize your listening experience Download the free JBL Headphones App to tailor the sound to your taste with the EQ. Voice prompts in your desired language guide you through the Tune 520BT features."
    },
    {
      "title": "Porodo Soundtec Airpodmax ANC Headphone – Black",
      "price": "₵690.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/11/PD-STWLEP023-BK-Porodo-Soundtec-Airpodmax-ANC-Headphone-Black-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-airpodmax-anc-headphone-black/",
      "description": ""
    },
    {
      "title": "Logitech H390 USB Headset",
      "price": "₵690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/Logitech-ClearChat-Comfort-USB-Headset-H390-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-h390-usb-headset/",
      "description": "Noise-canceling microphone: Reduces background noise for clear conversation and voice commands. Microphone rotates out of the way when you’re listening to music or watching a movie. In-line volume and mute controls: Instantly adjust headset volume or mute the microphone. Padded headband and superior sound clarity with the simplicity of a single USB plug-and-play connection. Compatible with Windows 2000, Windows XP, Windows Vista, Windows 7, and Mac OS X"
    },
    {
      "title": "Belkin SoundForm Mini Kids Wireless Headphones",
      "price": "₵550.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Belkin-SoundForm-Mini-Kids-Wireless-Headphones-medium.jpg",
      "url": "https://telefonika.com/product/belkin-soundform-mini-kids-wireless-headphones/",
      "description": "Long lasting battery of up to 30 hours of playtime  Maximum volume of 85dB to protect young ears Compatible with popular distance learning devices and apps on iOS, Android, and other Bluetooth-enabled devices. Kid-sized cushions and headband for comfortable all-day use Belkin is an established accessories market leader creating high quality, innovative tech solutions for over 35 years."
    },
    {
      "title": "Green Lion Echo Max Headphone",
      "price": "₵520.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Lion-Echo-Max-Headphone-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-echo-max-headphone/",
      "description": "With the Green Lion’s Echo Max Headphone, you will experience  an amazing sound you never had. It’s equipped with a 500mAh integrated battery and easily lasts for 50 hours of use at 50% of the maximum volume in Bluetooth mode. There’s a Type-C to Type-A cable for charging and you have an AUX cable in case you’re running out of the battery. Also, it’s totally comfortable to wear due to its light weight.  Specification Bluetooth: 5.3 Maximum range: 10 m Frequency range: 20 Hz – 20 kHz Magnet size: 40 mm Impedance: 32Ω Headset sensitivity: 102 dB + 3 dB"
    },
    {
      "title": "Anker Soundcore H30I W/L On-Ear-Headphone – Black",
      "price": "₵490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Anker-Soundcore-H30I-WL-On-Ear-Headphone-Black-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-h30i-w-l-on-ear-headphone-black/",
      "description": "70-hour Battery Life: Enjoy marathon playlists and extended conference calls without the worry of frequent charging; a mere 5-minute charge gifts an additional 4 hours of audio bliss. With 70H Playtime, these On-Ear Headphones ensure you’re powered for the long journeys. 40mm Oversized Drivers: Dive into a pure bass soundscape that brings every song to life, ensuring no beat or note is ever missed with these On-Ear Headphones. Bluetooth 5.3 Technology: Experience effortless device switching with a stable connection that keeps audio in perfect sync on all compatible devices, thanks to the advanced Bluetooth 5.3 in these headphones. Ultra-lightweight Design:"
    },
    {
      "title": "Green Lion Santiago Wireless Headphone – Black",
      "price": "₵470.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/GNSNTGANCHPBK-Green-Lion-Santiago-Wireless-Headphone-Black-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-santiago-wireless-headphone-black/",
      "description": "The Green Lion Santiago Wireless Headphones are here to provide you with an unmatched audio experience. With a 300mAh battery, it offers an amazing 24 hours of playback on just 2.5 hours of charging, allowing you to listen to music all day with no worries. No matter where you are, you can lose yourself in the music due to the active noise reduction feature. It produces an immersive listening environment by canceling background noise. These headphones provide variety in your listening experience by giving both BT-5.3 for a reliable, high-quality wireless connection up to a 10m distance range and an"
    },
    {
      "title": "JBL JR320 On-Ear headphones",
      "price": "₵450.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JR320-Blue-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-jr320-on-ear-headphones/",
      "description": "JBL Safe Sound technology protects children’s ears at max 85dB • Comfortable headphones designed especially for children • Built-in microphone for easy communication with family and friends • Large, durable buttons that are easy to operate for small hands • Comes with a fun sticker set for personalization JBL JR320 headphones: gives children a safe sound experience with the well-known JBL quality, which never exceeds 85dB, protecting the young ears. They are designed for comfort and have large, durable buttons that even small children can easily operate. With the built-in microphone, children can easily talk to family, friends or teachers."
    },
    {
      "title": "JBL TUNE 500 – Wired On-Ear Headphones – Black",
      "price": "₵450.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/JBL-Tune-500-Wired-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-500-wired-on-ear-headphones-black/",
      "description": "JBL Pure Bass sound 1-button remote with microphone Tangle-free flat cable Lightweight and foldable design Ask Siri or Google Now"
    },
    {
      "title": "JBL JR310 On-Ear Children’s Headphones in Red-Blue – Wired Earphones",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Apple-iPad-Air-4-2020.jpgJBL-JR310-On-Ear-Childrens-Headphones-in-Red-Blue-Wired-Earphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-jr310-on-ear-childrens-headphones-in-red-blue-wired-earphones/",
      "description": "We only have Blue-Pink color in stock!!!"
    },
    {
      "title": "Porodo Soundtec Kids Wireless Over-Ear Headphone",
      "price": "₵350.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Soundtec-Kids-Wireless-Over-Ear-Headphone-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-kids-wireless-over-ear-headphone/",
      "description": ""
    },
    {
      "title": "Porodo Soundtec Kids ENC Headphone Rabbit Ear  – Pink",
      "price": "₵270.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PD-STKNCRE-PK-Porodo-Soundtec-Kids-ENC-Headphone-Rabbit-Ear-Pink-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-kids-enc-headphone-rabbit-ear-pink/",
      "description": "Description Introducing the Pordoo Soundtec Kids Wireless Headphones, the perfect blend of fashion and safety for your little adventurers! These headphones are not only fun and stylish, with their adorable LED rabbit ears lights, but they also offer superior hearing protection for your child’s delicate ears. With a safe sound level of 85dB, Soundtec headphones allow your child to enjoy hours of listening without the risk of damage. The tight fit of the headphones ensures long-lasting comfort, even during prolonged use. And the kid-friendly controls make it easy for your child to navigate through songs and adjust the volume. Immerse"
    },
    {
      "title": "Logitech H110 Stereo Headset",
      "price": "₵220.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/Logitech-H110-Stereo-Headset-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-h110-stereo-headset/",
      "description": "Works with Windows (Not for use with Apple computer hardware) Sound card with 3.5 mm microphone-in and audio-out ports Sensitivity: -58 dBV/µBar, -38 dBV/Pa +/- 4 dB Frequency response:Headset: 20 Hz – 20,000 Hz Microphone: 100 Hz –16,000 Hz 6-foot shielded cord 3.5 mm color-coded connectors"
    },
    {
      "title": "Porodo Soundtec Wireless Headphones",
      "price": "₵220.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Porodo-PD-STWLEP038BK-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-wireless-headphones-black/",
      "description": "The Porodo Soundtec PRIMO Wireless Headphone combines premium audio with innovative features targeted at music lovers and gamers. With 40mm drivers, it certainly guarantees rich quality sound; the low latency in its game mode promises smooth audio-visual synchronization for an immersive feeling during serious gaming. Advanced ENC technology covers a person from background noise to ensure crystal-clear calls. Enjoy extended listening via the robust 400mAh battery for up to 50 hours of playtime at 50% volume or 44 hours at total volume. Recharge in as little as 1.5 hours via the Type-C port. Besides, Bluetooth V5.4 provides stable connectivity up"
    },
    {
      "title": "Sony MDR-ZX110AP Wired Headset",
      "price": "₵199.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-Wired-Headset-ZX110AP-300x300.jpg",
      "url": "https://telefonika.com/product/sony-wired-headset-zx110ap/",
      "description": "Acoustic Bass Booster for incredible bass response, 30mm drivers for wide frequency response (5-22 kHz).Connectivity Technology: Wired In-line microphone for hands-free phone calling, Compatible with Apple or Android smartphones, Lightweight on-the-ear design Free SmartKey App for customized in-line remote function, Swivel design for portability, 47 1/4 in. (1.2m) tangle-free Y-type cord"
    },
    {
      "title": "Porodo Soundtec Headphone 400mAh – Black",
      "price": "₵190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Porodo-PD-STWLEP026-BK-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-headphone-400mah-black/",
      "description": "Description The Porodo Soundtec Nova Wireless Headphone is the best accessory to have with you outdoors and indoors. This headphone has over 20 hours of playtime and only takes 2 hours to charge fully. The Soundtec Nova Headphone has Bluetooth version 5.3 and a 10-meter transmission range that gives a stable and strong connection even if you are away from your phone. All of these features make the Porodo Soundtec Nova Wireless Headphone the best addition to have in the gym and outdoors."
    }
  ]
}