{
  "category": "COVERS & CASES",
  "totalProducts": 140,
  "scrapedAt": "2025-02-06T20:08:41.724Z",
  "products": [
    {
      "title": "Apple iPhone FineWoven Wallet with MagSafe — Black",
      "price": "₵1,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/MA6W400-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-finewoven-wallet-with-magsafe-black/",
      "description": "Designed with both style and function in mind, the new iPhone FineWoven Wallet with MagSafe is the perfect way to"
    },
    {
      "title": "Apple iPhone 15 Pro Max FineWoven Case with MagSafe – Black",
      "price": "₵1,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MT4V3-Apple-iPhone-15-Pro-Max-FineWoven-Case-with-MagSafe-_-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-15-pro-max-finewoven-case-with-magsafe-black/",
      "description": "Designed by Apple to complement iPhone 15 Pro Max, the FineWoven Case with MagSafe is a delightful way to give your iPhone"
    },
    {
      "title": "Apple iPhone 15 Pro FineWoven Case with MagSafe – Black",
      "price": "₵1,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MT4H3-Apple-iPhone-15-Pro-FineWoven-Case-with-MagSafe-Blac-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-15-pro-finewoven-case-with-magsafe-black/",
      "description": "Designed by Apple to complement iPhone 15 Pro, the FineWoven Case with MagSafe is a delightful way to give your iPhone extra"
    },
    {
      "title": "Apple iPhone 15 Pro Clear Case with MagSafe",
      "price": "₵1,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MT223-Apple-iPhone-15-Pro-Clear-Case-with-MagSafe-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-15-pro-clear-case-with-magsafe/",
      "description": "Thin, light, and easy to grip — this Apple-designed case shows off the brilliant colored finish of iPhone 15 Pro"
    },
    {
      "title": "Apple iPhone 14 Pro Leather Case with MagSafe",
      "price": "₵1,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/Apple-iPhone-14-Pro-Leather-Case-with-MagSafe-Ink-medium.jpg",
      "url": "https://telefonika.com/product/apple-iphone-14-pro-leather-case-with-magsafe/",
      "description": "MagSafe. Everything just clicks. MagSafe is a new ecosystem of accessories for easy attachment and faster wireless charging. With endless"
    },
    {
      "title": "Apple iPhone 16 Silicone Case with MagSafe – Black",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/MYY1300-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-16-silicone-case-with-magsafe-black/",
      "description": "Designed by Apple to complement iPhone 16, the Silicone Case with MagSafe is a delightful way to protect your iPhone."
    },
    {
      "title": "Apple iPhone 14 Plus Leather Case with MagSafe",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2023/02/Apple-iPhone-14-Plus-Leather-Case-with-MagSafe-Ink-medium.jpg",
      "url": "https://telefonika.com/product/apple-iphone-14-plus-leather-case-with-magsafe/",
      "description": "Made by Apple to complement your iPhone 14 Plus, this leather case with MagSafe is a great way to give"
    },
    {
      "title": "Apple iPhone 15 Pro Silicone Case with MagSafe – Storm Blue",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MT1D3-Apple-iPhone-15-Pro-Silicone-Case-with-MagSafe-Storm-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-15-pro-silicone-case-with-magsafe-storm-blue/",
      "description": "Designed by Apple to complement iPhone 15 Pro, the Silicone Case with MagSafe is a delightful way to protect your iPhone. The"
    },
    {
      "title": "Apple iPhone 15 Pro Max Clear Case with Magsafe MT233",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/03/APPLE-iPHONE-15-Promax-Clear-Case-with-Magsafe-MT233-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-15-promax-clear-case-with-magsafe-mt233/",
      "description": "Mix. Match. MagSafe. A family of colorful accessories for easy attachment and faster wireless charging. Overview Thin, light, and easy"
    },
    {
      "title": "Apple iPhone 16 Pro Max Clear Case with MagSafe",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/Apple-iPhone-16-Pro-Max-Clear-Case-with-MagSafe-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-16-pro-max-clear-case-with-magsafe/",
      "description": "Thin, light, and easy to grip — this Apple-designed case shows off the brilliant colored finish of iPhone 16 Pro"
    },
    {
      "title": "Apple iPhone 16 Pro Max Silicone Case with MagSafe – Black",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/MYYT3-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-16-pro-max-silicone-case-with-magsafe-black/",
      "description": "Designed by Apple to complement iPhone 16 Pro Max, the Silicone Case with MagSafe is a delightful way to protect"
    },
    {
      "title": "Apple iPhone 13 Silicone Case with MagSafe",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/iPhone-13-Silicone-Case-with-MagSafe-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-13-silicone-case-with-magsafe/",
      "description": "Mix. Match. MagSafe. A colorful family of accessories for easy attachment and faster wireless charging. Shop MagSafe accessories Product Information"
    },
    {
      "title": "Apple iPhone 16 Pro Max Silicone Case with MagSafe – Black",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/MYYT3-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-16-pro-max-silicone-case-with-magsafe-black/",
      "description": "Designed by Apple to complement iPhone 16 Pro Max, the Silicone Case with MagSafe is a delightful way to protect your iPhone. Made with a 55 percent recycled silicone material, the case has a silky, soft-touch finish on the exterior that feels great in your hand. And on the inside, there’s a soft microfiber lining for even more protection. This case works seamlessly with Camera Control. It features a sapphire crystal coupled to a conductive layer to communicate finger movements to the Camera Control. With built-in magnets that align perfectly with iPhone 16 Pro Max, this case offers a magical attach experience and"
    },
    {
      "title": "Apple iPhone 13 Silicone Case with MagSafe",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/iPhone-13-Silicone-Case-with-MagSafe-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-13-silicone-case-with-magsafe/",
      "description": "Mix. Match. MagSafe. A colorful family of accessories for easy attachment and faster wireless charging. Shop MagSafe accessories Product Information Overview Designed by Apple to complement iPhone 13, the Silicone Case with MagSafe is a delightful way to protect your iPhone. The silky, soft-touch finish of the silicone exterior feels great in your hand. And on the inside, there’s a soft microfiber lining for even more protection. With built-in magnets that align perfectly with iPhone 13, this case offers a magical attach experience and faster wireless charging, every time. When it’s time to charge, just leave the case on your"
    },
    {
      "title": "Apple iPhone 14 Pro Max Silicone Case with Magsafe",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/05/Apple-iPhone-14-Pro-Max-Silicone-Case-with-Magsafe-Eiderbe-medium.jpg",
      "url": "https://telefonika.com/product/apple-iphone-14-pro-max-silicone-case-with-magsafe/",
      "description": "Designed by Apple to complement iPhone 14 Pro Max, the Silicone Case with MagSafe is a delightful way to protect your iPhone. The silky, soft-touch finish of the silicone exterior feels great in your hand. And on the inside, there’s a soft microfiber lining for even more protection. With built-in magnets that align perfectly with iPhone 14 Pro Max, this case offers a magical attach experience and faster wireless charging, every time. When it’s time to charge, just leave the case on your iPhone and snap on your MagSafe charger, or set it on your Qi-certified charger. Like every Apple-designed"
    },
    {
      "title": "Green Lion Touchpad Keyboard Case for iPad Pro 12.9″ 500mAh",
      "price": "₵1,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/Green-Lion-Touchpad-Keyboard-Case-for-iPad-Pro-12.9-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-touchpad-keyboard-case-for-ipad-pro-12-9/",
      "description": "The Green Lion Touchpad Keyboard Case is the ultimate companion for enhanced productivity and seamless navigation on your devices. This innovative keyboard case is designed to elevate your typing experience while providing efficient protection for your device. With an impressive battery life, you can enjoy up to 5 hours of usage with the backlight on and a stounding 55 hours with the backlight off. The 500mAh battery capacity ensures long-lasting performance, and the Type-C charging interface allows for quick and convenient recharging in just 2-3 hours. Thanks to its reliability, it has the flexibility to work or play from a distance of"
    },
    {
      "title": "Apple iPhone 14 Leather Case with MagSafe – Forest Green",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Apple-iPhone-14-Leather-Case-with-MagSafe-Forest-Green-medium.jpg",
      "url": "https://telefonika.com/product/apple-iphone-14-leather-case-with-magsafe-forest-green/",
      "description": "Designed by Apple to complement iPhone 14, the Leather Case with MagSafe is a delightful way to give your iPhone extra protection while adding style. Made from specially tanned and finished leather, the outside feels soft to the touch and develops a natural patina over time. The case quickly snaps into place and fits snugly over your iPhone without adding bulk. With built-in magnets that align perfectly with iPhone 14, the case offers a magical attach and detach experience, every time. The perfectly aligned magnets make wireless charging faster and easier than ever before. And when it’s time to charge,"
    },
    {
      "title": "Apple iPhone 14 Pro Max Leather Case with MagSafe",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Apple-iPhone-14-Pro-Max-Leather-Case-with-MagSafe-Ink-medium.jpg",
      "url": "https://telefonika.com/product/apple-iphone-14-pro-max-leather-case-with-magsafe/",
      "description": "Designed by Apple to complement iPhone 14 Pro Max, the Leather Case with MagSafe is a delightful way to give your iPhone extra protection while adding style. Made from specially tanned and finished leather, the outside feels soft to the touch and develops a natural patina over time. The case quickly snaps into place and fits snugly over your iPhone without adding bulk. With built-in magnets that align perfectly with iPhone 14 Pro Max, the case offers a magical attach and detach experience, every time. The perfectly aligned magnets make wireless charging faster and easier than ever before. And when"
    },
    {
      "title": "Apple iPhone 13 Leather Case with MagSafe",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/iPhone-13-Pro-Leather-Case-with-MagSafe-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-13-leather-case-with-magsafe/",
      "description": "Mix. Match. MagSafe. A colorful family of accessories for easy attachment and faster wireless charging. Shop MagSafe accessories Product Information Overview Designed by Apple to complement iPhone 13, the Leather Case with MagSafe is a delightful way to give your iPhone extra protection while adding style. Made from specially tanned and finished leather, the outside feels soft to the touch and develops a natural patina over time. The case quickly snaps into place and fits snugly over your iPhone without adding bulk. With built-in magnets that align perfectly with iPhone 13, the case offers a magical attach and detach experience,"
    },
    {
      "title": "Apple iPhone 14 Silicone Case with MagSafe – Storm Blue",
      "price": "₵1,090.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Apple-iPhone-14-Silicone-Case-with-MagSafe-Storm-Blue-medium.jpg",
      "url": "https://telefonika.com/product/apple-iphone-14-silicone-case-with-magsafe-storm-blue/",
      "description": "Designed by Apple to complement iPhone 14, the Silicone Case with MagSafe is a delightful way to protect your iPhone. The silky, soft-touch finish of the silicone exterior feels great in your hand. And on the inside, there’s a soft microfiber lining for even more protection. With built-in magnets that align perfectly with iPhone 14, this case offers a magical attach experience and faster wireless charging, every time. When it’s time to charge, just leave the case on your iPhone and snap on your MagSafe charger, or set it on your Qi-certified charger. Like every Apple-designed case, it undergoes thousands"
    },
    {
      "title": "Apple iPhone 11 Pro Max Clear Case",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/iPhone-11-Pro-Max-Clear-Case-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-11-pro-max-clear-case/",
      "description": "Thin, light, and easy to grip — this Apple-designed case shows off the brilliant colored finish of iPhone 11 Pro Max while providing extra protection. Made from a blend of optically clear polycarbonate and flexible TPU materials, the iPhone 11 Clear Case provides a solid, comfortable feel. The back is designed to be sturdy, while the sides are made from a softer, more flexible material that fits right over the buttons for an improved grip. And when it’s time to wirelessly charge, just leave the case on and set your iPhone on your Qi-certified charger. On the surface, a scratch-resistant"
    },
    {
      "title": "Apple iPhone 11 Pro Clear Case",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/MWYK2-Apple-iPhone-11-Pro-Clear-Case-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-11-pro-clear-case/",
      "description": "Thin, light, and easy to grip — this Apple-designed case shows off the brilliant colored finish of iPhone 11 Pro while providing extra protection. Made from a blend of optically clear polycarbonate and flexible TPU materials, the iPhone 11 Clear Case provides a solid, comfortable feel. The back is designed to be sturdy, while the sides are made from a softer, more flexible material that fits right over the buttons for an improved grip. And when it’s time to wirelessly charge, just leave the case on and set your iPhone on your Qi-certified charger. On the surface, a scratch-resistant coating"
    },
    {
      "title": "Apple iPhone 13 Clear Case with MagSafe",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/Apple-Clear-Case-with-MagSafe-13-300x275.jpg",
      "url": "https://telefonika.com/product/apple-clear-case-with-magsafe/",
      "description": "Mix. Match. MagSafe. A colorful family of accessories for easy attachment and faster wireless charging. Shop MagSafe accessories Product Information Overview Thin, light, and easy to grip — this Apple-designed case shows off the brilliant colored finish of iPhone 13 while providing extra protection. Crafted with a blend of optically clear polycarbonate and flexible materials, the case fits right over the buttons for easy use. On the surface, a scratch-resistant coating has been applied to both the interior and exterior. And all materials and coatings are optimized to prevent yellowing over time. With built-in magnets that align perfectly with iPhone 13,"
    },
    {
      "title": "Apple iPhone 11 Pro Silicone Case – RED",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/Apple-iPhone-11-Pro-Silicone-Case-RED-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-11-pro-silicone-case-red/",
      "description": "Designed by Apple to complement iPhone 11 Pro, the form of the silicone case fits snugly over the volume buttons, side button, and curves of your device without adding bulk. A soft microfiber lining on the inside helps protect your iPhone. On the outside, the silky, soft-touch finish of the silicone exterior feels great in your hand. And you can keep it on all the time, even when you’re charging wirelessly. Like every Apple-designed case, it undergoes thousands of hours of testing throughout the design and manufacturing process. So not only does it look great, it’s built to protect your"
    },
    {
      "title": "Njord Vindur Case for iPhone 13 SL14140",
      "price": "₵940.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/Njord-Vindur-Case-for-iPhone-13-300x275.jpg",
      "url": "https://telefonika.com/product/njord-vindur-case-for-iphone-13/",
      "description": "Compatible with Apple MagSafe magnetic charging system, the Salmon Leather cases for iPhone 13 series have a smooth yet refined texture giving them a comfortable and unique tactile feel. Raised edges on both front and back protect your screen from scratches and the beautiful salmon leather from dirt on surfaces, while adding 2m drop protection. Keep your iPhone safe in style! ______________   Works with MagSafe Works beautifully with Apple MagSafe magnetic wireless charging system, and any other Wireless Charger! The Njorð collection dropcases, with premium Icelandic salmon leather, add only 2,3mm thickness and therefore work with any Qi-Compliant wireless"
    },
    {
      "title": "Njord Vindur Case for iPhone 13 Pro SL14150",
      "price": "₵940.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/Njord-Vindur-Case-for-iPhone-13-300x275.jpg",
      "url": "https://telefonika.com/product/njord-vindur-case-for-iphone-13-pro-sl14150/",
      "description": "Compatible with Apple MagSafe magnetic charging system, the Salmon Leather cases for iPhone 13 series have a smooth yet refined texture giving them a comfortable and unique tactile feel. Raised edges on both front and back protect your screen from scratches and the beautiful salmon leather from dirt on surfaces, while adding 2m drop protection. Keep your iPhone safe in style! ______________   Works with MagSafe Works beautifully with Apple MagSafe magnetic wireless charging system, and any other Wireless Charger! The Njorð collection dropcases, with premium Icelandic salmon leather, add only 2,3mm thickness and therefore work with any Qi-Compliant wireless"
    },
    {
      "title": "UAG iPhone 13 Civilian Case – Mallard",
      "price": "₵840.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/UAG-iPhone-13-Civilian-Case-Mallard-300x275.jpg",
      "url": "https://telefonika.com/product/uag-iphone-13-civilian-case-mallard/",
      "description": "Urban Armor Gear Civilian Hybrid Case for iPhone 13 Use this drop-tested case from UAG Civilian series to protect your iPhone 13 perfectly! The UAG Civilian case for iPhone 13 is engineered with HyperCush technology and meets military drop-tested standards (MIL-STD 810G 516.6) to increase shock protection. Although it has an ultimate protection design, the UAG Civilian is suitable for any occasion and keeps your iPhone 13 elegant. Features: – UAG Civilian hybrid cover for iPhone 13 – Hybrid construction engineered for ultimate protection – HyperCush tech and military drop-tested standards – It supports wireless charging and NFC payments –"
    },
    {
      "title": "UAG iPhone 13 Civilian Case – Black",
      "price": "₵840.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/UAG-iPhone-13-Civilian-Case-Black-300x275.jpg",
      "url": "https://telefonika.com/product/uag-iphone-13-civilian-case-black/",
      "description": "Urban Armor Gear Civilian Hybrid Case for iPhone 13 Use this drop-tested case from UAG Civilian series to protect your iPhone 13 perfectly! The UAG Civilian case for iPhone 13 is engineered with HyperCush technology and meets military drop-tested standards (MIL-STD 810G 516.6) to increase shock protection. Although it has an ultimate protection design, the UAG Civilian is suitable for any occasion and keeps your iPhone 13 elegant. Features: – UAG Civilian hybrid cover for iPhone 13 – Hybrid construction engineered for ultimate protection – HyperCush tech and military drop-tested standards – It supports wireless charging and NFC payments –"
    },
    {
      "title": "UAG – iPhone 12/12 Pro Monarch Case",
      "price": "₵820.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/MONARCH-SERIES-IPHONE-12-5G-CASE-300x275.jpg",
      "url": "https://telefonika.com/product/uag-iphone-12-12-pro-monarch-case/",
      "description": "Built with top quality premium materials the Monarch Series is the all-terrain phone case. Ready to roam It’s thoughtfully engineered 5-layer construction allows you to have true freedom and no worries about the protection of your device. Get after it! Soft impact-resistant core & protective screen surround Traction grip & oversized tactile buttons Feather-light construction"
    },
    {
      "title": "iPhone 12 Pro Max Active Necklace Case Dynamic Black",
      "price": "₵750.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/iPhone-12-Pro-Max-Active-Necklace-Case-Dynamic-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-pro-max-active-necklace-case-dynamic-black/",
      "description": "The Active Necklace Case in Dynamic Black brings out the full force of black; its versatile and sleek appearance evokes unquestionable flair."
    },
    {
      "title": "iPhone 12 Mini Atelier Necklace Case Mint Croco",
      "price": "₵750.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/iPhone-12-Mini-Atelier-Necklace-Case-Mint-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-mini-atelier-necklace-case-mint-croco/",
      "description": "The Atelier Necklace Case in Mint Croco is a compelling yet minimalist design that effortlessly feels modern and versatile, something unexpected and sensuous that will add a touch of mint freshness."
    },
    {
      "title": "iPhone 12/12 Pro Atelier Necklace Case Mint Croco",
      "price": "₵750.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/iPhone-12-Mini-Atelier-Necklace-Case-Mint-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-12-pro-atelier-necklace-case-mint-croco/",
      "description": "The Atelier Necklace Case in Mint Croco is a compelling yet minimalist design that effortlessly feels modern and versatile, something unexpected and sensuous that will add a touch of mint freshness."
    },
    {
      "title": "iPhone 12/12 Pro Active Necklace Case Dynamic Black",
      "price": "₵750.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-12-12-Pro-Active-Necklace-Case-Dynamic-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-12-pro-active-necklace-case-dynamic-black/",
      "description": "The Active Necklace Case in Dynamic Black brings out the full force of black; its versatile and sleek appearance evokes unquestionable flair."
    },
    {
      "title": "iPhone 12 Mini Active Necklace Case Dynamic Black",
      "price": "₵750.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-12-Mini-Active-Necklace-Case-Dynamic-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-mini-active-necklace-case-dynamic-black/",
      "description": "The Active Necklace Case in Dynamic Black brings out the full force of black; its versatile and sleek appearance evokes unquestionable flair."
    },
    {
      "title": "iPhone 13 Pro Atelier Necklace Case Jet Black Croco",
      "price": "₵715.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Atelier-Necklace-Case-Jet-Black-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-necklace-case-jet-black-croco/",
      "description": "Jet Black Croco is inspired by nature’s most opulent texture, croco. This deep black is commonly associated with power, mystery and elegance and brings out the charm of the croco texture in full force."
    },
    {
      "title": "iPhone 13 Pro Atelier Necklace Case Misty Rose Croco",
      "price": "₵715.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Atelier-Necklace-Case-Misty-Rose-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-necklace-case-misty-rose-croco/",
      "description": "Misty Rose Croco captures the delicate beauty and power of dusty pink by combining it with an irresistible croco texture. This enchanting combination truly brings out the powerful nature of pink and beams with confidence."
    },
    {
      "title": "iPhone 13 Pro Atelier Necklace Case Jet Black Croco",
      "price": "₵715.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Atelier-Necklace-Case-Jet-Black-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-necklace-case-jet-black-croco/",
      "description": "Jet Black Croco is inspired by nature’s most opulent texture, croco. This deep black is commonly associated with power, mystery and elegance and brings out the charm of the croco texture in full force."
    },
    {
      "title": "iPhone 13 Pro Cora Wallet Jeb Black Croco",
      "price": "₵710.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Cora-Wallet-Jet-Black-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-cora-wallet-jeb-black-croco/",
      "description": "The Cora Phone Wallet in Jet Black Croco captures modern opulence and dexterity. Striking and bold in jet black, this design is the epitome of ultra-versatile elegance."
    },
    {
      "title": "iPhone 13 Atelier Wallet Intense Black",
      "price": "₵690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Wallet-Intense-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-atelier-wallet-intense-black/",
      "description": "Intense Black presents a crisp design, composed in a sleek and smooth black canvas. Exuding modern simplicity, this style captures timeless sophistication and stands out with its refined and intense colour."
    },
    {
      "title": "iPhone 13 Pro Atelier Wallet Intense Black",
      "price": "₵690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Atelier-Wallet-Intense-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-wallet-intense-black/",
      "description": "Intense Black presents a crisp design, composed in a sleek and smooth black canvas. Exuding modern simplicity, this style captures timeless sophistication and stands out with its refined and intense colour."
    },
    {
      "title": "iPhone 13 Pro Cassette Clutch Black Croco",
      "price": "₵665.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Cassette-Clutch-Black-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-cassette-clutch-black-croco/",
      "description": "The Cassette Clutch in Black Croco captures a timeless elegance with a classic black and exquisite croco finish. Combining simplicity with luxury, this piece exudes sophistication and charm, all wrapped up in a small and practical statement piece."
    },
    {
      "title": "iPhone 13 Pro Cassette Clutch Midnight Leopard",
      "price": "₵665.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Cassette-Clutch-Midnight-Leopard-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-cassette-clutch-midnight-leopard/",
      "description": "The Cassette Clutch in Midnight Leopard displays a bold pattern combination, composed of a sleek black canvas and illustrious leopard print. This style evokes unquestionable confidence, all wrapped up in a small and practical statement piece."
    },
    {
      "title": "iPhone 13 Cassette Clutch Midnight Leopard",
      "price": "₵665.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Cassette-Clutch-Midnight-Leopard-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-cassette-clutch-midnight-leopard/",
      "description": "The Cassette Clutch in Midnight Leopard displays a bold pattern combination, composed of a sleek black canvas and illustrious leopard print. This style evokes unquestionable confidence, all wrapped up in a small and practical statement piece."
    },
    {
      "title": "iPhone 11 Pro Moshi Overture Case – Black",
      "price": "₵650.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MOSHI-IPH11PRO-OVERTURE-CASE-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-11-pro-moshi-overture-case-black/",
      "description": "Overture is a premium 2-in-1 case and magnetic wallet that can be used either independently or together. Both provide your phone with military-grade drop protection. Crafted from quality vegan leather, Overture perfectly complements any wardrobe. The wallet features two card slots and a full-length pocket for cash and receipts. When used independently the slim case supports wireless charging pass-through and can be used with our SnapTo mounting system. Like all Moshi cases, Overture is crafted from non-toxic and BPA-free materials."
    },
    {
      "title": "iPhone 11 Pro Moshi Altra Slim Case with Detachable Wrist Strap -Black",
      "price": "₵650.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MOSHI-IPH11PRO-ALTRA-SLIM-CASE-WITH-DETACHABLE-WRIST-STRAP--300x275.jpg",
      "url": "https://telefonika.com/product/iphone-11-pro-moshi-altra-slim-case-with-detachable-wrist-strap-black/",
      "description": "Protect your iPhone 11 Pro with this stylish slim case from Moshi. This case features a detachable wrist strap to open a new world of hands-free convenience. A textured pattern improves grip and the case is compatible with Moshi’s SnapTo mounting system. Key Features Military-Grade Drop Protection Detachable Wrist Strap For Hands-Free Convenience Bespoke Fitting & PU Luxury Grip Material Compatible With Wireless Charging Compatible With Moshi’s SnapTo™ Mounting System"
    },
    {
      "title": "IDEAL OF SWEDEN Atelier Case iPhone 14 Pro Velour Hyper Pink",
      "price": "₵640.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IDEAL-OF-SWEDEN-Atelier-Case-iPhone-14PR-Velour-Hyper-Pink-I-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-atelier-case-iphone-14pr-velour-hyper-pink/",
      "description": "OVERVIEW Add a signature to your phone by selecting any of our unique designs. This case comes in a handcrafted, protective design with raised edges around the camera and screen. Made of animal-free, recycled materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Gripfriendly design Microfiber lining to prevent scratches MATERIALS Composition: Outer shell: 100% polyurethane. Inner shell: 100% polycarbonate. Lining: 51% recycled polyester and 49% polyester Metal hardware: 100% zinc alloy COMPATIBILITY Accessories of Attraction: part of our magnetically compatible product range Compatible with IDEAL wireless"
    },
    {
      "title": "Samsung Galaxy Z Flip5 Silicone Case with Ring",
      "price": "₵640.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Galaxy-Z-Flip5-Silicone-Case-with-Ring-1-300x275.jpg",
      "url": "https://telefonika.com/product/samsung-galaxy-z-flip5-silicone-case-with-ring/",
      "description": "Trendy colors for a trendy you The case comes in trendy color variations, ideal to express your one-of-a-kind taste with an eye-catching hue. It is designed with the planet in mind. * Image simulated for illustration purposes. ** Availability of colors and models may vary by country or region. *** Actual UX/UI may differ. Ring for easy portability Get a good grip on your phone while texting or web-surfing thanks to the case’s premium, easy-to-carry ring. Simply slide your finger into the ring and experience a comfortable and secure hold while using it."
    },
    {
      "title": "ZAGG Gear4-Cases-Havana Snap-Apple-IP 14 Pro Max-Blue7020100",
      "price": "₵620.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/ZAGG-Gear4-Cases-Havana-Snap-Apple-IP-14-Pro-Max-Blue7020100-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-gear4-cases-havana-snap-apple-ip-14-pro-max-blue7020100/",
      "description": "EFFECTIVE DROP PROTECTION – ZAGG Gear4 Havana Case is the ultimate protective iPhone case made with flexible D30 material that hardens on impact, dissipating the shock and protecting your device. Provides up to 10ft (3m) drop resistance WIRELESS CHARGING COMPATIBLE – This iPhone case for wireless charging is compatible with most wireless charging systems. No need to remove the Gear4 iPhone case from your phone. Just place it on the wireless charger for efficient charging STYLISH AND FUNCTIONAL – Its slim and lightweight design makes it very handy. The cell phone case is easy to slide into your pocket or"
    },
    {
      "title": "ZAGG Gear4-Cases-Havana Snap-Apple-IP 14 Pro-Blue702010062",
      "price": "₵620.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/ZAGG-Gear4-Cases-Havana-Snap-Apple-IP-14-Pro-Max-Blue7020100-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-gear4-cases-havana-snap-apple-ip-14-pro-blue702010062/",
      "description": "EFFECTIVE DROP PROTECTION – ZAGG Gear4 Havana Case is the ultimate protective iPhone case made with flexible D30 material that hardens on impact, dissipating the shock and protecting your device. Provides up to 10ft (3m) drop resistance WIRELESS CHARGING COMPATIBLE – This iPhone case for wireless charging is compatible with most wireless charging systems. No need to remove the Gear4 iPhone case from your phone. Just place it on the wireless charger for efficient charging STYLISH AND FUNCTIONAL – Its slim and lightweight design makes it very handy. The cell phone case is easy to slide into your pocket or"
    },
    {
      "title": "iPhone 13 Atelier Wallet Lotus Snake",
      "price": "₵610.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Wallet-Lotus-Snake-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-atelier-wallet-lotus-snake/",
      "description": "Lotus Snake presents a soft pink tone and a gorgeous snake texture that is reminiscent of the everlasting beauty of the lotus flower. This design is the perfect touch of unique sophistication that never ceases to amaze. This glossy design channels practical luxury with a discretely embossed, gold-tone logo, a smooth microfiber lining and two sleek card slots on the back."
    },
    {
      "title": "iPhone 12 Pro Max Ordinary Phone Necklace Case Jet Black",
      "price": "₵590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-12-Pro-Max-Ordinary-Phone-Necklace-Case-Jet-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-pro-max-ordinary-phone-necklace-case-jet-black/",
      "description": "The Ordinary Phone Necklace Case in Jet Black evokes modern simplicity at its finest with a classic minimalist design and ultra-versatile elegance."
    },
    {
      "title": "iPhone 13 Mini Atelier Case Camel Croco",
      "price": "₵590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Camel-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-mini-atelier-case-camel-croco/",
      "description": "Camel Croco brings together a refined Croco texture with a minimalistic camel shade. Celebrating styles that never seize to appeal, this design captures a powerful combination of Scandinavian Minimalism and luxurious grandeur."
    },
    {
      "title": "iPhone 13 Atelier Case Midnight Leopard",
      "price": "₵590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Midnight-Leopard-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-atelier-case-midnight-leopard/",
      "description": "Midnight Leopard displays a striking contrasting design, composed of a sleek black canvas and illustrious leopard print. Inspired by the luxurious and powerful leopard motive, this style evokes unquestionable confidence and stands out with its bold pattern combination."
    },
    {
      "title": "iPhone 13 Pro Atelier Case Rose Smoke Croco",
      "price": "₵590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Rose-Smoke-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-case-rose-smoke-croco/",
      "description": "Rose Smoke Croco showcases the power of croco in a delicate dusty rose for a maximum impact. This design merges a pebbled leather finish with an irresistible croco texture for a mesmerising dual-textured statement piece."
    },
    {
      "title": "iPhone 12/12 Pro Ordinary Phone Necklace Case Misty Pink",
      "price": "₵590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-12-Pro-Max-Ordinary-Phone-Necklace-Case-Misty-Pink-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-12-pro-ordinary-phone-necklace-case-misty-pink/",
      "description": "The Ordinary Phone Necklace Case in Misty Pink adds a pop of colour and celebrates modern minimalism, a truly versatile chic design in a soft pink tone."
    },
    {
      "title": "iPhone 12/12 Pro Ordinary Phone Necklace Case Jet Black",
      "price": "₵590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-12-12-Pro-Ordinary-Phone-Necklace-Case-Jet-Black-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-12-12-pro-ordinary-phone-necklace-case-jet-black/",
      "description": "The Ordinary Phone Necklace Case in Jet Black evokes modern simplicity at its finest with a classic minimalist design and ultra-versatile elegance."
    },
    {
      "title": "iPhone 13 Atelier Case Rose Smoke Croco",
      "price": "₵580.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Rose-Smoke-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-atelier-case-rose-smoke-croco/",
      "description": "Rose Smoke Croco showcases the power of croco in a delicate dusty rose for a maximum impact. This design merges a pebbled leather finish with an irresistible croco texture for a mesmerising dual-textured statement piece."
    },
    {
      "title": "Ideal of Sweden Clear Case MagSafe compatible iPhone 13/14",
      "price": "₵570.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Ideal-of-Sweden-Clear-Case-Magsafe-compatible-iPhone-1314-C-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-clear-case-magsafe-compatible-iphone-13-14-c/",
      "description": "overview Add a transparent extra layer of protection to your phone. Our clear cases are drop tested and provide custom-fit all-around protection with raised edges to protect the camera and screen. Made of recycled and animal-free materials. This case is MagSafe compatible. DESIGN & FUNCTION Drop-proof, protective design with raised edges to protect the camera and screen Drop tested 1,82 meters/6 feet Custom fit all-around protection MATERIALS Composition: 100% recycled and recycled thermoplastic polyurethane COMPATIBILITY Compatible with Magsafe & IDEAL’s wireless charger This product has been independently tested by an internationally accredited laboratory. This product was drop tested from 6"
    },
    {
      "title": "Samsung Galaxy S23 Plus Smart View Wallet Case Lavender",
      "price": "₵550.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Samsung-Galaxy-S23-Plus-Smart-View-Wallet-Case-Lavender-300x300.jpg",
      "url": "https://telefonika.com/product/samsung-galaxy-s23-plus-smart-view-wallet-case-lavender/",
      "description": "Display window at a glance The Smart View Wallet Case lets you access the interactive display of your Galaxy S23+ phone without opening the cover. Available in a variety of shades, the case combines protection, style and convenience. *Availability of product color may vary by country.**Smartphone device sold separately.***Image simulated for illustration purposes. Just simple taps will do You can tap the display window to perform basic functions like answering the phone or pausing the music even with the cover closed. *Image simulated for illustration purposes. Carry your everyday essentials safe with your phone The Smart View Wallet Case lets"
    },
    {
      "title": "iPhone 13 Pro Atelier Case Midnight Leopard",
      "price": "₵550.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Midnight-Leopard-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-case-midnight-leopard/",
      "description": "Midnight Leopard displays a striking contrasting design, composed of a sleek black canvas and illustrious leopard print. Inspired by the luxurious and powerful leopard motive, this style evokes unquestionable confidence and stands out with its bold pattern combination."
    },
    {
      "title": "UAG – iPhone 12/12 Pro Metro Lite Case",
      "price": "₵540.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/METROPOLIS-LT-SERIES-IPHONE-12-PRO-5G-CASE-300x275.jpg",
      "url": "https://telefonika.com/product/uag-iphone-12-12-pro-metro-lite-case/",
      "description": "The Metropolis Lite series is constructed of premium materials that capture functionality and protection in perfect harmony. A seamless material inlay gives your phone a sleek yet bold look along with extra protective padded corners protecting it from drops. Now if your phone falls from your grasp or bag you wont worry when you’re picking it up. Available in 3 variants, Smooth Finish PU (SATN), Supple Italian Leather (LTHR), and High strength abrasion resistant fabric, Armortex (FIBR). Soft impact-resistant core & slim corner design Protective screen surround & oversized tactile buttons Debossed branding detail & seamless inlay material"
    },
    {
      "title": "UAG iPhone 12/12 Pro PathFinder CS-MN Camo",
      "price": "₵540.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/UAG-iPhone-12-Pro-PathFinder-CS-MN-Camo-300x275.jpg",
      "url": "https://telefonika.com/product/uag-iphone-12-12-pro-pathfinder-cs-mn-camo/",
      "description": "Feather-light composite construction cases feature our patented hard outer armor shell and soft impact resistant core with torsion screw detail Ultra-responsive oversized tactile buttons deliver a crisp, clean click-feel for improved functionality. Easy access to touchscreen and ports Soft raised screen surround bezel to protect touchscreen and camera lens along with scratch resistant skid pads and chiseled designed corners to provide protection against drops and bumps Compatible with Wireless Charging and Apple Pay. Integrated paracord lanyard anchor (lanyard is NOT included) use when on the go. Meets military drop-test standards [MIL STD 810G 516.6] providing increased shock protection"
    },
    {
      "title": "UAG iPhone 12/12 Pro Plasma Case",
      "price": "₵540.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PLASMA-SERIES-IPHONE-12-PRO-5G-CASE-300x275.jpg",
      "url": "https://telefonika.com/product/uag-iphone-12-12-pro-plasma-case/",
      "description": "Building off the foundation of our Pathfinder is the Plasma Series. Serious lightweight protection for adventurous individuals. Along with a visible honeycomb translucent look the Plasma Series takes your case up a notch. Ready when you are! Ready for that weekend trip to the desert or whatever your typical day decides to throw at you. Low profile perimeter edge with traction grip Feather-light composite construction Protective screen surround & oversized tactile buttons"
    },
    {
      "title": "IOS iPhone 13 Ordinary Necklace Case Ultra  Black",
      "price": "₵530.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/12/IOS-IPH13-Ordinary-Necklace-Case-Ultra-Black-IDONCAW21-I216-300x275.jpg",
      "url": "https://telefonika.com/product/ios-iph13-ordinary-necklace-case-ultra-black-idoncaw21-i216/",
      "description": "overview Add function to your case by enabling a hands-free experience. These necklace cases come in a slim yet protective design with raised edges around the camera and screen and a smooth microfiber lining. The adjustable strap feature allows for ultimate wearability. Made of animal-free materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Microfiber lining to prevent scratches MATERIALS Composition; 100% polycarbonate. Lining: 100% polyester Metal hardware: 100% zinc alloy COMPATIBILITY Compatible with IDEAL’s Wireless Chargers Accessories of Attraction: part of our magnetically compatible product range"
    },
    {
      "title": "IOS IPH13 PRO Atelier Case Charcoal Black",
      "price": "₵520.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IOS-IPH13-PRO-Atelier-Case-Charcoal-Black-IDACSS22-I2161P-40-300x275.jpg",
      "url": "https://telefonika.com/product/ios-iph13-pro-atelier-case-charcoal-black-idacss22-i2161p-40/",
      "description": "overview Add a signature to your phone by selecting any of our unique designs. This case comes in a handcrafted, protective design with raised edges around the camera and screen. Made of animal-free, recycled materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Gripfriendly design Microfierber to prevent scratches MATERIALS Composition: Outer shell: 100% polyurethane. Inner shell: 100% polycarbonate. Lining: 51% recycled polyester and 49% polyester Metal hardware: 100% zinc alloy COMPATIBILITY Accessories of Attraction: part of our magnetically compatible product range Compatible with IDEAL wireless Chargers"
    },
    {
      "title": "ZAGG Cases Denali Snap KS Apple Gomez LGPro Black 702312719",
      "price": "₵520.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/ZAGG-Cases-Denali-Snap-KS-Apple-Gomez-LGPro-Black-702312719-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-cases-denali-snap-ks-apple-gomez-lgpro-black-702312719/",
      "description": "The Denali Snap with Kickstand case is inspired by the tough and indomitable spirit of the mountains. This rugged, textured case is fortified with graphene— one of the strongest materials on earth! This MagSafe compatible case has dual layer design that provides up to 16 feet of drop protection.(1) 16ft│5m Drop Protection: Denali Snap with Kickstand has been tested and proven to protect your phone from drops up to 16 feet (5 meters).(1) Strengthened with Graphene: Graphene is harder than a diamond, yet more elastic than rubber, and up to 200x stronger than steel. Dual Layer Protection: The dual layer"
    },
    {
      "title": "iPhone 13 Pro Atelier Case Neo Noir Croco Silver",
      "price": "₵510.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Atelier-Case-Neo-Noir-Croco-Silver-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-case-neo-noir-croco-silver/",
      "description": "The Atelier Case in Neo Noir Croco – Silver reinvents classic black with a modern design that brings together the exquisite look of the Croco texture and the everlasting depth of black."
    },
    {
      "title": "iPhone 13 Pro Ordinary Necklace Case Cool Khaki",
      "price": "₵510.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Ordinary-Necklace-Case-Cool-Khaki-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-ordinary-necklace-case-cool-khaki/",
      "description": "The Ordinary Necklace Case in Cool Khaki is made to become your everyday essential. Max out on colour and convenience with this ultra-versatile design. The new range combines minimalistic styles with a muted palette and strap feature for ultimate wearability."
    },
    {
      "title": "iPhone 13 Pro Atelier Wallet Neo Noir Croco",
      "price": "₵510.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Atelier-Wallet-Neo-Noir-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-wallet-neo-noir-croco/",
      "description": "Neo Noir Croco reinvents classic black with a modern design that brings together the exquisite allure of the Croco and the everlasting depth of black. This glossy design channels practical luxury with a discretely embossed, gold-tone logo, a smooth microfiber lining and two sleek card slots on the back. Please note that each design is hand-crafted from carefully sourced materials and features a unique patina, its pattern may therefore vary from the image. Embossed glossy Croco texture. This product is made of ethical and animal-free materials Features two card slots on the back. Slim design. Includes a standard black PU"
    },
    {
      "title": "iPhone 13 Pro Atelier Case Camel Croco",
      "price": "₵510.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Atelier-Case-Camel-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-atelier-case-camel-croco/",
      "description": "Camel Croco brings together a refined Croco texture with a minimalistic camel shade. Celebrating styles that never seize to appeal, this design captures a powerful combination of Scandinavian Minimalism and luxurious grandeur."
    },
    {
      "title": "Gecko Apple iPad Pro 11 2022 Easy-Click 2.0 Cover.jpg",
      "price": "₵490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Gecko-Apple-iPad-Pro-11-2022-Easy-Click-2.0-Cover-300x275.jpg",
      "url": "https://telefonika.com/product/gecko-apple-ipad-pro-11-2022-easy-click-2-0-cover-jpg/",
      "description": "This Easy-Click cover is designed to perfectly fit your device, meaning you can simply click your tablet into the strong plastic shell to secure it in place. The result is a sleek cover that protects your tablet from damage. The cover allows you to place your tablet in different positions, enabling you to use your tablet optimally in countless situations. Optimal ease of use The cover has all the appriate openings to allow easy access to the various ports and buttons on your tablet. The camera can therefore also be used without removing the tablet from the cover, for example."
    },
    {
      "title": "Apple iPhone 11 Pro Leather Case",
      "price": "₵490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MWYA2-Apple-iPhone-11-Pro-Leather-Case-MEYER-LEMON-300x275.jpg",
      "url": "https://telefonika.com/product/apple-iphone-11-pro-leather-case/",
      "description": "They’re made from specially tanned and finished European leather, so the outside feels soft to the touch and develops a natural patina over time. The machined aluminum buttons match the finish of your leather case, while a microfiber lining inside helps protect your iPhone. And you can keep it on all the time, even when you’re charging wirelessly. Just like every Apple-designed case, it’s put through thousands of hours of testing throughout the design and manufacturing process. So not only does it look great, it’s built to protect your iPhone from scratches and drops."
    },
    {
      "title": "ZAGG Gear4-Cases-Crystal Palace-Apple-IP 14 Pro-Clear7020100",
      "price": "₵490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/ZAGG-Gear4-Cases-Crystal-Palace-Apple-IP-14-Pro-Clear7020100-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-gear4-cases-crystal-palace-apple-ip-14-pro-clear7020100/",
      "description": "Crystal Palace is drop resistant up to 13ft/4m thanks to the D3O® approved material. The backplate is made of polycarbonate (PC), the same material that’s used in bulletproof glass, so it will keep your device safe and sound."
    },
    {
      "title": "ZAGG-Cases-Crystal Palace SnapKS-Apple-iP15 Pro-FG-CLR 70231",
      "price": "₵470.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/06/ZAGG-Cases-Crystal-Palace-SnapKS-Apple-iP15-Pro-FG-CLR-70231-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-cases-crystal-palace-snapks-apple-ip15-pro-fg-clr-70231/",
      "description": "ULTIMATE IMPACT PROTECTION – Made of crystal clear scratch-resistant Graphene, one of the hardest materials on earth, the ZAGG Crystal Palace Snap Case for iPhone 15 is an extremely protective clear case with drop resistance of up to 13 feet (4m) FLAUNT YOUR DEVICE – With its minimalistic sleek design, this aesthetic phone case lets you showcase your phone. The slim and lightweight clear phone case is not bulky so your phone fits easily in your pocket and comfortably in your hand WIRELESS CHARGING COMPATIBLE – This cell phone case is a MagSafe-compatible iPhone case for wireless charging. No need"
    },
    {
      "title": "ZAGG Cases Crystal Palace SnapKS Apple Pugsley SM/iPhone 14/",
      "price": "₵470.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/ZAGG-Cases-Crystal-Palace-SnapKS-Apple-Pugsley-SMiPhone-14-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-cases-crystal-palace-snapks-apple-pugsley-sm-iphone-14/",
      "description": "ZAGG Cases Crystal Palace SnapKS Apple iPhone 15/iPhone 14/13 CLR EN/FR. Case type: Cover, Brand compatibility: Apple, Compatibility: iPhone 15, iPhone 14, iPhone 13, Maximum screen size: 15.5 cm (6.1″), Surface coloration: Monochromatic, Product colour: Transparent, Desktop stand Crystal Palace has always been a consistent favourite because it shows off your phone while providing amazing drop protection. And now we’ve made it better. The new Crystal Palace Snap with Kickstand has been strengthened with graphene, one of the strongest materials on earth. It’s thin, flexible, and heat conducive, making it ideal for unbeatable case protection. But that’s not all. This"
    },
    {
      "title": "Nudient Form Case iPhone 15 Pro Max (with Magsafe)",
      "price": "₵450.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/nudient-Form-Case-iPhone-15-Pro-Max-with-MagSafe-Clear-Bl-300x275.jpg",
      "url": "https://telefonika.com/product/nudient-form-case-iphone-15-pro-max-with-magsafe/",
      "description": "Reinvigorate your phone with the Form Case, where transparent textures and colours become one and a brand new expressive recognition is introduced. Made of protective silhouettes and organic shapes that allow for integration of new proportions. Acquire a discreet and minimalistic look with Form in the shade of Clear Black. This product has MagSafe magnets"
    },
    {
      "title": "iPhone 11 Pro Moshi iGlaze SnapTo Series Slim Hardshell Case",
      "price": "₵450.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/MOSHI-IPH11PRO-iglaze-SNAPTO-SERIES-SLIM-HARDSHELL-CASE-BL-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-11-pro-moshi-iglaze-snapto-series-slim-hardshell-case/",
      "description": "Moshi iGlaze offers the perfect blend of design, functionality and drop protection. This shock-absorbing case has a metal frame that is of excellent construction. Like all Moshi iPhone cases, iGlaze is 100% non-toxic and BPA-free. This is compatible with our SnapTo series."
    },
    {
      "title": "ZAGG Cases Milan Snap Apple Gomez LGPro Iridescent 702312659",
      "price": "₵420.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/03/ZAGG-Cases-Milan-Snap-Apple-Gomez-LGPro-Iridescent-702312659-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-cases-milan-snap-apple-gomez-lgpro-iridescent-702312659/",
      "description": "IRIDESCENT IPHONE CASE – The ZAGG Milan Snap Case is the ultimate MagSafe case for the iPhone 15. Made with durable Graphene, one of the hardest materials on earth, to protect your phone against drops of up to 13ft (4m) FLAUNT YOUR DEVICE – With its minimalistic design, this aesthetic phone case lets you showcase your iPhone. The beautiful, iridescent finish complements the sleek lines, so your iPhone looks stunning while being completely protected WIRELESS CHARGING COMPATIBLE – The ZAGG iPhone15 case is compatible with most MagSafe Chargers. No need to remove the cell phone case from your iPhone 15."
    },
    {
      "title": "iPhone 13 Mini Fashion Case Golden Ruby",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Golden-Ruby-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-mini-fashion-case-golden-ruby/",
      "description": "Golden Ruby Marble takes its inspiration from precious marble stones and the rich luminosity of the ruby gem, all combined with sparkling golden hues. The vibrant print evokes confidence and stands out with its alluring depth."
    },
    {
      "title": "Ideal of Sweden Silicone Case MagSafe iPhone 15 Pro Max",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Ideal-of-Sweden-Silicone-Case-MagSafe-iPhone-15PM-Black-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-silicone-case-magsafe-iphone-15-pro-max/",
      "description": "OVERVIEW Give your phone the ultimate treatment with superior protection, a grip-friendly, peachy surface, and playful colours. Our Silicone Case are drop tested and provides custom-fit all-around protection, an antidust-resistant coating, and a microfiber lining to prevent scratches. It’s made from animal-free and recycled materials. This case is magsafe compatible DESIGN & FUNCTION Protective design with raised edges to protect the camera and screen Microfiber lining to prevent scratches Custom fit all-around protection Antidust and fingerprint coating Drop tested 1,52 meters/5 feet Soft-touch finish and grip-friendly surface MATERIALS Composition: 100% recycled polycarbonate; 100% Liquid silicone; Lining: 51% recycled polyester COMPATIBILITY"
    },
    {
      "title": "iPhone 13 Mini Fashion Case Floral Romance",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Floral-Romance-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-mini-fashion-case-floral-romance/",
      "description": "All summers need the colors and heady scents of flowers in bloom – and florals were everywhere on the runways this season. So this case is all you need to stay in style right now. As always with timeless florals, the look can also live on for seasons to come. Light and feminine, the case will be perfect with a pair of crisp white jeans or your dreamiest dress as you stroll through a meadow in the hazy golden hour of a midsummer night."
    },
    {
      "title": "Ideal of Sweden Clear Case iPhone 15 Pro Mirror",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Ideal-of-Sweden-Clear-Case-iPhone-15PR-Mirror-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-clear-case-iphone-15-pro-mirror/",
      "description": "OVERVIEW Add a metallic extra layer of protection to your phone with a convenient mirror function. Our clear cases are drop tested and provide custom-fit all-around protection with raised edges to protect the camera and screen. Optimised to prevent yellowing and made of recycled and animal-free materials. DESIGN & FUNCTION * Protective design with raised edges to protect the camera and screen * Drop tested 1,82 meters/6 feet * Custom fit all-around protection * Optimized to prevent yellowing * Due to the mirror effect / surface scratches may be more visible MATERIALS * Composition: 100% recycled polycarbonate, 50% recycled thermoplastic"
    },
    {
      "title": "Ideal of Sweden Seamless Case iPhone 13/14 Midnight Blue",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/Ideal-of-Sweden-Seamless-Case-iPhone-1314-Midnight-Blue-ID-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-seamless-case-iphone-13-14-midnight-blue-id/",
      "description": "overview Make your phone pop with a splash of colour. Our Seamless cases come in a slim yet protective design with raised edges around the camera and screen, a smooth microfiber lining, and a grip-friendly surface with a soft and mat feel. Part of our magnetically compatible product range and made of animal-free materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Microfiber lining to prevent scratches MATERIALS Composition; outer shell: 100% polycarbonate Lining: 100% polyester Metal hardware: 100% zinc alloy COMPATIBILITY Compatible with IDEAL’s Wireless Chargers"
    },
    {
      "title": "Nudient Bold Case iPhone 15 Pro Max",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/nudient-Bold-Case-iPhone-15-Pro-Max-Charcoal-Black-300x275.jpg",
      "url": "https://telefonika.com/product/nudient-bold-case-iphone-15-pro-max/",
      "description": "Add a creative touch to your smartphone and provide it with the necessary protection with the Nudient Bold iPhone 15 Pro Max Case. This iPhone 15 Pro Max case features a highly distinctive design, with a high level of protection guaranteed, in addition to a sturdy aluminum frame. Features of the Nudient iPhone 15 Pro Max Case: The iPhone 15 Pro Max protective cover is designed with recycled plastic for a more modern design. The soft silicone outer surface ensures a more comfortable grip of the iPhone 15 Pro Max protective case. You can provide the best protection for your"
    },
    {
      "title": "Nudient Bold Case iPhone 15 Pro Max",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/nudient-Bold-Case-iPhone-15-Pro-Max-Charcoal-Black-300x275.jpg",
      "url": "https://telefonika.com/product/nudient-bold-case-iphone-15-pro-max/",
      "description": "Add a creative touch to your smartphone and provide it with the necessary protection with the Nudient Bold iPhone 15 Pro Max Case. This iPhone 15 Pro Max case features a highly distinctive design, with a high level of protection guaranteed, in addition to a sturdy aluminum frame. Features of the Nudient iPhone 15 Pro Max Case: The iPhone 15 Pro Max protective cover is designed with recycled plastic for a more modern design. The soft silicone outer surface ensures a more comfortable grip of the iPhone 15 Pro Max protective case. You can provide the best protection for your"
    },
    {
      "title": "Ideal of Sweden Seamless Case iPhone 13/14 Blush Pink",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/03/Ideal-of-Sweden-Seamless-Case-iPhone-1314-Blush-Pink-IDFCSS-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-seamless-case-iphone-13-14-blush-pink-idfcss/",
      "description": "OVERVIEW Make your phone pop with a splash of colour. Our Seamless cases come in a slim yet protective design with raised edges around the camera and screen, a smooth microfiber lining, and a grip-friendly surface with a soft and mat feel. Part of our magnetically compatible product range and made of animal-free materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Microfiber lining to prevent scratches MATERIALS Composition; outer shell: 100% polycarbonate Lining: 100% polyester Metal hardware: 100% zinc alloy COMPATIBILITY Compatible with IDEAL’s Wireless Chargers"
    },
    {
      "title": "Ideal of Sweden Silicone Case MagSafe iPhone 15 Pro",
      "price": "₵390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Ideal-of-Sweden-Silicone-Case-MagSafe-iPhone-15PR-Black-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-silicone-case-magsafe-iphone-15-pro/",
      "description": "OVERVIEW Give your phone the ultimate treatment with superior protection, a grip-friendly, peachy surface, and playful colours. Our Silicone Case are drop tested and provides custom-fit all-around protection, an antidust-resistant coating, and a microfiber lining to prevent scratches. It’s made from animal-free and recycled materials. This case is magsafe compatible DESIGN & FUNCTION Protective design with raised edges to protect the camera and screen Microfiber lining to prevent scratches Custom fit all-around protection Antidust and fingerprint coating Drop tested 1,52 meters/5 feet Soft-touch finish and grip-friendly surface MATERIALS Composition: 100% recycled polycarbonate; 100% Liquid silicone; Lining: 51% recycled polyester COMPATIBILITY"
    },
    {
      "title": "iPhone 11 Pro Moshi Vitros Slim & Stylish Protection Case",
      "price": "₵370.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MOSHI-IPH11PRO-VITROS-SLIM-STYLISH-PROTECTION-CASE-CLEAR-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-11-pro-moshi-vitros-slim-stylish-protection-case/",
      "description": "Ultra-clear case with military-grade drop protection. Crafted from a flexible, yet durable polymer for easy installation. Like all Moshi iPhone cases, Vitros is 100% non-toxic and BPA-free."
    },
    {
      "title": "Ideal of Sweden Clear Case iPhone 13/14 Clear",
      "price": "₵370.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Ideal-of-Sweden-Clear-Case-iPhone-1314-Clear-IDCLCSS23-I22-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-clear-case-iphone-13-14-clear-idclcss23-i22/",
      "description": "overview Add a transparent extra layer of protection to your phone. Our clear cases are drop tested and provide custom-fit all-around protection with raised edges to protect the camera and screen. Made of recycled and animal-free materials. DESIGN & FUNCTION Protective design with raised edges to protect the camera and screen Drop tested 1,82 meters/6 feet Custom fit all-around protection MATERIALS Composition: 100% recycled recycled thermoplastic polyurethane COMPATIBILITY Compatible with IDEAL’s Wireless Chargers This product has been independently tested by an internationally accredited laboratory. This product was drop tested from 6 feet (1,82 meters) *Please note that the drop test"
    },
    {
      "title": "iPhone 13 Atelier Case Neo Noir Croco",
      "price": "₵360.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Neo-Noir-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-atelier-case-neo-noir-croco/",
      "description": "Neo Noir Croco reinvents classic black with a modern design, bringing together the irresistible appeal of Croco texture with refined, gold-tone hardware and detailing around the camera. The discrete envelope flap holds your most important cards with utmost elegance."
    },
    {
      "title": "iPhone 13 Atelier Case Camel Croco",
      "price": "₵360.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Atelier-Case-Camel-Croco-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-atelier-case-camel-croco/",
      "description": "Camel Croco brings together a refined Croco texture with a minimalistic camel shade. Celebrating styles that never seize to appeal, this design captures a powerful combination of Scandinavian Minimalism and luxurious grandeur."
    },
    {
      "title": "ZAGG Cases Luxe Snap PCR Apple Pugsley SM/iPhone 14/13 Black",
      "price": "₵350.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/ZAGG-Cases-Luxe-Snap-PCR-Apple-Pugsley-SMiPhone-1413-Black-300x275.jpg",
      "url": "https://telefonika.com/product/zagg-cases-luxe-snap-pcr-apple-pugsley-sm-iphone-14-13-black/",
      "description": "10ft Drop Protection: Tested to Mil Std 810G 516, Luxe Snap safeguards your iPhone 15 from falls up to 10 feet, ensuring your device remains intact Graphene-Strengthened Durability: Harnessing the power of graphene, known for its extreme strength and flexibility, this case offers unparalleled protection MagSafe Compatibility: Perfectly aligns with iPhone 15’s MagSafe technology for seamless wireless charging and accessory attachment Eco-Conscious Design: Crafted with 95% recycled content, verified by an independent third party, for an environmentally responsible choice Ergonomic and Lightweight: A slim, flexible design that feels comfortable in hand and slips easily into your pocket, without added bulk"
    },
    {
      "title": "Gecko Apple iPad 10.2 (19/20/21) Easy-Click 2.0 Cover – Sand",
      "price": "₵350.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Gecko-Apple-iPad-10.2-19_20_21-Easy-Click-2.0-Cover-Sand-V10T59C23_-medium.png",
      "url": "https://telefonika.com/product/gecko-apple-ipad-10-2-19-20-21-easy-click-2-0-cover-sand-v10t59c23/",
      "description": "This Easy-Click cover is designed to perfectly fit your device, meaning you can simply click your tablet into the strong plastic shell to secure it in place. The result is a sleek cover that tects your tablet from damage. The cover allows you to place your tablet in different positions, enabling you to use your tablet optimally in countless situations. Optimal ease of use The cover has all the appriate openings to allow easy access to the various ports and buttons on your tablet. The camera can therefore also be used without removing the tablet from the cover, for example."
    },
    {
      "title": "Gecko Apple iPad 10.2 (19/20/21) Easy-Click 2.0 Cover – Petrol",
      "price": "₵350.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Gecko-Apple-iPad-10.2-19_20_21-Easy-Click-2.0-Cover-Petrol_-medium.png",
      "url": "https://telefonika.com/product/gecko-apple-ipad-10-2-19-20-21-easy-click-2-0-cover-petrol/",
      "description": "This Easy-Click cover is designed to perfectly fit your device, meaning you can simply click your tablet into the strong plastic shell to secure it in place. The result is a sleek cover that tects your tablet from damage. The cover allows you to place your tablet in different positions, enabling you to use your tablet optimally in countless situations. Optimal ease of use The cover has all the appriate openings to allow easy access to the various ports and buttons on your tablet. The camera can therefore also be used without removing the tablet from the cover, for example."
    },
    {
      "title": "Gecko Apple iPad 10.2 (19/20/21) Easy-Click 2.0 Cover – Black",
      "price": "₵350.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Gecko-Apple-iPad-10.2-19_20_21-Easy-Click-2.0-Cover-Black-medium.png",
      "url": "https://telefonika.com/product/gecko-apple-ipad-10-2-19-20-21-easy-click-2-0-cover-black/",
      "description": "This Easy-Click cover is designed to perfectly fit your device, meaning you can simply click your tablet into the strong plastic shell to secure it in place. The result is a sleek cover that tects your tablet from damage. The cover allows you to place your tablet in different positions, enabling you to use your tablet optimally in countless situations. Optimal ease of use The cover has all the appriate openings to allow easy access to the various ports and buttons on your tablet. The camera can therefore also be used without removing the tablet from the cover, for example."
    },
    {
      "title": "UAG Apple iPhone 12/12 Pro U Lucent Case – Ice",
      "price": "₵350.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/UAG-Apple-iPhone-1212-Pro-U-Lucent-Case-Ice-300x275.jpg",
      "url": "https://telefonika.com/product/uag-apple-iphone-12-12-pro-u-lucent-case-ice/",
      "description": "UAG U Lucent  Designed with mobility in mind, our Lucent phone case is a featherlight, impact-resistant handset with a soft, premium hand-feel topped off with a translucent, progressive microdot pattern. Translation: Modern, sophisticated protection at your fingertips. Features: Featherlight construction with soft impact-resistant core Embossed branding detail One piece translucent design"
    },
    {
      "title": "Nudient Form Bumpy Case iPhone 15 Pro Max",
      "price": "₵340.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/nudient-Form-Bumpy-Case-iPhone-15-Pro-Max-Transparent-300x275.jpg",
      "url": "https://telefonika.com/product/nudient-form-bumpy-case-iphone-15-pro-max-transparent/",
      "description": "Reinvigorate your phone with the Form Case, where transparent textures and colours become one and a brand new expressive recognition is introduced. Made of protective silhouettes and organic shapes that allow for integration of new proportions. Acquire a discreet and minimalistic look with Form in the shade of Clear Black. This product has MagSafe magnets"
    },
    {
      "title": "iPhone 13 Pro Fashion Case Black Satin",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Fashion-Case-Black-Satin-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-black-satin/",
      "description": "The Fashion Case in Black Satin is irresistible alluring and presents a glossy satin composition, in the most captivating black."
    },
    {
      "title": "iPhone 13 Fashion Case Black Satin",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Black-Satin-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-black-satin/",
      "description": "The Fashion Case in Black Satin is irresistible alluring and presents a glossy satin composition, in the most captivating black."
    },
    {
      "title": "iPhone 13 Pro Fashion Case Rose Pearl Marble",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IOS-IPH13PRO-FASHION-CASE-ROSE-PEARL-MARBLE-IDFCSS21-I2161P-257-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-rose-pearl-marble/",
      "description": "Rose Pearl Marble showcases a luminous design with pearly whites and creamy rose shades, harmoniously intertwined to create the perfect jewel. This design captures the essence of precious marble stone and pearl."
    },
    {
      "title": "iPhone 13 Fashion Case Sparkle Greige Marble",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Sparkle-Greige-Marble-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-sparkle-greige-marble/",
      "description": "With sandy nuances and metallic highlights, the swirly marble design conveys a natural warmth and beachy feel. The organic structure is offset by delicate gold sprinkles for a sparkly finishing touch."
    },
    {
      "title": "iPhone 13 Pro Fashion Case Port Laurent Marble",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Fashion-Case-Port-Laurent-Marble-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-port-laurent-marble/",
      "description": "Marble is without a doubt the trend to watch right now. Over the last few years it has gotten increasingly popular, and the hype doesn’t seem to slow down anytime soon. What we love about it is the mix of classical and modern that provides a luxurious feeling and a glamorous sheen. Port Laurent marble, with its black base, and gold and blue highlights, is strikingly dramatic with an air of elegant decadence."
    },
    {
      "title": "iPhone 13 Pro Fashion Case Matte Camo",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Fashion-Case-Matte-Camo-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-matte-camo/",
      "description": "In Matte Camo takes its inspiration from the powerful and layered camo print, paired with a smooth, matte grey finish. This vivid print evokes strength and stands out with its avant-garde edge."
    },
    {
      "title": "iPhone 13 Fashion Case Wild Leopard",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Wild-Leopard-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-wild-leopard/",
      "description": "Take a walk on the wild side – or just stretch out on a lounge chair. Whatever side of the leopard best suits you, this slinky and sexy cellphone case has you covered. Sumptuous fur and animal prints were seen on numerous catwalks this season and with Wild Leopard you can adopt the trend with a clear conscience. Go fur – but go faux."
    },
    {
      "title": "Ideal of Sweden Seamless Case Galaxy S23 Plus",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2023/10/IDEAL-OF-SWEDEN-Seamless-Case-Galaxy-S23-Midnight-Blue-IDFCS-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-seamless-case-galaxy-s23-plus/",
      "description": "OVERVIEW Accessorise your phone and add a personal touch by choosing any of our unique designs. These slim yet protective cases provide raised edges around the camera and screen, and a smooth microfiber lining to prevent scratching. Part of our magnetically compatible product range and made of recycled and animal-free materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Microfiber lining to prevent scratches MATERIALS Composition; outer shell: 97% recycled polycarbonate and 3% other Lining: 51% recycled polyester Metal hardware: 100% zinc alloy COMPATIBILITY Compatible with IDEAL’s"
    },
    {
      "title": "iPhone 13 Pro Fashion Case Golden Twilight",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Fashion-Case-Golden-Twilight-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-golden-twilight/",
      "description": "Golden Twilight Marble takes its inspiration from precious marble stones and the magical entity of the night sky. The eye-catching design evokes mystique and stands out with its unique pattern."
    },
    {
      "title": "iPhone 13 Fashion Case Rose Pearl Marble",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Rose-Pearl-Marble-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-rose-pearl-marble/",
      "description": "Rose Pearl Marble showcases a luminous design with pearly whites and creamy rose shades, harmoniously intertwined to create the perfect jewel. This design captures the essence of precious marble stone and pearl."
    },
    {
      "title": "iPhone 13 Pro Fashion Case Golden Ruby",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Fashion-Case-Golden-Ruby-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-golden-ruby/",
      "description": "Golden Ruby Marble takes its inspiration from precious marble stones and the rich luminosity of the ruby gem, all combined with sparkling golden hues. The vibrant print evokes confidence and stands out with its alluring depth."
    },
    {
      "title": "iPhone 13 Fashion Case Golden Ruby",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Golden-Ruby-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-golden-ruby/",
      "description": "Golden Ruby Marble takes its inspiration from precious marble stones and the rich luminosity of the ruby gem, all combined with sparkling golden hues. The vibrant print evokes confidence and stands out with its alluring depth."
    },
    {
      "title": "iPhone 13 Pro Fashion Case Black Satin",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Pro-Max-Fashion-Case-Black-Satin-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-black-satin/",
      "description": "The Fashion Case in Black Satin is irresistible alluring and presents a glossy satin composition, in the most captivating black."
    },
    {
      "title": "iPhone 13 Fashion Case Black Satin",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Black-Satin-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-black-satin/",
      "description": "The Fashion Case in Black Satin is irresistible alluring and presents a glossy satin composition, in the most captivating black."
    },
    {
      "title": "iPhone 13 Pro Fashion Case Rose Pearl Marble",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IOS-IPH13PRO-FASHION-CASE-ROSE-PEARL-MARBLE-IDFCSS21-I2161P-257-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-pro-fashion-case-rose-pearl-marble/",
      "description": "Rose Pearl Marble showcases a luminous design with pearly whites and creamy rose shades, harmoniously intertwined to create the perfect jewel. This design captures the essence of precious marble stone and pearl."
    },
    {
      "title": "iPhone 13 Fashion Case Sparkle Greige Marble",
      "price": "₵330.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Sparkle-Greige-Marble-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-sparkle-greige-marble/",
      "description": "With sandy nuances and metallic highlights, the swirly marble design conveys a natural warmth and beachy feel. The organic structure is offset by delicate gold sprinkles for a sparkly finishing touch."
    },
    {
      "title": "IOS IPH13 PRO  Seamless Case  Midnight Blue",
      "price": "₵325.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IOS-IPH13-PRO-Seamless-Case-Midnight-Blue-IDFCSS22-I2161P--300x275.jpg",
      "url": "https://telefonika.com/product/ios-iph13-pro-seamless-case-midnight-blue-idfcss22-i2161p/",
      "description": "OVERVIEW Make your phone shine with a touch of color. Our Seamless Cases feature a slim and protective design with raised edges to protect the camera and screen, a supple microfiber interior and a grippy matte finish that’s pleasantly soft to the touch. Part of our magnetic product range and made from materials without animal ingredients. DESIGN & FUNCTION Sleek and protective design made from strong and durable polycarbonate Raised edges to protect screen and camera With microfiber lining to protect against scratches MATERIALS Outer material: 100% polycarbonate Inner lining: 100% polyester Metal Hardware: 100% Zinc Alloy COMPATIBILITY Suitable for use with"
    },
    {
      "title": "IOS IPH13 PRO Fashion Case  Denim Bliss",
      "price": "₵325.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IOS-IPH13-PRO-Fashion-Case-Denim-Bliss-IDFCSS22-I2161P-413-300x275.jpg",
      "url": "https://telefonika.com/product/ios-iph13-pro-fashion-case-denim-bliss-idfcss22-i2161p-413/",
      "description": "OVERVIEW Accessorise your phone and add a personal touch by choosing any of our unique designs. These slim yet protective cases provide raised edges around the camera and screen, and a smooth microfiber lining to prevent scratching. Part of our magnetically compatible product range and made of animal-free materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Microfiber lining to prevent scratches MATERIALS Composition; 100% polycarbonate Lining: 100% polyester Metal hardware: 100% zinc alloy COMPATIBILITY Compatible with IDEAL’s Wireless Chargers Accessories of Attraction: part of our magnetically"
    },
    {
      "title": "iPhone 13 Fashion Case Calcatta Ruby Marble",
      "price": "₵320.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-Fashion-Case-Calcatta-Ruby-Marble-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-fashion-case-calcatta-ruby-marble/",
      "description": "​​The Fashion Case in Calacatta Ruby Marble revisits our classic marble prints with a design inspired by the Calacatta stone. This design is available in a variety of colourways."
    },
    {
      "title": "Green Lion 4 in 1 Defender Pack for iPhone 15 Pro Max – Transparent",
      "price": "₵320.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GN4IN1DP15PMCL-Green-Lion-4-in-1-Defender-Pack-for-iPhone-15-Pro-Max-Transparent-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-4-in-1-defender-pack-for-iphone-15-pro-max-transparent/",
      "description": "Your smartphone is completely safe with the Green Lion 4 in 1 Defender Pack. It has a 360-degree, completely transparent anti-shock case that is both anti-shock and anti-yellowing. Additionally, a camera lens material that is anti-reflective, fingerprint- and scratch-resistant, as well as a 3D Pet HD Glass renowned for its durability, HD clarity, and anti-broken edges, round out the package. A single pack with absolute defends and pure clarity Anti-Shock Case Crystal Clear 360°Comprehensive Protection Anti-Yellowing Nano HD Full Protection High Quality Camera Lens Film HD Anti-Reflection Anti Fingerprint & Scratch 3D Pet HD Glass Anti-Broken Edges"
    },
    {
      "title": "IDEAL OF SWEDEN Seamless Case Galaxy S23",
      "price": "₵310.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/03/IDEAL-OF-SWEDEN-Seamless-Case-Galaxy-S23-Blush-Pink-IDFCSS22-300x275.jpg",
      "url": "https://telefonika.com/product/ideal-of-sweden-seamless-case-galaxy-s23-blush-pink/",
      "description": "OVERVIEW Accessorise your phone and add a personal touch by choosing any of our unique designs. These slim yet protective cases provide raised edges around the camera and screen, and a smooth microfiber lining to prevent scratching. Part of our magnetically compatible product range and made of recycled and animal-free materials. DESIGN & FUNCTION Slim and protective design made of strong and durable polycarbonate Raised edges to protect the camera and screen Microfiber lining to prevent scratches MATERIALS Composition; outer shell: 97% recycled polycarbonate and 3% other Lining: 51% recycled polyester Metal hardware: 100% zinc alloy COMPATIBILITY Compatible with IDEAL’s"
    },
    {
      "title": "Viva Madrid Shiba Back Case for iPhone 11 Pro – Dark Brown",
      "price": "₵290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Viva-Madrid-Shiba-Back-Case-for-iPhone-11-Pro-Dark-Brown-300x275.jpg",
      "url": "https://telefonika.com/product/viva-madrid-shiba-back-case-for-iphone-11-pro-dark-brown/",
      "description": "Viva Madrid Shiba Back Case for iPhone 11 Pro – Dark Brown"
    },
    {
      "title": "Green Lion Full HD Glass Screen Protector for iPad 10.9 2022",
      "price": "₵270.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Lion-Full-HD-Glass-Screen-Protector-for-iPad-10.9-2022-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-full-hd-glass-screen-protector-for-ipad-10-9-2022/",
      "description": "Green Lion is a leading accessory manufacturing brand with an advanced production system adopting sophisticated details. Full-screen coverage offers the best scratch and impact protection. The extreme clarity maintains the screen’s original brightness. The glass withstands the screen heat without wearing off and damaging the protective surface."
    },
    {
      "title": "Green Lion Heritage Magsafe Leather case iPhone 16 Pro Max – Black",
      "price": "₵240.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GNHEMGP16PMBK-Green-Lion-Heritage-Magsafe-Leather-case-iPhone-16-Pro-Max-Black-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-heritage-magsafe-leather-case-iphone-16-pro-max-black/",
      "description": "The Green Lion Heritage MagSafe Leather Case for iPhone 16 Pro Max/Pro meets luxury with practicality. High-quality leather imparts a rich look and feel while guaranteeing the protection of your gadget. Featuring MagSafe compatibility, this case seamlessly attaches chargers and accessories to keep your iPhone functional and stylish. The exact cutouts allow easy access to every port, button, and feature. The buttons are made of metal for an added class touch. Offering reliable drop protection will keep your iPhone safe from impacts, while the anti-scratch surface ensures that the case always looks new over time. It gives protection in style"
    },
    {
      "title": "Green Lion Gradient Magsafe Case for iPhone 16 Pro Max –  Black Titanium",
      "price": "₵240.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/GNGRA16PMBK-Green-Lion-Gradient-Magsafe-Case-for-iPhone-16-Pro-Max-Black-Titanium-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-gradient-magsafe-case-for-iphone-16-pro-max-black-titanium/",
      "description": "The Green Lion Gradient MagSafe Case for iPhone 16 Pro is the perfect combination of stylish design and advanced protection. This case is meticulously designed to fit your iPhone perfectly, ensuring it stays safe and stylish. It has a powerful magnetic lock. It perfectly supports MagSafe. So, it easily attaches and aligns with MagSafe chargers and accessories. An antioxidant layer helps keep the case looking fresh and prevents yellowing over time. The scratch-resistant exterior keeps your phone pristine. The air cushion technology protects it from drops and bumps. With a non-slip grip, this case gives you a secure and comfortable"
    },
    {
      "title": "Nudient Base Case iPhone 15 Pro Max Silicone Case",
      "price": "₵220.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/nudient-Base-Case-iPhone-15-Pro-Maxsilicone-case-Stone-Beig-300x275.jpg",
      "url": "https://telefonika.com/product/nudient-base-case-iphone-15-pro-max-silicone-case/",
      "description": "The Base case has a sleek silicone exterior with a smooth finish providing a comfortable grip. While adding a touch of style, it also protects your phone from scratches and damages. With a unique touch of this vibrant Orange hue, your phone is guaranteed to stand out."
    },
    {
      "title": "Green Lion 3D Corning Pro Sceen Protector for iPhone 15 Series – Clear",
      "price": "₵170.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GN3DCRPGL15PMCL-Green-Lion-3D-Corning-Pro-Sceen-Protector-for-iPhone-15-Pro-Max-Clear-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-3d-corning-pro-sceen-protector-for-iphone-15-series-clear/",
      "description": "Bubble-free application and clear visibility are features of the Green Lion 3D Corning Pro Black Edge Glass Protection. It has excellent sensitivity and is fingerprint-, grease-, scratch-, and grease-resistant. A simple, superior protection for your smartphone. ​Features Bubble Free Highly Responsive Crystal Clear Anti Fingerprint Grease Resistance Anti Scratch SKU:  GN3DCRPGL15PMCL  GN3DCRPGL15PCL EAN:  6935100177700   6935100177694"
    },
    {
      "title": "Green Lion Magsafe Delgado Case for iPhone 15 Pro Max – Clea",
      "price": "₵170.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/Green-Lion-Magsafe-Delgado-Case-for-iPhone-15-Pro-Max-Clea-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-magsafe-delgado-case-for-iphone-15-pro-max-clea/",
      "description": "Slim and strong, the Green Lion MagSafe Delgado Case. It is drop-tested, compatible with MagSafe for simple accessory attachment, and features unique camera protection. It is resistant to both fingerprints and scratches, so don’t be concerned. Your phone will seem sharp thanks to the Ultra HD clarity, and its slim design won’t add any extra bulk. Simply said, it’s easy and fashionable protection. ​Features Ultra Drop Protection MagSafe Compatibility Camera Protection Anti Fingerprint Anti Scratch Daily Protection Ultra HD Clarity Anti Scratch Slim Fit"
    },
    {
      "title": "Green Mirror Reflection Glass Screen Protector for iPhone 13",
      "price": "₵170.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/03/Green-Mirror-Reflection-Glass-Screen-Protector-for-iPhone-13-300x275.jpg",
      "url": "https://telefonika.com/product/green-mirror-reflection-glass-screen-protector-for-iphone-13/",
      "description": "Green Lion Tempered Glass Tempered Glass Mirror Reflection Glass Screen Protector Compatible for iPhone 13 Tempered glass that becomes a mirror when in “lock” mode or dark, turn your phone into a mirror with premium shatterproof protection! Help you to check your makeup and your appearance anytime you want."
    },
    {
      "title": "Green Folio Booktype Leather Case for iPhone 12 Mini",
      "price": "₵170.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IPH12MINI-GREEN-FOLIO-BOOKTYPE-LEATHER-CASE-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/green-folio-booktype-leather-case-for-iphone-12/",
      "description": "Green Folio Booktype Leather Case for iPhone 12 Mini"
    },
    {
      "title": "Levelo Clara Clear Case For iPhone 15 Pro – Clear",
      "price": "₵170.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Levelo-Clara-Clear-Case-For-iPhone-15-Pro-Clear-300x275.jpg",
      "url": "https://telefonika.com/product/levelo-clara-clear-case-for-iphone-15-pro-clear/",
      "description": "The Levelo Clara Clear Cases, designed specifically for the iPhone 15 series—including the Pro Max, Pro, Plus, and standard iPhone 15—merge aesthetic appeal with unparalleled protection. Crafted with precision, these cases maintain the iPhone’s sleek design visibility while ensuring its safety. Made from robust materials, the Levelo Clara is not only durable but also provides the resilience needed to withstand everyday wear and tear. One of its standout features is the bumper protection, meticulously engineered to absorb and dissipate impact, safeguarding your iPhone from potential damage. A clear choice for those valuing both style and substance, it’s the guardian every"
    },
    {
      "title": "Blueo Privacy HD Tempered Glass for iPhone 11",
      "price": "₵150.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IPH11-BLUEO-HD-PRIVACY-300x275.jpg",
      "url": "https://telefonika.com/product/blueo-privacy-hd-tempered-glass-for-iphone-11/",
      "description": "Privacy protected Easy installation with no risk of bubbles Smooth surface; Scratch, fingerprint, water, oil, dust, shock and slip resistant. 9H Tempered Glass 3 Times Stronger than PET material Olephobic Coating Pure Transparency and perfect clarity Anti-shatter Made With advanced heat tempered glass Olephobic Coating Fingerprint ,oil and smudge resistant Ultra Slim Almost invisible layer Maxi Oouch Responsiveness Smooth touch and unrivaled sensitivity Easy to install and remove"
    },
    {
      "title": "Green Explorer Series Shockproof Case for iPhone 12 5.4″ – Black",
      "price": "₵150.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Explorer-Series-Shockproof-Case-for-iPhone-12-5.4-B-300x275.jpg",
      "url": "https://telefonika.com/product/green-explorer-series-shockproof-case-for-iphone-12-5-4-black/",
      "description": "Compatible Brand: Apple iPhones Product Brand: Green Model Name: Explorer Shockproof Case Key Feature1: Anti-scratch, shock resistance & durable. Key Feature2: Full Protection Design & camera protection. Key Feature3: High-definition color Material: TPU+PC Function: Shockproof Case"
    },
    {
      "title": "Green Explorer Series Shockproof Case for iPhone 12 5.4″ – Green",
      "price": "₵150.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Explorer-Series-Shockproof-Case-for-iPhone-12-5.4-G-300x275.jpg",
      "url": "https://telefonika.com/product/green-explorer-series-shockproof-case-for-iphone-12-5-4-green/",
      "description": "Looking for a case that can keep up with your active lifestyle? Look no further than the Green Explorer Series Shockproof Case for iPhone 12 5.4″! This tough case is designed to protect your iPhone from bumps, drops, and scratches, while still maintaining a slim profile. The hard PC back and soft TPU bumper work together to create a durable barrier against the elements, while the raised bezel protects your screen from scratches and cracks. Plus, the handy built-in kickstand makes it easy to watch movies and videos hands-free. Whether you’re hiking, biking, or just running errands, the Green Explorer"
    },
    {
      "title": "Green Explorer Series Shockproof Case for iPhone 12 Pro 6.1″",
      "price": "₵140.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Explorer-Series-Shockproof-Case-for-iPhone-12-Pro-6.1-300x275.jpg",
      "url": "https://telefonika.com/product/green-explorer-series-shockproof-case-for-iphone-12-pro-6-1/",
      "description": "Green Explorer Series Shockproof Case for iPhone 12 Pro 6.1″ – Green"
    },
    {
      "title": "Green Lion 9H Steve Privacy Screen Protector for iPhone 15 Pro",
      "price": "₵140.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/11/Green-Lion-9H-Steve-Privacy-Screen-Protector-for-iPhone-15-P-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-9h-steve-privacy-screen-protector-for-iphone-15-p/",
      "description": "To preserve perfect touch sensitivity, the Green Lion 9H Steve Privacy Anti-Peeping Glass offers a bubble-free fit and crystal-clear clarity. While its grease- and fingerprint-resistant surface keeps your screen spotless, the real wonder is its restricted side viewing, which ensures privacy from nosy neighbors. All the while keeping superior scratch resistance. Integrally protect, shine, and guarantee your privacy. ​Features Bubble Free Blocked Side Viewing Highly Responsive Crystal Clear Anti Fingerprint Grease Resistance Anti Scratch SKU: GN9HSPY15PMBK | GN9HSPY15PBK | GN9HSPY15PSBK | GN9HSPY15BK  EAN: 6935100177427 | 6935100177410 | 6935100177403 | 6935100177397"
    },
    {
      "title": "Green Lion Liquid Silicone Case for iPhone 15 Pro Max",
      "price": "₵130.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/Green-Lion-Liquid-Silicone-Case-for-iPhone-15-Pro-15-Pro-Max-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-liquid-silicone-case-for-iphone-15-pro-15-pro-max/",
      "description": "The Green Lion Liquid Silicone Case is the ideal pair of strength and style for your iPhone 15 Pro & iPhone 15 Pro Max. This case’s carefully designed drop protection feature guarantees that your gadget will survive daily unexpected accidents. It is not only durable but also offers an anti-scratch coating and an anti-slip grip to hold your phone securely in your hand. Select the color that best suits your style from a colorful pallet of Black to Titanium, all with color-safe technology."
    },
    {
      "title": "Apple iPhone 12 Mini Blueo High Definition 2.5D",
      "price": "₵120.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/IPH12MINI-BLUEO-HD-2.5-300x275.jpg",
      "url": "https://telefonika.com/product/iph12mini-blueo-hd-2-5/",
      "description": "This Blueo 9-hour tempered glass film is a high-quality product, provides a high-resolution, scratch-resistant and tactilely smooth surface. Due to its oleophobic layer treated at a high temperature, fingerprints are not visible and it also repels moisture. Full screen protection, full coverage, full transparency."
    },
    {
      "title": "iPhone 13 6.1″ Green Fibra de Carbon Case – Blue",
      "price": "₵90.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/iPhone-13-6.1-Green-Fibra-de-Carbon-Case-Blue-300x275.jpg",
      "url": "https://telefonika.com/product/iphone-13-6-1-green-fibra-de-carbon-case-blue/",
      "description": "This Carbon Fiber Case gives you a classic and elegant appeal to your handheld device Compatible with iPhone 13.  This high-quality cell phone case is directly inspired by Ferrari interior/exterior. Ferrari Case with the ultimate luxury experience and FULL PROTECTION from scratches and abrasions.  This cell phone case contains FULL PROTECTION from scratches to keep your mobile phone protected at all times and helps protect device against impact.  Precise cutouts allow COMPLETE & EASY ACCESS for all Ports, Cameras, Buttons, and Speakers. Case compatible with wireless chargers.  This officially licensed product of Ferrari includes CG Mobile’s 1-year case limited warranty."
    },
    {
      "title": "Green Lion Cyrstal Clear Case for iPhone 15 Series",
      "price": "₵90.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Lion-Cyrstal-Clear-Case-for-iPhone-15-Pro-Clear-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-cyrstal-clear-case-for-iphone-15-series/",
      "description": "Description   Introducing the Green Lion Crystal Clear Case, a phone case with a stylish look and superior protection. It maintains the cleanliness and hygiene of your gadget with anti-microbial qualities. It offers drop and impact protection that meets military standards. While providing simple access to all features, the exact cutouts in the crystal-clear material also highlight the inherent beauty of your phone. This case is resistant to both yellowing and scratches, so say goodbye to both. The Green Lion Crystal Clear Case offers the ideal fusion of design and usability. ​Features Anti-Microbial Protection  Military-level Protection  Military-level Protection  Anti-Microbial Protection"
    },
    {
      "title": "Samsung A04 Silicone Case – Blue",
      "price": "₵80.00",
      "image": "https://telefonika.com/wp-content/uploads/2023/05/Samsung-A04-silicone-case-Blue-300x275.jpg",
      "url": "https://telefonika.com/product/samsung-a04-silicone-case-blue/",
      "description": "1. Silicone material, non-toxic and odorless, has excellent wear resistance, is not easy to age, and has bright colors. It has better protection and functionality than ordinary plastics. 2. Design to fit your phone. 3. Simple, comfortable and easy to carry. 4. It can fully protect the equipment from normal scratches, dirt, tearing and abrasion. 5. All buttons and ports are easy to access."
    },
    {
      "title": "Green Hybrid Plus HD Case for iPhone 13 Pro ( 6.1″ ) – Blue",
      "price": "₵70.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Hybrid-Plus-HD-Case-for-iPhone-13-Pro-6.1-Blue-300x275.jpg",
      "url": "https://telefonika.com/product/green-hybrid-plus-hd-case-for-iphone-13-pro-6-1-blue/",
      "description": "The Green Lion Green Hybrid Plus HD Case for iPhone 13 Pro (6.1″) in blue is designed to provide your phone with perfect protection and a unique and elegant look. Features: Equipped with openings that allow you to access all ports and buttons The 3mm thick cover protects against scratches and shocks Made of TPU, easy to install and remove Equipped with a raised edge around the phone screen and camera lens to provide additional protection against breakage"
    },
    {
      "title": "Green Hybrid Plus HD Case for iPhone 13 Pro ( 6.1″ ) – White",
      "price": "₵70.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/08/Green-Hybrid-Plus-HD-Case-for-iPhone-13-Pro-6.1-White-300x275.jpg",
      "url": "https://telefonika.com/product/green-hybrid-plus-hd-case-for-iphone-13-pro-6-1-white/",
      "description": "Creative design: Colorful design, youth and fashion. Material :TPU+PC hybrid Separable Design TPU Edge Perfect Screen Protection Soft Interior Material Pit Back Cover Design 3m super anti-falling Full Protection Design Precise openings for all buttons & ports. Flexible & colorful, easy take on and off. Environmental protection. Material, Anti-scratch , shock resistance & durable."
    }
  ]
}