{
  "category": "SPEAKERS",
  "totalProducts": 72,
  "scrapedAt": "2025-02-07T08:39:44.709Z",
  "products": [
    {
      "title": "Sony HT-A9/M1 AF1 Home Theater System",
      "price": "₵35,000.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/SONY-HT-A9M1-AF1-300x275.jpg",
      "url": "https://telefonika.com/product/sony-ht-a9-m1-af1-home-theater-system/",
      "description": "360 Spatial Sound Mapping for a whole new surround experience.Waterproof : No Flexible layout with wireless connectivity Hi-Res Audio capable"
    },
    {
      "title": "JBL PartyBox Ultimate",
      "price": "₵26,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-PartyBox-Ultimate-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-partybox-ultimate/",
      "description": "The JBL PartyBox Ultimate fills as much space as you’ve got with superior Original JBL Pro Sound, boosted with an"
    },
    {
      "title": "Sony SRS-ULT1000 Bluetooth Speaker – Black",
      "price": "₵24,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/07/Sony-SRS-ULT1000-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-ult1000-bluetooth-speaker-black/",
      "description": "Turn your home into party central with massive bass, 360° Party Sound, 360° Party Light and karaoke, thanks to a"
    },
    {
      "title": "JBL Bar 1300 Black",
      "price": "₵23,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/05/JBL-Bar-1300-Black-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-bar-1300-black/",
      "description": "True Dolby Atmos®, DTS:X, and MultiBeam™ Surround Sound Immerse yourself in theater-quality 3D sound. With four up-firing drivers in the"
    },
    {
      "title": "JBL Bar 51 Channel Soundbar",
      "price": "₵15,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Bar-51-Channel-Soundbar-Speakers-medium.jpg",
      "url": "https://telefonika.com/product/jbl-bar-51-channel-soundbar-speakers/",
      "description": "JBL 5.1 surround sound with 510W of power Detachable, battery-powered wireless surround speakers Thrilling bass from a 10 Inch (250mm)"
    },
    {
      "title": "Sony Home Theater Systems, Black, SHAKE-X10D",
      "price": "₵15,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/WhatsApp-Image-2022-09-22-at-1.49.27-PM-medium.jpeg",
      "url": "https://telefonika.com/product/sony-home-theater-systems-black-shake-x10d/",
      "description": "The Sony Home Theater System is a high quality audio system that provides an immersive audio experience. the system adds"
    },
    {
      "title": "Sony SRS-XV900 X-Series Wireless Portable",
      "price": "₵15,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-SRS-XV900-X-Series-Wireless-Portable-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xv900-x-series-wireless-portable/",
      "description": "Power your party with omnidirectional sound Light up the night with omnidirectional party lighting Up to 25 hours of playing"
    },
    {
      "title": "JBL Bar 800 Pro 5.1.2 SoundBar with Wireless SubWoofer",
      "price": "₵14,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/10/JBL-Bar-800-Pro-5.1.2-SoundBar-with-Wireless-SubWoofer-medium.jpg",
      "url": "https://telefonika.com/product/jbl-bar-800-pro-5-1-2-soundbar-with-wireless-subwoofer/",
      "description": "With true 3D surround sound, 720 watts of power output and a punchy 10-inch subwoofer, your movie nights are sure"
    },
    {
      "title": "JBL PartyBox 710 – Party Speaker",
      "price": "₵14,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-PartyBox-710-Party-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-partybox-710-party-speaker/",
      "description": "POWERFUL JBL ORIGINAL PRO SOUND: Create an instant musical connection with 800 powerful watts of high-performance JBL Original Pro Sound."
    },
    {
      "title": "Sony SRS-XV800 X-Series Portable  Speaker",
      "price": "₵13,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/11/Sony-SRS-XV800-X-Series-Portable-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xv800-x-series-portable-speaker/",
      "description": "Power your party with omnidirectional sound Illuminate the night with colorful ambient lighting Up to 25 hours of playing time,"
    },
    {
      "title": "JBL Authentics 500 Portable Bluetooth Speaker with WiFi – Black",
      "price": "₵11,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/02/JBL-Authentics-500-Wireless-Home-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-authentics-500-portable-bluetooth-speaker-with-wifi-black/",
      "description": "Superb sound and performance with Dolby Atmos Music: 270 watts of 3.1 channel sound, with virtual Dolby Atmos create a"
    },
    {
      "title": "Sony HT-S2000/C 5.1ch Dolby Compact Soundbar Home Theatre System",
      "price": "₵11,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/Sony-HT-S2000-5.1ch-Dolby-Atmos-Compact-Soundbar-Home-Theatre-System-300x275.jpg",
      "url": "https://telefonika.com/product/sony-ht-s2000-5-1ch-dolby-atmos-compact-soundbar-home-theatre-system/",
      "description": "Dolby Atmos: Feel the Action and immersive surround with Dolby Atmos/DTSX Built in Subwoofer: Enjoy thrilling sound with dedicated centre"
    },
    {
      "title": "JBL Authentics 500 Portable Bluetooth Speaker with WiFi – Black",
      "price": "₵11,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/02/JBL-Authentics-500-Wireless-Home-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-authentics-500-portable-bluetooth-speaker-with-wifi-black/",
      "description": "Superb sound and performance with Dolby Atmos Music: 270 watts of 3.1 channel sound, with virtual Dolby Atmos create a lifelike musical experience that makes you feel like you’re hearing your music live—right from the front row. Three 2.5mm tweeters and three 2.75″ midrange woofers provide so much clarity that every detail of your favorite song sounds brand new, while a 6.5″ down firing subwoofer and the patented SlipStream bass port extend the low end to a new level of bass that you can feel. Dolby Atmos Music content is available from compatible streaming services in the JBL One app."
    },
    {
      "title": "Sony HT-S40R/ZAF1 Home Theatre System",
      "price": "₵10,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-HT-S40R-ZAF1-Home-Theatre-System1-300x275.jpg",
      "url": "https://telefonika.com/product/sony-ht-s40r-zaf1-home-theatre-system/",
      "description": "For an exceptional audio experience, a combination of soundbar, subwoofer and wireless rear speakers deliver a dynamic surround sound that fills your room.   Immerse yourself in powerful surround sound With 600W output and Dolby Digital® you’ll get powerful sound that puts you at the heart of the action. A wireless design With a wireless amplifier to power the rear speakers, there are no wires between the front and the rear of your room to get in the way. The subwoofer and soundbar also share a single power connection, so the system can deliver cinema sound without clutter or complexity."
    },
    {
      "title": "JBL Boombox 3 WiFi Wireless Bluetooth Streaming Portable Speaker",
      "price": "₵10,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Boombox-3-WiFi-Wireless-Bluetooth-Streaming-Portable-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-boombox-3-wifi-wireless-bluetooth-streaming-portable-speaker/",
      "description": "Wi-Fi connectivity for high resolution streaming Stream high-resolution sound over Wi-Fi with detailed and dynamic range. Taking a call or scrolling your feed? Go ahead – it won’t interrupt your music. When outside of network range, switch easily to Bluetooth for a seamless audio experience that you can take anywhere. This is the best of both worlds, whether you’re indoors or Outdoor outside.Patio,Pool party,Birthday Event,Beach party Fully Power House Speaker,Home,Office,Work,Travel. Massive JBL Original Pro Sound with Dolby Atmos Fill the air with massive JBL Original Pro sound with deep, powerful bass. The JBL Boombox 3 Wi-Fi makes it feel like"
    },
    {
      "title": "LG XBOOM XL7S Party Speaker with Bluetooth",
      "price": "₵10,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/06/LG-Xboom-XL7S-Party-Speaker-with-Bluetooth-300x275.jpg",
      "url": "https://telefonika.com/product/lg-xboom-xl7s-party-speaker-with-bluetooth/",
      "description": "LG XL7S is placed on the stage with red-orange gradient lighting is on. Behind the stage, people enjoy the music. Sounds Bold – Play out Loud Kick the party up a notch with LG XBOOM XL7S. It sounds extra large and also has various entertainment. LG XL7S is placed on the infinite space. On the wall, square sound graphics are illustrated. In the middel of the speaker an 8-inch giant woofer is enlarged in order to emphazie its 250W huge sound. Sound waves comes out from the woofer. One Giant Woofer The One that Delivers Strong Bass LG XBOOM XL7S has an"
    },
    {
      "title": "Apple Homepod 2",
      "price": "₵10,500.00",
      "image": "https://telefonika.com/wp-content/uploads/2023/06/Apple-MQJ73-Homepod-2-Midnight-300x275.jpg",
      "url": "https://telefonika.com/product/apple-homepod-2/",
      "description": "THE NEW APPLE HOMEPOD The all-new HomePod delivers groundbreaking, premium sound, from clear, detailed highs to deep, rich bass. Advanced computational audio pushes acoustics further. Spatial Audio provides even more immersive sound. Works seamlessly with all your Apple devices. Connect and control your smart home, privately and securely. AMP UP EVERYTHING YOU HEAR HomePod is a powerhouse of a speaker. Apple-engineered audio technology and advanced software deliver high-fidelity sound throughout the room. It intelligently adapts to whatever it’s playing – or wherever it’s playing – and surrounds you in immersive audio that makes everything you listen to sound incredible. ROOM-FILLING"
    },
    {
      "title": "Sony SRS-ULT70 Wireless Speaker",
      "price": "₵9,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/10/Sony-SRS-ULT70-Wireless-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-ult70-wireless-speaker/",
      "description": "Powerful sound pressure and rich bass experience Powerful sound pressure and bass enhancement thanks to the “ULT button” which provides powerful bass overflowing. Experience the beats and immersive feel of your body with the ULT FIELD 7. Powerful and clear sound. Dedicated Speaker Unit With the “X-Balanced Speaker Unit” this rectangular woofer is approximately 114mm x 114mm which provides powerful sound pressure and a rich low range. Wide band tweeter diameter of about 46 mm offers a wide range of coverage to medium and high and clear vocals. In addition, the new sound field optimization technology detects ambient noise and"
    },
    {
      "title": "JBL Authentics 300 Portable Bluetooth Speaker with WiFi",
      "price": "₵8,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Authentics-300-Portable-Bluetooth-Speaker-with-WiFi-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-authentics-300-portable-bluetooth-speaker-with-wifi/",
      "description": "Superb sound and performance: Fill any room in your house with stereo sound. A pair of 25mm tweeters bring out the details in your music, while the full-range 5.25-inch woofer and down-firing 6.5-inch passive radiator deliver deep bass. These top-grade components ensure you’ll get the perfect audio balance, no matter what kind of music you’re listening to. Inspired by retro design: The JBL Authentics 300 delivers iconic style inspired by classic JBL retro designs, in a portable home speaker that looks great in any decor. It will easily fill any space, big or small, with superior JBL sound. And the"
    },
    {
      "title": "JBL PartyBox Club 120",
      "price": "₵7,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/05/JBL-PartyBox-Club-120-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-partybox-club-120/",
      "description": "Pure party energy The JBL PartyBox Club 120 turns any space to party, and vibe. Powerful JBL Pro Sound fills the air while an entrancing lightshow of starry lights, cool light trails, and strobe effects syncs to your beat. Instantly pair any Bluetooth device and stream your favorite party playlist, or use the mic and guitar inputs to share your own sound. Either way, you can steer the party’s flow with fun interactive party effects using the JBL PartyBox app. A folding ergonomic handle makes the PartyBox Club 120 easy to take with you anywhere, and the splash-proof construction means"
    },
    {
      "title": "Sony SRS-XP700 X-Series Wireless Portable Speaker",
      "price": "₵7,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/11/Sony-SRS-XP700-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xp700-x-series-wireless-portable-speaker/",
      "description": "Omnidirectional Party Sound with integrated rear tweeter Up to 25 hours of battery life with quick charging X-Balanced Speaker for powerful bass IPX4 Splash-resistant design New concept LED indirect illumination lighting Unleash your inner pop star with 2 mic/guitar rear inputs Integrated carry handle for easy portability Connect and stream music easily with Bluetooth Charge your device and play your tracks via USB port Place the speaker upright or on its side"
    },
    {
      "title": "JBL Boombox 3 – Portable Bluetooth Speaker",
      "price": "₵7,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Boombox-3-Portable-Bluetooth-Speaker-medium.jpg",
      "url": "https://telefonika.com/product/jbl-boombox-3-portable-bluetooth-speaker/",
      "description": "Massive sound and deepest bass: Enjoy your music with massive JBL Original Pro Sound. The new 3-way speakers deliver higher sensitivity of our acoustic design sharpens clarity while lowering distortion for monstrous bass and a rich audio spectrum—no matter how high you turn up the volume. 24 Hours of play time: Celebrate every moment with the sounds you love. From your early morning workout to a late-night hang with friends, we’ve added 24 hours of battery life to keep you in your element all day. IP67 dust and water proof: To the pool. To the park. The JBL Boombox 3"
    },
    {
      "title": "LG XBOOM XL5S Party Speaker with Bluetooth",
      "price": "₵7,710.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/LG-XBOOM-XL5S-Party-Speaker-with-Bluetooth-300x275.jpg",
      "url": "https://telefonika.com/product/lg-xboom-xl5s-party-speaker-with-bluetooth/",
      "description": "Bigger the Sound,  Bigger the Party Make the party bigger with an even bigger sound. LG XBOOM XL5S produces a powerful party sound to fill the venue. One Giant Woofer The One that Delivers Strong Bass Take your party to the next level and feel the deep bass with LG XBOOM XL5S. It has a 6.5 (16.51 cms) Giant Woofer to produce more powerful bass for the venue. *The sound may vary depending on the sound source. Dynamic Bass Optimizer Feel that Bass Even at Low Volume Hear the boomy bass any time. The Dynamic Bass Optimizer allows you to"
    },
    {
      "title": "Sony SRS-XG500 Wireless Portable Speaker",
      "price": "₵7,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/SONY-SONY-SRS-XG500-SPEAKER-medium.jpg",
      "url": "https://telefonika.com/product/sony-srs-xg500-wireless-portable-speaker/",
      "description": "Big sound with two woofers, two tweeters, and X-Balanced Speakers for powerful bass and crisp sound IP66 water resistant and dustproof design Up to 30-hour battery life with quick charging Lightweight design with carry handle for easy portability. Speaker measures approximately 18.11” x 10.07” x 8.46” and weighs 12.32 pounds. Unleash your inner pop star with mic/guitar rear input Connect and stream music easily with Bluetooth Subtle LED ring lighting for ambiance Charge your device and play your tracks via the USB port Fiestable App enhances the party. Personalize the sound using the Music Center App. Add to the fun"
    },
    {
      "title": "Sony SRS-XV500 Portable Bluetooth Speaker",
      "price": "₵6,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-SRS-XV500-Portable-Bluetooth-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xv500-portable-bluetooth-speaker/",
      "description": "POWERFUL PARTY SOUND: Woofers and front tweeters deliver a deep, punchy bass and clear vocals. With even more sound pressure, you won’t be able to resist the urge to dance. PLUG & PLAY KARAOKE: Entertain your audience with inputs for karaoke and guitar. Two inputs so you can karaoke with a friend. ILLUMINATED TOUCH CONTROL PANEL: Take control of your modes, settings, and lighting with the easy-to-use touch panel. X-BALANCED SPEAKERS: X-Balanced speakers provide power, clarity, and distortion-free sound. LONG BATTERY LIFE WITH QUICK CHARGING: With up to 25-hour battery life, the XV500 will keep the party powered all night."
    },
    {
      "title": "JBL Bar 21DBM2 (2.1 – 300W – Subwoofer)",
      "price": "₵6,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Bar-21DBM2-2.1-300W-Subwoofer-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-bar-21dbm2-2-1-300w-subwoofer/",
      "description": "Exciting slum depths The JBL Bar 2.1 Deep Bass soundbar turns your living room into a cinema or a JBL Bar 2.1 Deep Bass stadium is compact, but offers 300 Watts of the distinctive and incredible JBL sound. Connect it to the TV with just one optical or HDMI cable or stream music from the phone thanks to the built-in Bluetooth. The Dolby Digital decoding and JBL Surround Sound bring home a real cinematic experience, making everything you watch or hear, more epic, more exciting and more powerful. Unleash the power Fill the entire sound room. An impressive total power"
    },
    {
      "title": "Sony SA-RS3S/M Wireless Dual Rear Speakers",
      "price": "₵6,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/09/SONY-SA-RS3SM-Black-300x275.jpg",
      "url": "https://telefonika.com/product/sony-sa-rs3s-m-wireless-dual-rear-speakers/",
      "description": "Make your compatible* Sony soundbar truly surround sound, with the Sony SA-RS3S wireless speakers. From immersed to fully immersed Impressive as the Sony HT-A7000 soundbar is, it’s only when you add these wireless speakers that it truly lives up to its potential. Having speakers behind you makes movies sound just like they do at the cinema – with effects whizzing around the room. Two-way design for detail Rather than using a single speaker per cabinet, the SA-RS3S surround speakers feature a more sophisticated two-way design. Just like a Hi-Fi speaker, the two-way design has a tweeter for top-end notes and"
    },
    {
      "title": "Sony SRS-XP500 X-Series Wireless Speaker",
      "price": "₵6,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/11/Sony-SRS-XP500-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xp500-x-series-wireless-speaker/",
      "description": "Powerful Party Sound with MEGA BASS Up to 20 hours of battery life with quick charging X-Balanced Speaker for powerful bass IPX4 splash resistant design New concept LED indirect illumination lighting Unleash your inner pop star with 2 mic/guitar rear inputs Integrated carry handle for easy portability Connect and stream music easily with Bluetooth Charge your device and play your tracks via USB port Place the speaker upright or on its side"
    },
    {
      "title": "Harman Kardon Citation Surround Wireless",
      "price": "₵6,500.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Harman-Kardon-Citation-Surround-Wireless-300x300.jpg",
      "url": "https://telefonika.com/product/harman-kardon-citation-surround-wireless/",
      "description": "Get the full home theater surround sound experience, without all the cables. Setup a 5.1 system for the ultimate movie, sport and gaming experience by adding a Citation Bar, and Citation Sub and/or Citation Tower. Together with the Citation Bar or Citation Bar and Towers, the Citation Surround delivers an impressive, multi-channel home theater surround sound experience. With automatic software updates for new features and services, your music and voice options will always be up to date and at its best. No need to run audio cables to the Citation Surround, it connects wirelessly making setup a breeze. For over"
    },
    {
      "title": "JBL Xtreme 4 Portable Bluetooth Speaker",
      "price": "₵6,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-XTREME-4-PORTABLE-WIRELESS-SPEAKER-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-xtreme-4-portable-bluetooth-speaker/",
      "description": "Live loud: Take your listening experience to the next level with the JBL Xtreme 4 Bluetooth speaker, featuring amazing sound and easy portability courtesy of the convenient shoulder strap JBL Pro Sound: Dual pumping JBL Bass Radiators and two woofers and drivers provides clear sound with deep bass and plenty of detail, delivering truly unique audio immersion Ultimate protection: Thanks to its waterproof and dustproof rating, this powerful speaker handles almost any environment – from beach picnics to pool parties Keep the good times going: The built-in power bank charges your devices while playing; with up to 24 hours of"
    },
    {
      "title": "JBL Partybox Encore Portable Speaker with Mic",
      "price": "₵6,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-PartyBox-Encore-with-Mic-medium.jpg",
      "url": "https://telefonika.com/product/jbl-partybox-encore-portable-speaker-with-mic/",
      "description": "Be the star of your next party The portable JBL PartyBox Encore speaker gives you 10 hours of non-stop fun. With the easy grab-and-go handle and splash proof design, you can always take the party with you. Get the beat pumping with amazing JBL Original Pro Sound and deep bass. Sync the lightshow’s rockin’ strobes, ring and club lights for an awesomely immersive experience or sing along with the JBL premium digital wireless mic, optimized for karaoke with adjustable echo, bass, and treble. True Wireless Stereo means you can even pair speakers for truly massive sound. And with the PartyBox"
    },
    {
      "title": "Sony MHC-V13 High Power Audio System with Bluetooth",
      "price": "₵6,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/Sony-MHC-V13-High-Power-Audio-System-with-Bluetooth-medium.jpg",
      "url": "https://telefonika.com/product/sony-mhc-v13-high-power-audio-system-with-bluetooth/",
      "description": "JET BASS BOOSTER for High-Power Audio Spread sound with high-efficiency Tweeters Sing along with your favorite tunes with a Built-in Mic Input Enhance your experience with speaker light illumination Everyone can be DJ with Party Playlist and Karaoke Ranking, via Fiestable app Take the party anywhere with built-in carry handles Enjoy more powerful sound with Wireless Party Chain"
    },
    {
      "title": "JBL PartyBox 110",
      "price": "₵5,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/JBL-PartyBox-110-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-partybox-110/",
      "description": "POWERFUL JBL ORIGINAL PRO SOUND: Whether you’re at home or outdoors, the JBL PartyBox 110 makes your music amazing with two levels of deep, adjustable bass and 160W powerful JBL Signature Sound. 12 HOURS OF PLAYTIME AND PORTABLE DESIGN: Power the party all day or all night. With 12 hours of playtime and a built-in rechargeable battery, the beat will go on (and on)! IPX4 SPLASHPROOF: Whether your guests are dancing on the beach or sipping drinks by the pool, the JBL PartyBox 110 is IPX4 splashproof so you never have to worry about the party getting too wet and"
    },
    {
      "title": "Sony SRS-XG300 X-Series Wireless Portable-Bluetooth Party-Speaker",
      "price": "₵5,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/SONY-SRS-XG300-300x300.jpg",
      "url": "https://telefonika.com/product/sony-srs-xg300-x-series-wireless-portable-bluetooth-party-speaker/",
      "description": "Super-light, portable design includes a retractable handle IP67 rated for water and dust proof X-Balanced speakers provide power, clarity, and distortion-free sound Up to 25 hours of playing time, plus quick charging Personalized sound control via the Sony | Music Center app Customizable ambient LED lighting Charge your device via the USB port Stream wirelessly via BLUETOOTH or via wired 3.5 mm jack Microphone w/ echo cancelling technology The Fiestable app enhances the mood with cool effects"
    },
    {
      "title": "LG XBOOM ON 5",
      "price": "₵5,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/LG-XBOOM-ON-5-300x275.jpg",
      "url": "https://telefonika.com/product/lg-xboom-on-5/",
      "description": "LG XBOOM ON5 The All-In-One for Bold Party Sound A Super Bass Boost, and other fun features deliver big, powerful beats that take the party atmosphere up a notch. LG XBOOM ON5 The All-In-One for Bold Party Sound A Super Bass Boost, and other fun features deliver big, powerful beats that take the party atmosphere up a notch. Super Bass Boost Powerful Sound the Party Will Feel LG XBOOM ON5 generates extra airflow behind the speaker unit to produce thumping bass that sparks any party into life. Watch the Full Movie Multi Color Lighting Light Up the Dance Floor Colorful"
    },
    {
      "title": "JBL Soundbar 550 Home Cinema 3.1 with Wireless Subwoofer",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/11/JBL-SoundBar-550-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-soundbar-550-home-cinema-3-1-with-wireless-subwoofer/",
      "description": "Epic sound in home cinema: the compact soundbar with integrated subwoofer delivers 250 W of powerful Dolby audio and impresses with extra deep bass and its compact, high-quality design Crystal clear dialogue: Thanks to the centre channel driver of the soundbar, the dialogues are impressively clear at the next movie night and take the viewing experience to a new level Easy connection: The sound system can be easily connected via HDMI ARC with just one cable or via optical ports – for setup in seconds Wireless streaming: the Bluetooth connectivity of the soundbar allows wireless streaming of podcasts or music"
    },
    {
      "title": "JBL Soundbar 550 Home Cinema 3.1 with Wireless Subwoofer",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/11/JBL-SoundBar-550-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-soundbar-550-home-cinema-3-1-with-wireless-subwoofer/",
      "description": "Epic sound in home cinema: the compact soundbar with integrated subwoofer delivers 250 W of powerful Dolby audio and impresses with extra deep bass and its compact, high-quality design Crystal clear dialogue: Thanks to the centre channel driver of the soundbar, the dialogues are impressively clear at the next movie night and take the viewing experience to a new level Easy connection: The sound system can be easily connected via HDMI ARC with just one cable or via optical ports – for setup in seconds Wireless streaming: the Bluetooth connectivity of the soundbar allows wireless streaming of podcasts or music"
    },
    {
      "title": "JBL Pulse 5 – Portable Bluetooth Speaker",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Pulse-5-Portable-Bluetooth-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-pulse-5-portable-bluetooth-speaker/",
      "description": "Eye-catching 360-degree light show: Brighten your nights with 360 degrees of eye-catching colors synced to the beat of your favorite songs. Or match your mood by customizing the bigger, bolder lightshow on the Pulse 5’s expanded transparent outer body using the JBL Portable app. Bold sound and deep bass in all directions: You’ll enjoy pure, bold JBL Original Pro Sound in all directions with its separate tweeter and upfiring driver, while the passive radiator on the bottom of the speaker delivers deep bass—so you can truly feel the music. IP67 dustproof and waterproof: To the pool. To the park. JBL"
    },
    {
      "title": "JBL Xtreme 3 – Portable Bluetooth Speaker",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Xtreme-3-Portable-Bluetooth-Speaker-medium.jpg",
      "url": "https://telefonika.com/product/jbl-xtreme-3-portable-bluetooth-speaker/",
      "description": "POWERFUL JBL ORIGINAL PRO SOUND: Four drivers and two JBL Bass Radiators effortlessly deliver dynamic, immersive sound with deep bass and plenty of detail. You’ll get lost in the music wherever you are. PORTABLE DESIGN: The included carrying strap with built-in bottle opener makes it easy to bring your speaker wherever you go. 15 HOURS OF PLAYTIME: The fun doesn’t have to stop. Packed with an incredible 15 hours of battery life, JBL Xtreme 3 lets you party all day and into the night. WIRELESS BLUETOOTH STREAMING: Wirelessly stream music from your phone, tablet, or any other Bluetooth-enabled device. P67"
    },
    {
      "title": "Monster Cycle Plus Bluetooth Speaker",
      "price": "₵4,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/MONSTER-CYCLE-PLUS-300x275.jpg",
      "url": "https://telefonika.com/product/monster-cycle-plus-bluetooth-speaker/",
      "description": "【Maximized Power Output For Ultimate Performance】Monster Cycle Plus speakers offer 320W peak power, 2*6.5″ Subwoofers, and 2*2″ tweeters, and are expertly tuned for rich bass, clear mids, and highs without distortion, making them crowd-pleasing. 【Premium Sound & Dynamic Lighting Modes】The Monster Cycle Plus speaker boasts top-tier audio quality with advanced bass tech, offering 3 EQ modes and a ≤75dB SNR for an audio experience that energizes any gathering. Its vibrant rhythm lights enhance the atmosphere, making your parties shine even brighter. 【Ultra-Long Transmission Distance】The wireless speakers are equipped with advanced Bluetooth 5.3. Connect the outdoor speakers to the phone freely"
    },
    {
      "title": "JBL Partybox Encore Essential",
      "price": "₵4,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/jbl-1-medium.jpg",
      "url": "https://telefonika.com/product/jbl-partybox-encore-essential/",
      "description": "Nothing beats amazing JBL Original Pro Sound with deep bass. The dynamic light show delivers with fun ring light and a cool strobe effect that syncs to the beat of your music. No plug? No problem. The JBL PartyBox Encore Essential keeps the party going wherever you are with up to 6 hours of play time. Dancing on the beach? Party by the pool? The JBL PartyBox Encore Essential is IPX4 splash proof so you never have to worry about the party getting too wet or wild. One JBL PartyBox not enough? Pair two speakers wirelessly with True Wireless Stereo"
    },
    {
      "title": "JBL Charge 5 Wi-Fi Portable Wireless Speaker",
      "price": "₵4,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Charge-5-Wi-Fi-Portable-Wireless-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-charge-5-wi-fi-portable-wireless-speaker/",
      "description": "Play and charge anywhere Go anywhere, hear anything. The bold JBL Original Pro Sound and deep bass of the JBL Charge 5 Wi-Fi and Bluetooth portable speaker keeps you moving to your own personal beat. Stream music anywhere over Wi-Fi, while continue using your phone. Taking a call or scrolling your feed? Go ahead—it won’t interrupt your music. Switch easily to Bluetooth and keep enjoying seamless audio experiences whether you’re indoors or outside. The waterproof, dustproof portable speaker is powered by 20 hours of battery life whether you’re hanging at the park or dancing by the pool, and comes with"
    },
    {
      "title": "Harman Kardon Onyx Studio 8 Portable Wireless Speaker",
      "price": "₵4,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/05/Harman-Kardon-Onyx-Studio-8-Portable-Wireless-Speaker-medium.jpg",
      "url": "https://telefonika.com/product/harman-kardon-onyx-studio-8-portable-wireless-speaker/",
      "description": "[Superior Sound Performance] – Harman Kardon’s unrivaled acoustic engineering delivers rich, room-filling sound in any setting, whether you’re listening to your favorite music or making crystal clear conference calls. [Elegant Design] – Crafted from premium materials, the Onyx Studio 8 neatly blends into your life and home. The sleek, anodized aluminum handle, which doubles as a sturdy base, means you can easily carry it from one room to another. [Self-Tuning] – Enjoy perfect sounds wherever you take the music. When you power on, the Onyx Studio 8 automatically calibrates to its environment, ensuring the best sound possible no matter where"
    },
    {
      "title": "Belkin SoundForm Elite Hi-Fi Smart Speaker",
      "price": "₵4,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Belkin-SoundForm-Elite-Hi-Fi-Smart-Speaker-medium.jpg",
      "url": "https://telefonika.com/product/belkin-soundform-elite-hi-fi-smart-speaker/",
      "description": "The Belkin Difference: Pioneer in technology and innovation for over 35 years Acoustics by Devialet: Patented technologies from audio pioneers Devialet provide incredible sound quality from a compact device Speaker Active Matching (SAM) technology by Devialet provides absolute fidelity and exceptional performance “Push-Push” dual woofer design by Devialet cancels vibrations while delivering a deep, impactful bass experience Use Alexa to play music and more – just by using your voice Integrated fast wireless charging up to 10-watts for Qi-enabled devices, including iPhone SE, 11, 11 Pro, 11 Pro Max, XS, XS Max, XR, X, 8, 8 Plus, Samsung Galaxy S20,"
    },
    {
      "title": "Bose SoundLink Flex Bluetooth Portable Speaker",
      "price": "₵4,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/10/Bose-SoundLink-Flex-Bluetooth-Portable-Speaker-medium.jpg",
      "url": "https://telefonika.com/product/bose-soundlink-flex-bluetooth-portable-speaker/",
      "description": "State-of-the-art design – SoundLink Flex outdoor speaker is packed with exclusive technologies and a custom-engineered transducer for deep, clear, and immersive audio at home or on the go Clearest possible sound – Proprietary PositionIQtechnology automatically detects the position of your portable Bluetooth speaker for optimal sound quality in any orientation or environment Waterproof wireless speaker for travel – SoundLink Flex is rigorously tested to meet IP67 waterproof speaker standards. Crafted and sealed with waterproof materials, it even floats – ideal for outdoor adventures Portable Bluetooth speaker – Built to resist water, dust, and debris, in a design that withstands drops"
    },
    {
      "title": "Beats Pill — Wireless Bluetooth® Speaker",
      "price": "₵3,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/05/Beats-Pill-Wireless-Bluetooth-Speaker-Champagne-Gold-300x275.jpg",
      "url": "https://telefonika.com/product/beats-pill-wireless-bluetooth-speaker/",
      "description": "Overview Power. Precision. Boom. The upgraded Beats Pill is more advanced than ever.¹ It’s more powerful. It’s lighter. It’s more portable. And it’s designed to sound incredible — inside your home and out and about. Enjoy room-filling sound, bigger bass and better tonality across the audio spectrum. A lot more oomph. The Beats Pill has a bigger, bespoke racetrack woofer that displaces 90% more air volume, packing more of a punch with deeper, fuller bass.¹ Loud and clear. The woofer’s material and structure — including its innovative ridges and contours — helps minimize low-end distortion, even at high volumes.¹ Powered"
    },
    {
      "title": "Porodo Soundtec 640W Party Speaker with Trolley – Black",
      "price": "₵3,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PD-BASHX-BK-Porodo-Soundtec-640W-Party-Speaker-with-Trolley-Black--300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-640w-party-speaker-with-trolley-black/",
      "description": "Description The Soundtec BASH X Party Speaker by Pordoo is the perfect speaker for your next party. With its powerful 640W output and crushing bass, it will fill any space with amazing sound. The IPX4 water resistance ensures that your party can continue even if it starts to rain, and the rhythmic flashing lights will set the mood for a night of dancing and fun. The device also has a microphone port, so you can host karaoke nights or give speeches with ease. It can also be used as a phone charger or FM radio tuner, making it a versatile"
    },
    {
      "title": "Monster Cycle Bluetooth Party Speaker",
      "price": "₵3,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/MONSTER-CYCLE-300x275.jpg",
      "url": "https://telefonika.com/product/monster-cycle-bluetooth-party-speaker/",
      "description": "The Monster Cycle Bluetooth Party Speaker is designed to elevate your party experience with its powerful audio performance and vibrant features. This 80W speaker delivers exceptional sound through dual 5” and 2” drivers, providing robust bass and clear audio for any event. Equipped with Bluetooth 5.1, AUX, TF card, U Disk, and microphone/guitar inputs, it offers versatile connectivity options to suit various audio needs. The speaker’s IPX5 waterproof rating ensures resilience against water splashes, making it ideal for both indoor and outdoor use. Featuring RGB color lighting effects, the Monster Cycle adds a dynamic visual element to your music, enhancing"
    },
    {
      "title": "Sony SRS-XE300 X-Series Wireless Portable-Bluetooth-Speaker",
      "price": "₵3,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-SRS-XE300-X-Series-Wireless-Portable-Bluetooth-Speaker-300x300.jpg",
      "url": "https://telefonika.com/product/sony-srs-xe300-x-series-wireless-portable-bluetooth-speaker/",
      "description": "Line shaped diffuser distributes music evenly across a wide sound stage IP67 water, dust, and shockproof design X-Balanced speakers provide power, clarity, and distortion-free sound Up to 24-hour battery life with quick charging Personalized sound control via the Sony | Music Center app Stream wirelessly via BLUETOOTH Microphone w/ echo cancelling technology The Fiestable app enhances the mood with cool effects Add to the fun with up to 100 XE300 speakers via Party Connect App"
    },
    {
      "title": "Sony MHC-V02 High Power Audio System",
      "price": "₵3,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-MHC-V02-High-Power-Audio-System-300x275.jpg",
      "url": "https://telefonika.com/product/sony-mhc-v02-high-power-audio-system/",
      "description": "Long distance bass sound with JET BASS BOOSTER Voice control via Fiestable / Party Light via Fiestable Handle for safe lifting and easy portability Karaoke Input to unlease your inner pop star One touch wireless listening with NFC and Bluetooth Music center app compatibility Compatible with Tripod for easy mounting"
    },
    {
      "title": "Anker Motion X500 Soundcore Wireless BT Speaker B2C – Black",
      "price": "₵3,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/02/Anker-Motion-X500-Soundcore-Wireless-BT-Speaker-B2C-Black-300x275.jpg",
      "url": "https://telefonika.com/product/anker-motion-x500-soundcore-wireless-bt-speaker-b2c-black/",
      "description": "Immersive Spatial Audio: The soundcore algorithm transforms stereo sound into 3-channel spatial audio for an ultra-immersive experience. Certified Wireless Hi-Res Sound: With a 3X more detailed listening experience, it’s like hearing your favorite songs in a new light. 3 Bold and Fresh Colors: Choose from Black Deluxe, Pink Punch, and Glitzy Blue finishes to find a look that matches your style. Take Your Music Anywhere: This portable Bluetooth speaker is lightweight and ultra-compact, making it effortless to take with you on the go. Upward Firing Driver with Ambient Light: The upward-firing driver adds an extra dimension of sound, while the"
    },
    {
      "title": "LG XBOOM ON2D All-In-One Hi-Fi System",
      "price": "₵3,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/LG-XBOOM-ON2D-ALL-IN-ONE-Hi-Fi-System-300x275.jpg",
      "url": "https://telefonika.com/product/lg-xboom-on2d-all-in-one-hi-fi-system/",
      "description": "Keep It in a Convenient Place Put your phone in the groove so you don’t lose it. Connectivity More Ways to Enjoy the Party Plug in to the AUX and sing your favorite song. Or use the CD player and radio to play music. Multi Bluetooth Share Playlists with Friends Use any of three connected devices to seamlessly control a playlist with no interruption to music."
    },
    {
      "title": "JBL CHARGE 5 – Portable Bluetooth Speaker",
      "price": "₵2,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/JBL-CHARGE-5-Portable-Bluetooth-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-charge-5-portable-bluetooth-speaker/",
      "description": "JBL Pro Sound with an optimized long excursion driver, separate tweeter and dual JBL bass radiators Long lasting battery delivers up to 20 hours of playtime Take the Charge with you anywhere due to its IP67 waterproof and dustproof rating PartyBoost feature allows you to pair two JBL PartyBoost-compatible speakers together in stereo or link multiple JBL PartyBoost-compatible speakers for really incredible sound Built-in powerbank lets you charge your devices without taking a break"
    },
    {
      "title": "Logitech P710E Mobile Speakerphone",
      "price": "₵2,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Logitech-P710e-Mobile-Speakerphone-medium.png",
      "url": "https://telefonika.com/product/logitech-p710e-mobile-speakerphone/",
      "description": "Sold as 1 Each. The integrated device stand positions your mobile phone or tablet for shake-free video calls and hands-free access to the mobile screen. Now hear–and be heard–in true wideband audio, so those on both sides of the call can enjoy a life-like communication experience. USB plug-and-play connectivity easily connects to PCs or Macs, or pair up to eight Bluetooth devices. The long battery life of the P710e–up to 15 hours of talk time between charges–outlasts your longest work day."
    },
    {
      "title": "JBL Horizon 2 Bluetooth Clock Radio Speaker",
      "price": "₵2,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Horizon-2-Bluetooth-Clock-Radio-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-horizon-2-bluetooth-clock-radio-speaker/",
      "description": "Powerful JBL Pro Sound Stream all your music via Bluetooth Ambient lighting Two USB ports to charge your devices Easy-to-use rotary control knob"
    },
    {
      "title": "Porodo Soundtec Bash Party Speaker 200W with 5.25″ Woofer 2″ Tweeter and FM – Black",
      "price": "₵2,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PD-BASH-BK-Porodo-Soundtec-Bash-Party-Speaker-200W-with-5.25-Woofer-2-Tweeter-and-FM-Black-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-bash-party-speaker-200w-with-5-25-woofer-2-tweeter-and-fm-black/",
      "description": "Description The Porodo Soundtec Party Speaker 200W is an exceptional speaker suitable for various occasions. Its versatility and robust bass make it a top choice for most parties. The speaker boasts impressive features that enhance the overall experience. Firstly, it is equipped with a 5.25″ woofer and a 2″ tweeter, resulting in clear and well-balanced sound production. Additionally, it offers the convenience of a built-in FM radio, allowing you to tune in to your preferred radio stations. With an IPX7 rating, it is suitable for outdoor use. The speaker also features a built-in microphone port, as well as a USB-A"
    },
    {
      "title": "Sony SRS-XE200 X-Series Wireless Ultra Portable-Bluetooth-Speaker",
      "price": "₵2,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-SRS-XE200-X-Series-Wireless-Ultra-Portable-Bluetooth-Speaker-300x300.jpg",
      "url": "https://telefonika.com/product/sony-srs-xe200-x-series-wireless-ultra-portable-bluetooth-speaker/",
      "description": "Lightweight design with an easy to carry strap for maximum portability IP67 waterproof and dustproof paired with a shockproof design Line shaped diffuser distributes music evenly across a wide sound stage X-Balanced speakers for powerful bass and crisp sound Dual passive radiators reproduce powerful bass notes. Up to 16 hours of playing time, plus quick charging Personalized sound control via the Sony | Music Center app Microphone w/ echo cancelling technology Stream wirelessly via BLUETOOTH The Fiestable app enhances the mood with cool effects"
    },
    {
      "title": "Monster Musicbox Go Party Portable Wireless Bluetooth Speaker",
      "price": "₵2,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/MONSTER-MUSICBOX-GO-300x275.jpg",
      "url": "https://telefonika.com/product/monster-musicbox-go-party-portable-wireless-bluetooth-speaker/",
      "description": "Get ready to take your party to the next level with Musicbox Go! Featuring 2 high-quality microphones and Bluetooth V5.3 technology, you’ll be able to sing and dance along to your favorite tunes with crystal clear sound. With 80W output power, RGB color lighting effects, and water-resistant IPX5 rating, this speaker is perfect for indoor and outdoor use. Let the music flow and the good times roll!"
    },
    {
      "title": "Sony SRSULT10 Extra BASS Portable Bluetooth Speaker",
      "price": "₵1,999.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/SONY-SRSULT10-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srsult10-extra-bass-portable-bluetooth-speaker/",
      "description": "Sony EXTRA BASS Portable Bluetooth Speaker 2024 Black EXTRA BASS, Powerful Sound Bluetooth Wireless Technology | Compact and Easy to Carry | Up to 12 Hours of Battery Life | Party Connect Wireless Pairing | Dustproof, Waterproof, and Rustproof IP67 Rating IN THE BOX: Sony EXTRA BASS Portable Bluetooth Speaker 2024 Black – AC Power Cord"
    },
    {
      "title": "JBL Flip 6 – Portable Bluetooth Speaker",
      "price": "₵1,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Flip-6-Portable-Bluetooth-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-flip-6-portable-bluetooth-speaker/",
      "description": "Eco-friendly packaging JBL is committed to a more sustainable, earth-friendly packaging. The Flip 6 is packaged in a recyclable paper-based box, including the inner tray. The plastic hangtag is over 90% recycled and the exterior is printed with soy ink IP67 waterproof and dustproof To the pool. To the park. JBL Flip 6 is IP67 waterproof and dustproof, so you can bring your speaker anywhere. 13 Hours of Playtime Don’t sweat the small stuff like charging your battery. JBL Flip 6 gives you up to 12 hours of playtime on a single charge. Bold design Bold audio meets bold design."
    },
    {
      "title": "Green Lion Party Life 100 Bluetooth Speaker  – Black",
      "price": "₵1,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GNPARTY100BK-Green-Lion-Party-Life-100-Bluetooth-Speaker-Black-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-party-life-100-bluetooth-speaker-black/",
      "description": "With the Green Lion Party life 100 Bluetooth Speaker, which is offered in trendy black, be ready to rock the party! Thanks to its 40W RMS, this comprehensive party package provides clean music with powerful bass and an included equalizer. The built-in microphone makes it the ideal party buddy for calls or singing sessions. Up to 6 hours of playing is provided with a 4000mAh battery, and a maximum 5-hour charge time ensures that your speaker is always ready for action. By using Bluetooth, AUX mode, or a TF card, you can stream your music and enjoy an audiovisual experience"
    },
    {
      "title": "Anker Soundcore Motion 300 Speaker A3135011 B2C Hi-Res Sound, Anytime, Anywhere – Black",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/06/Anker-Soundcore-Motion-300-Speaker-A3135011-B2C-Hi-Res-Sound-Anytime-Anywhere-Black-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-motion-300-speaker-a3135011-b2c-hi-res-sound-anytime-anywhere-black/",
      "description": "Wireless Hi-Res Sound: Elevate your outdoor audio experience with Wireless Hi-Res sound. You won’t find a better audio experience in a speaker this small. SmartTune Technology: Motion 300 portable speaker’s exclusive adaptive technology automatically adjusts to the direction and orientation of the speaker to deliver the best sound in any scenario. Powerful Sound, Portable Design: With powerful 30W stereo sound in the palm of your hand, you don’t have to sacrifice sound quality when you’re on the go. Ultra-Long Playback Time: With the impressive 13-hour playback time, you can keep the music going all day and night without missing a"
    },
    {
      "title": "Porodo Soundtec Galactic Star Light Portable Speaker 60W – Black",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PD-GALACTIC-BK-Porodo-Soundtec-Galactic-Star-Light-Portable-Speaker-60W-Black-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-galactic-star-light-portable-speaker-60w-black/",
      "description": "Description Porodo Soundtec Galactic Star Light Portable Speaker blends cutting-edge sound technology with an attractive design in a harmonic way. With an IPX4 water-resistant rating, it stands up to splashes and is ideal for adventures in both indoor and outdoor environments. Its Bluetooth V 5.3 technology provides a stable connection up to 10 meters away, and a remarkable 12-hour runtime at 50% volume is also guaranteed. With the strong 60W sound output and deep, powerful bass, this speaker is ready to set the mood for any event. It also has an LED light function. The player’s flexibility is increased with"
    },
    {
      "title": "Amazon Echo Dot (2nd Generation)",
      "price": "₵1,090.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/Amazon-Echo-Dot-2nd-Generation-medium.png",
      "url": "https://telefonika.com/product/amazon-echo-dot-2nd-generation/",
      "description": "Amazon Echo Dot 2nd Generation Overview Make nearly any pair of speakers Bluetooth-enabled with the black 2nd-generation Amazon Echo Dot. It is equipped with Bluetooth connectivity to allow streaming from your mobile device or to a Bluetooth speaker. Its 1/8″ audio output will allow you to connect external speakers so you can wirelessly stream to them through the Echo Dot from your smart device. The Echo Dot provides access to Internet-based functions such as Amazon and other online shopping, weather reports, sports results, and more via built-in Wi-Fi connectivity and voice control. Note: Certain Alexa- and location-based features will have limited functionality"
    },
    {
      "title": "Sony SRS-XB100 Portable Bluetooth Speaker (Black)",
      "price": "₵1,090.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/Sony-SRS-XB100-Portable-Bluetooth-Speaker-Black-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xb100-portable-bluetooth-speaker-black/",
      "description": "Compact body, powerful and clear sound SRS-XB100 Get ready for powerful and clear sound from a compact body. The XB100 speaker is everything you need for life on the move. It’s durable, has plenty of battery and is perfect for listening at home or when out with friends. It’s the perfect all-rounder for however you like to listen. Sony SRS-XB100 Portable Bluetooth Speaker (Black) Small speaker that packs a powerful, clear sound Music is the soundtrack to our lives, and we want you to be able to enjoy your tunes wherever you are. So we’ve packed powerful, clear sound into a"
    },
    {
      "title": "Amazon Echo Dot 5th Gen Speaker",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Amazon-Echo-Dot-5th-Gen-Speaker-300x300.jpg",
      "url": "https://telefonika.com/product/amazon-echo-dot-5th-gen-speaker/",
      "description": "OUR BEST SOUNDING ECHO DOT YET – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room. YOUR FAVORITE MUSIC AND CONTENT – Play music, audiobooks, and podcasts from Amazon Music, Apple Music, Spotify and others or via Bluetooth throughout your home. ALEXA IS HAPPY TO HELP – Ask Alexa for weather updates and to set hands-free timers, get answers to your questions and even hear jokes. Need a few extra minutes in the morning? Just tap your Echo Dot to snooze your alarm. KEEP YOUR"
    },
    {
      "title": "Sony SRS-XB13 Extra BASS Wireless Portable Speaker",
      "price": "₵920.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-SRS-XB13-Extra-BASS-Wireless-Portable-Compact-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/sony-srs-xb13-extra-bass-wireless-portable-speaker/",
      "description": "EXTRA BASS for deep, punchy sound Sound Diffusion Processor expands sound far and wide Waterproof and dustproof (IP67 rated) Up to 16 hours of battery life with indicator Compact portable design with multiway strap included Add an extra speaker for stereo sound Connect and stream music easily with Bluetooth Convenient hands-free calling USB Type-C port"
    },
    {
      "title": "Amazon Echo Pop | Smart speaker with Alexa and Bluetooth",
      "price": "₵790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/AMAXON-ECHO-POP-1ST-GEN-SMART-SPEAKER-WITH-ALEXA-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/amazon-echo-pop-smart-speaker-with-alexa-and-bluetooth/",
      "description": "Smart speaker with loud sound, balanced bass, crisp vocals and Alexa. Stylish design that blends into any decor. Available in 4 exciting colors (Black, White, Green, Purple). Play hands-free music from Amazon Music, Spotify, Jio Saavn, Apple Music. Just ask Alexa (some apps may require subscription). Voice control smart lights, ACs, TVs, geysers. Extend the experience to non-smart appliances using smart plugs (to be purchased separately). Ask Alexa to play nursery rhymes, set alarms, reminders and much more. Use as a standalone speaker or pair your phone to use as a Bluetooth speaker. Built with multiple layers of privacy controls,"
    },
    {
      "title": "Anker Soundcore Glow Mini  A3136011 B2C 360 degree Sound",
      "price": "₵790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Anker-Soundcore-Glow-Mini-A3136011-B2C-360-degree-Sound-And-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-glow-mini-a3136011-b2c-360-degree-sound-and/",
      "description": "360-Degree Dynamic Sound: This portable speaker features an 8W speaker with a single passive radiator to provide 360-degree dynamic sound in a compact package. Full-Body Lighting: The 360-degree light show synchronizes with the music to take any party to the next level. IP67 Protection: Waterproof and dustproof for worry-free listening. Glow Mini portable speaker even floats, so you can chill by the pool with total peace of mind. Long Battery Life: Listen for up to 12 hours on a single charge. Note: Battery life will be reduced when using the light effects. PartyCast 2.0: Simultaneously connect 100+ speakers with synchronized"
    },
    {
      "title": "Logitech S120 Slim Lightweight Stereo Speaker",
      "price": "₵470.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Logitech-S-120-2-Piece-Stereo-Speaker-300x275.jpg",
      "url": "https://telefonika.com/product/logitech-s120-slim-lightweight-stereo-speaker/",
      "description": "Logitech S-120 2-Piece Multimedia Speaker Set General Features: Color: Black Compact speaker system does not take up much space 2-piece speaker standalone system RMS Power: 2.6 Watts RMS Total Peak Power: 5.2 Watts Volume control knob 3.5 mm headphone jack LED indicator 3.5 mm line cable attached (4-foot cable length, approximate) Power cord length: 4.5-foot (approximate)"
    },
    {
      "title": "Green Lion M3 Mini SoundCore Bluetooth Speaker",
      "price": "₵280.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/1653582164-medium.jpg",
      "url": "https://telefonika.com/product/green-lion-m3-mini-soundcore-bluetooth-speaker/",
      "description": "Bluetooth Speaker Green Lion GNMSM3BK Sound core Bluetooth Speaker – Black, Immersive Sound | Pocket & Travel Friendly | Wireless Speaker Up to 4-Hours Playback Time. Highlight Brand Green Lion. Color Black. Item dimensions Lx W x H 15 x 15 x 15 centimeters. Item weight 150 Grams. Optimally constructed, so that you can carry it anywhere with you. Equipped with high-class drivers that deliver exceptional sound output."
    },
    {
      "title": "Green Mini Speaker – Black",
      "price": "₵270.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/1653581483-medium.jpg",
      "url": "https://telefonika.com/product/green-mini-speaker-black/",
      "description": "Battery: 3.7V/150mAh Bluetooth version: V5.0 Product Size: 34x31MM"
    }
  ]
}