{
  "category": "EARBUDS",
  "totalProducts": 70,
  "scrapedAt": "2025-02-07T08:40:38.292Z",
  "products": [
    {
      "title": "Bose Quiet Comfort Ultra Earbuds",
      "price": "₵6,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/03/Bose-Quiet-Comfort-Ultra-Earbuds-Black-300x275.jpg",
      "url": "https://telefonika.com/product/bose-quiet-comfort-ultra-earbuds/",
      "description": "SPATIAL AUDIO EARBUDS: Tap into a deeply immersive listening experience that places the audio directly in front of you and"
    },
    {
      "title": "Bose Quiet Comfort True Wireless Noise Cancelling Earbuds II",
      "price": "₵6,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Bose-Quiet-Comfort-True-Wireless-Noise-Cancelling-Earbuds-II-medium.jpg",
      "url": "https://telefonika.com/product/bose-quiet-comfort-true-wireless-noise-cancelling-earbuds-ii/",
      "description": "Sound shaped to you Bose QuietComfort® Earbuds II are the next generation of wireless listening. Enjoy the best in sound"
    },
    {
      "title": "Beats Fit Pro – True Wireless Noise Cancelling Earbuds",
      "price": "₵6,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/02/Beats-Fit-Pro-–-True-Wireless-Noise-Cancelling-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/beats-fit-pro-true-wireless-noise-cancelling-earbuds/",
      "description": "Flexible, secure-fit wingtips for all-day comfort and stability Custom acoustic platform delivers powerful, balanced sound Spatial Audio with dynamic head"
    },
    {
      "title": "Apple MTJV3 AirPods Pro (2nd generation) with MagSafe Case (USB‑C)",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/MTJV3-Apple-AirPods-Pro-2nd-generation-with-MagSafe-Case-300x275.jpg",
      "url": "https://telefonika.com/product/airpods-pro-2nd-generation-with-magsafe-charging-case-usb%e2%80%91c/",
      "description": "Overview Rebuilt from the sound up AirPods Pro (2nd generation) with MagSafe Charging Case (USB-C) deliver up to 2x more"
    },
    {
      "title": "PlayStation 5 PULSE Explore Wireless Earbuds",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PS5-Wireless-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/playstation-pulse-explore-wireless-earbuds/",
      "description": "Enjoy extraordinary lifelike sound at home and on the go with the PULSE Explore™ wireless earbuds. Discover a new era"
    },
    {
      "title": "Sony WF-1000XM5 – The Best True Wireless Noise-Canceling Earbuds",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WF-1000XM5-The-Best-True-Wireless-Noise-Canceling-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wf-1000xm5-the-best-true-wireless-noise-canceling-earbuds/",
      "description": "About this item Industry-leading Noise Cancellation: The WF-1000XM5 boasts advanced noise-cancellation capabilities, making it perfect for immersive music listening or"
    },
    {
      "title": "HUAWEI FreeClip Wireless Earbuds – Black",
      "price": "₵4,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/03/HUAWEI-FREECLIP-WL-EARBUDS-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/huawei-freeclip-wireless-earbuds-black/",
      "description": "GROUNDBREAKING AESTHETIC DESIGN. A minimalist spherical shape gives the earbuds a stylish look while keeping the weight to minimum, just"
    },
    {
      "title": "Apple AirPods 4 with Active Noise Cancellation",
      "price": "₵4,900.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/Apple-Airpods-4-300x275.jpg",
      "url": "https://telefonika.com/product/apple-airpods-4-with-active-noise-cancellation/",
      "description": "REBUILT FOR COMFORT — AirPods 4 have been redesigned for exceptional all-day comfort and greater stability. With a refined contour,"
    },
    {
      "title": "Bose Sport Earbuds – True Wireless Earphones",
      "price": "₵4,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Bose-Sport-Earbuds1-True-Wireless-Earphones-300x275.jpg",
      "url": "https://telefonika.com/product/bose-sport-earbuds-true-wireless-earphones/",
      "description": "Wireless Bluetooth earbuds engineered by Bose for your best workout yet. Bose lifelike sound — Makes your music sound like"
    },
    {
      "title": "Sony WF-1000XM4 Wireless Earbud Headphones",
      "price": "₵4,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/Sony-WF-1000XM4-Wireless-Earbud-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wf-1000xm4-wireless-earbud-headphones/",
      "description": "Industry-leading noise canceling bluetooth earbuds with the new Integrated Processor V1 Exceptional sound quality with new Integrated Processor V1 and"
    },
    {
      "title": "Razer Hammerhead HyperSpeed Wireless Multi-Platform Gaming Earbuds for Playstation 5",
      "price": "₵4,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Razer-Hammerhead-HyperSpeed-Wireless-Multi-Platform-Gaming-Earbuds-for-Playstation-5-300x275.jpg",
      "url": "https://telefonika.com/product/razer-hammerhead-hyperspeed-wireless-multi-platform-gaming-earbuds-for-playstation-5/",
      "description": "HyperSpeed Wireless: Delivers ultra-fast 2.4GHz wireless connection via included USB-C dongle—the earbuds ensure seamless, low latency audio that meets the"
    },
    {
      "title": "Apple Air Pods 3rd Generation with Lightning Charging Case",
      "price": "₵3,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Apple-Air-Pods-3rd-Generation-with-Lightning-Charging-Case-300x275.jpg",
      "url": "https://telefonika.com/product/apple-air-pods-3rd-generation-with-lightning-charging-case/",
      "description": "Personalized Spatial Audio with dynamic head tracking places sound all around you. Force sensor lets you control your entertainment and"
    },
    {
      "title": "Samsung SM-R630 Galaxy Buds 3 Pro Earbuds",
      "price": "₵3,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/sm-R630-300x275.jpg",
      "url": "https://telefonika.com/product/samsung-sm-r630-galaxy-buds-3-pro-earbuds/",
      "description": "Compatibility & Battery Life: The Samsung Galaxy Buds 3 Pro are compatible with Android devices running Android 8.0 or later with at least 1.5GB RAM. They provide 5-8 hours of playback depending on Active Noise Cancellation (ANC) usage, and up to 18 hours with the charging case. The case supports wireless and wired charging, including Fast Charging technology for quick top-ups. Audio Features: Equipped with Bluetooth 5.4, the Buds 3 Pro support SSC HiFi and UHQ audio codecs, delivering 24bit/96KHz audio for superior sound quality. They also include 360 Audio with Direct Multi-Channel for an immersive listening experience, especially when"
    },
    {
      "title": "Sony WF-L900/HN LinkBuds Truly Wireless Earbud Headphones",
      "price": "₵3,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/03/Sony-LinkBuds-Truly-Wireless-Earbud-Headphones-White-300x275.jpg",
      "url": "https://telefonika.com/product/sony-linkbuds-truly-wireless-earbud-headphones/",
      "description": "Open-ring design that allows you to hear calls, listen to music, play games, and hear other types of online content anytime, all while remaining naturally connected to what’s happening around you. Crystal clear phone calls and conversations with Precise Voice Pickup technology. Integrated V1 Processor for balanced high-quality sound. Up to 5.5 hours of battery and a total of up to 17.5 hours with the charging case. IPX4 splash-proof and sweat-proof design. Ultra-small and light for a fit that stays all day. Control audio by tapping in front of your ears. Adaptive Volume Control optimizes sound to your environment. Alexa"
    },
    {
      "title": "Sony WF-LS900/HN LinkBuds S Noise Cancelling True Wireless",
      "price": "₵3,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WF-LS900HN-LinkBuds-S-Noise-Cancelling-True-Wireless-medium.jpg",
      "url": "https://telefonika.com/product/sony-wf-ls900-hn-linkbuds-s-noise-cancelling-true-wireless/",
      "description": "At only 4.8g each, Sony’s LinkBuds S are supremely small and light ear-buds, supporting both noise cancellation and High Resolution Audio Wireless for exceptional sound …without distraction. They’re packed with smart Sony features for an effortless listening experience, and last for up to twenty hours of comfortable listening with the included charging carry case. Truly wireless listening With two independent ear-buds fitting comfortably and securely in your ears, not a single wire gets in your way. Feel the inspiring freedom of truly wire-free listening. Small, light and comfortable The LinkBuds S are designed in a shape that perfectly matches the"
    },
    {
      "title": "Sony WF-G700N Truly Wireless Earbuds",
      "price": "₵3,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/SONY-WF-G700--300x275.jpg",
      "url": "https://telefonika.com/product/sony-wf-g700n-truly-wireless-earbuds/",
      "description": "INZONE Buds are designed for serious gaming with long battery life and low latency with the included USB-C dongle. They can also be directly connected to your Android smartphone with LE Audio;Refined for Victory. Advised by Fnatic -Gaming excellence by Fnatic Pro-Player met INZONE development. INZONE Buds is here through the collaboration. Superior sound helps you stay on top The INZONE Buds use an 8.4-mm driver, noise cancelling technology, and spatial sound personalisation for the user’s ear, to give you quality.;Industry-leading battery life -The new low-power-consumption processor L1 provides up to 12 hours of battery life in the headphones, with"
    },
    {
      "title": "Apple AirPods 4 Wireless Earbuds",
      "price": "₵3,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/09/Apple-Airpods-4-300x275.jpg",
      "url": "https://telefonika.com/product/apple-airpods-4-wireless-earbuds/",
      "description": "REBUILT FOR COMFORT — AirPods 4 have been redesigned for exceptional all-day comfort and greater stability. With a refined contour, shorter stem, and quick-press controls for music or calls. PERSONALIZED SPATIAL AUDIO — Personalized Spatial Audio with dynamic head tracking places sound all around you, creating a theater-like listening experience for music, TV shows, movies, games, and more.* IMPROVED SOUND AND CALL QUALITY — AirPods 4 feature the Apple-designed H2 chip. Voice Isolation improves the quality of phone calls in loud conditions. Using advanced computational audio, it reduces background noise while isolating and clarifying the sound of your voice for"
    },
    {
      "title": "Bose SoundSport Free W/L EarBuds",
      "price": "₵3,550.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Bose-SoundSport-Free-Truly-Wireless-Sport-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/bose-soundsport-free-w-l-headphones/",
      "description": "Truly wireless sport headphones for total freedom of movement, packed full of technology that makes music sound clear and powerful. Charging time 2 hours Earbuds are sweat and weather resistant (with an IPX4 rating) and come with 3 different pairs of StayHear and Sport tips (in sizes S/M/L) that provide a comfortable and secure fit Up to 5 hours of play time with each charge and an additional 10 hours with the included charging case Track lost earbuds with the Bose Connect App’s “Find My Buds” feature Firmware update to improve audio video synchronization for customers using iPhones, iPads and"
    },
    {
      "title": "Beats Studio Buds – True Wireless Noise Cancelling Earbuds",
      "price": "₵3,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/08/Beats-Studio-Buds-300x275.jpg",
      "url": "https://telefonika.com/product/beats-studio-buds-true-wireless-noise-cancelling-earbuds/",
      "description": "Custom acoustic platform delivers powerful, balanced sound Control your sound with two distinct listening modes: Active Noise Cancelling (ANC) and Transparency mode Three soft eartip sizes for a stable and comfortable fit while ensuring an optimal acoustic seal Up to 8 hours of listening time1 (up to 24 hours combined with pocket-sized charging case) Industry-leading Class 1 Bluetooth for extended range and fewer dropouts High-quality call performance and voice assistant interaction via built-in microphones IPX4-rated sweat and water resistant wireless earbuds Beats wireless headphones and earphones are compatible with Apple and Android devices What’s in the Box – Beats Studio"
    },
    {
      "title": "Huawei Freebuds Lipstick",
      "price": "₵3,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Huawei-Freebuds-Lipstick-medium.jpg",
      "url": "https://telefonika.com/product/huawei-freebuds-lipstick/",
      "description": "💄 DEDICATED TO LUXURY – The luxury-grade stainless-steel body is built upon 30 intricately engineered design processes and polished to an ultra-high level, producing a surface as smooth as a mirror. 👂 COMFORTABLE LISTENING EXPERIENCE – The earbuds are ergonomically moulded to precisely fit your ear, for a shape that feels right every time. And at just 4.1 g each, they’ll sit naturally and comfortably in your ears, offering an almost weightless way to deeply enjoy music. 🎵 HIT THE HIGH NOTES – The large 14.3 mm LCP dynamic driver inside each earbud is what helps HUAWEI FreeBuds Lipstick achieve"
    },
    {
      "title": "Samsung SM-R530 Galaxy Buds 3",
      "price": "₵2,899.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Galaxy-Buds3-300x275.jpg",
      "url": "https://telefonika.com/product/samsung-galaxy-buds-3/",
      "description": "Compatibility & Battery Life: The Samsung Galaxy Buds 3 are compatible with Android devices running Android 8.0 or later with at least 1.5GB RAM. They provide 6-8 hours of playback depending on Active Noise Cancellation (ANC) use, and up to 12 hours with the charging case​. Case can charged wireless or wired. Audio Features: The Buds3, with the power of Bluetooth 5.4, features SSC HiFi and UHQ audio codecs, offering 24bit/96KHz audio for high-quality sound. ANC & AI Features: They include Active Noise Cancellation (ANC), along with Galaxy AI for enhanced features like real-time language translation and voice optimization in"
    },
    {
      "title": "JBL Live Flex",
      "price": "₵2,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Live-Flex-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-live-flex/",
      "description": "JBL Signature Sound and Personi-Fi 2.0 Hear your music in full color with 12mm neodymium speaker drivers perfectly tuned for on-the-go high-fidelity listening with deep bass and JBL Signature Sound. Then use Personi-Fi 2.0 to optimize your audio experience based on your unique hearing profile. True Adaptive Noise Cancelling JBL Live Flex combines the all-day comfort of stick-open earbuds with True Adaptive Noise Cancelling. Eliminate noise and distractions with technology that adapts to your surroundings in real time. Up to 40 (8+32) hours of playtime with Wireless Charging Life’s too short for dead batteries. JBL Live Flex features up"
    },
    {
      "title": "Sony WF-SP800N Wireless Earpiece",
      "price": "₵2,690.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WF-SP800N-Wireless-300x300.jpg",
      "url": "https://telefonika.com/product/sony-wf-sp800n-wireless-earpiece/",
      "description": "Truly wireless design with Bluetooth wireless technology for total freedom Get deep in the zone with digital noise cancellation Battery life up to 9 hours/18 total hours with carrying case, or up to 13 hours/26 total hours with noise canceling disabled IP55 sweat and splash-proof design for worry-free use and cleaning Extra Bass sound with deep, punchy low end Built-in microphone for clear-sounding hands-free calls and use with your voice assistant Alexa enabled for voice access to music, information, and more. Activate with a simple touch"
    },
    {
      "title": "Samsung SM-R510 Galaxy Buds 2 Pro",
      "price": "₵2,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/09/SAMSUNG-BUDS-2-PRO-SM-R510-BORA-PURPLE-medium.jpg",
      "url": "https://telefonika.com/product/samsung-sm-r510-galaxy-buds-2-pro/",
      "description": "ACTIVE NOISE CANCELLATION: Reduce unwanted noise with Galaxy Buds2 Pro; They use Intelligent Active Noise Cancellation* to quiet even the loudest outside sounds; Tune in to what matters most without being bothered by distracting sounds around you HI-FI SOUND QUALITY: Studio quality sound isn’t just for the pros; Feel every note like you’re there with Galaxy Buds2 Pro** and get a next-level listening experience, whether you’re rocking out to your playlist or staying informed with a podcast ENHANCED 360-DEGREE AUDIO: Amplify what you like; Minimize what you don’t; Enhanced 360-degree audio** brings out the tones you love from every angle"
    },
    {
      "title": "JBL Live Pro 2 TWS Noise Cancelling In-Ear Headphone",
      "price": "₵2,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Live-Pro-2-TWS-Noise-Cancelling-In-Ear-Headphone-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-live-pro-2-tws-noise-cancelling-in-ear-headphone/",
      "description": "JBL Signature Sound: Nothing beats incredibly clear music and calls from 11mm dynamic drivers powered by JBL Signature Sound..Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears 40 (10 plus30) hours of playback with wireless charging: Never miss a moment with 40 hours of Qi-compatible battery life (including 10 hours in the earbuds plus 30 hours in"
    },
    {
      "title": "JBL Live PRO+ TWS True Wireless in-Ear Noise Cancelling Bluetooth Headphones",
      "price": "₵2,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/JBL-Live-Pro-TWS-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-live-pro-tws-true-wireless-in-ear-noise-cancelling-bluetooth-headphones/",
      "description": "JBL SIGNATURE SOUND: These wireless earphones provide the best audio solution for any device, Live Pro+ TWS headphones are small but powerful, with 11mm dynamic drivers for extraordinary JBL Signature Sound all day, every day. ADAPTIVE NOISE CANCELLING: Zero distractions when it’s time to focus on your studies or get your groove on from these Bluetooth earbuds. And if you want to hear the world around you without removing your headphones, Smart Ambient sharpens the sounds of your surroundings. CLEAR MICROPHONE: The Live Pro+ TWS wireless earbuds feature 3-mic technology, so you get perfect call quality. A feedback mic ensures"
    },
    {
      "title": "Belkin SoundForm Freedom Earbuds",
      "price": "₵2,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/04/Belkin-SoundForm-Freedom-Earphone-300x275.jpg",
      "url": "https://telefonika.com/product/belkin-soundform-freedom-earbuds/",
      "description": "Belkin Signature Sound features custom drivers for rich, complex audio and minimal distortion, even at high volumes. Exceptional battery life in a compact design. Enjoy 8 hours of playtime with each charge, plus another 20 hours in the case. The first wireless earbuds to integrate Apple Find My network using the Apple Find My app. iOS users can locate earbuds quickly and easily. Clear-Call technology and environmental noise cancellation reduce background noise for better quality phone calls. IPX5 rating against sweat and water extend the life of the earbuds and allow for use during workouts."
    },
    {
      "title": "JBL Soundgear Sense, Wireless Bluetooth Open-Ear Headphones",
      "price": "₵2,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-SOUND-GEAR-SENSE-EARPONE-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-soundgear-sense-wireless-bluetooth-open-ear-headphones/",
      "description": "A natural sound experience: JBL OpenSound Technology has almost zero sound leakage so you can enjoy crystal clear music without worrying about whether those around you can hear it too Unparalleled sound: Specially designed with a 16.2 mm driver in each earbud, featuring a unique, bass-enhancing algorithm to provide powerful bass and pure sound, for a truly unique soundscape All access touch control Splash and dust resistant Up to 24 hours of battery life, plus speed charge"
    },
    {
      "title": "Plantronics Voyager 5200 Mobile phone In-ear headset Bluetooth® Mono",
      "price": "₵2,099.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Plantronics-Voyager-5200-Mobile-phone-In-ear-headset-Bluetooth®-1075101-Mono-300x275.jpg",
      "url": "https://telefonika.com/product/plantronics-voyager-5200-mobile-phone-in-ear-headset-bluetooth-1075101-mono/",
      "description": "Plantronics Voyager 5200 Mobile phone In-ear headset Bluetooth® (1075101) Mono Black Microphone noise cancelling ANSWER CALLS ANYWHERE Your working day is not limited to the office. You need the right headset for this. With the innovative WindSmart technology, the adaptive noise-cancelling microphone and the Bluetooth earphone, you can use the Voyager 5200 series anywhere and can be heard at any time. No matter where you work best, this headset does everything with you. Command control Experience a new dimension of hands-free communication. The Voyager 5200 Series announces incoming calls – just say “Answer” or “Ignore” and the headset does"
    },
    {
      "title": "JBL Live Free NC+ TWS – True wireless Bluetooth earbuds",
      "price": "₵1,990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Live-Free-NC-TWS-True-wireless-Bluetooth-earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-live-free-nc-tws-true-wireless-bluetooth-earbuds/",
      "description": "The JBL Live Free NC+ are true wireless earbuds with Bluetooth and a waterproof build so you can exercise outside, whatever the weather Active Noise Cancelling and Ambient Aware allow you to focus on the music in your ear buds and run safely on the street, while the gel sleeves provide a secure and comfortable fit throughout the day These black earphones deliver up to 21 hours of wireless playtime once charged in the pocked-sized case, allowing you to keep pushing without breaking to recharge With a built-in microphone and hands-free technology, the JBL Live Free NC+ TWS enables you"
    },
    {
      "title": "Sony WF-C700N Truly Wireless Noise Canceling in-Ear Bluetooth Earbud Headphones",
      "price": "₵1,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2023/06/Sony-WF-C700N-Truly-Wireless-Noise-Canceling-in-Ear-Bluetooth-Earbud-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wf-c700n-truly-wireless-noise-canceling-in-ear-bluetooth-earbud-headphones/",
      "description": "Noise cancelling technology to immerse yourself in music. Experience all-day comfort with our ergonomic surface designed earbuds. Unleash exceptional sound for a captivating listening experience. Hands free calling that’s clearer than ever before. Up to 15 hours of battery life with quick charging (10 min charge for up to 1 hour of playback). Multipoint connection allows you to quickly switch between two devices at once. (Feature requires firmware update, available in Summer 2023.) With an IPX4 rating, splashes and sweat won’t stop these headphones. Boost the quality of compressed music files and enjoy streaming music with high quality sound through"
    },
    {
      "title": "Sony WF-1000XM3BM Wireless Earbud",
      "price": "₵1,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WF-1000XM3-Wireless-Earbuds-300x300.jpg",
      "url": "https://telefonika.com/product/sony-wf-1000xm3bm-wireless-earbud/",
      "description": "Industry leading noise canceling with HD Noise Canceling Processor QN1e 24bit Audio signal processing delivers dramatically improved sound quality Battery life up to 24 hours with carrying case (with 10min quick charge for 90min of play time) Truly wireless design with uninterrupted L/R simultaneous Bluetooth transmission Alexa enabled for voice access to music, information, and more. Activate with a simple touch. Smart listening by adaptive sound control automatically switches to ambient sound mode based on your activity In the box: Charging case, Triple comfort earbuds (S, M, L × 2) long hybrid silicone rubber earbuds (stainless, S, M, L ×"
    },
    {
      "title": "JBL Tune Beam 2",
      "price": "₵1,890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-Beam-2-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-beam-2/",
      "description": "Pure bass, zero noise Take on your day one song at a time with JBL Tune Beam 2 true wireless earbuds featuring Adaptive Noise Cancelling. They deliver up to 48 hours of exceptional JBL Pure Bass Sound and JBL Spatial Sound, while the ergonomic (and water and dust resistant) design gives you all-day comfort in any weather. Enjoy perfect-sounding calls without ambient noise, all managed using intuitive touch controls. With Adaptive Noise Cancelling and Smart Ambient technology, you can tune out the world, or choose how much you engage with your surroundings. You can even personalize your sound experience with"
    },
    {
      "title": "Jabra Elite 3 in Ear Wireless Bluetooth Earbuds",
      "price": "₵1,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/02/Jabra-Elite-3-in-Ear-Wireless-Bluetooth-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/jabra-elite-3-in-ear-wireless-bluetooth-earbuds/",
      "description": "FREE THE BASS – You deserve music your way, every day; With 6mm speakers and class-leading customization options, the Jabra Elite 3 compact buds deliver rich, clear sound and punchy bass that’s not only just powerful, but also unique to you INTELLIGENT NOISE CONTROL – For optimal on the go listening, the Elite 3 offers unique noise isolation whilst providing on demand external noise pickup with HearThrough technology CRYSTAL-CLEAR CALLS – 4 microphones, the latest digital signal processing and pioneering beamform technology mean these Jabra earbuds offer great call quality and play music while staying connected; Plus, they are rainproof"
    },
    {
      "title": "JBL Tune Buds 2",
      "price": "₵1,790.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-Buds-2-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-buds-2/",
      "description": "Take on your day one song at a time with JBL Tune Buds 2 true wireless earbuds and Adaptive Noise Cancelling. They deliver up to 48 hours of exceptional JBL Pure Bass Sound and JBL Spatial Sound, while the ergonomic (and water and dust resistant) design gives you all-day comfort in any weather. Enjoy perfect-sounding calls without ambient noise, all managed using intuitive touch controls. With Adaptive Noise Cancelling and Smart Ambient technology, you can tune out the world, or choose how much you engage with your surroundings. You can even personalize your sound experience with the JBL Headphones app"
    },
    {
      "title": "JBL Tune Flex True Wireless Noise Cancelling Earbuds",
      "price": "₵1,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-Flex-True-Wireless-Noise-Cancelling-Earbuds.fw_-medium.png",
      "url": "https://telefonika.com/product/jbl-tune-flex-true-wireless-noise-cancelling-earbuds/",
      "description": "JBL Deep Bass Sound A hefty 12mm driver delivers JBL Deep Bass sound so you don’t just hear the music, you feel it. Comfortable fit with open-ear design Hear more of what you want, less of what you don’t. Active Noise Cancelling technology with 2 microphones lets you minimize audio distractions. With Ambient Aware, you can tune into your surroundings at any time so that you feel safer when you’re out in the world, while TalkThru lets you stop for a quick chat without having to remove your headphones. 4 mics for perfect calls Enjoy hassle-free, hands-free calls in stereo."
    },
    {
      "title": "JBL Tune Flex Ghost Edition Noise Cancelling Earbuds",
      "price": "₵1,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-Flex-Ghost-Edition-Noise-Cancelling-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-flex-ghost-edition-noise-cancelling-earbuds/",
      "description": "4 Mics For Perfect Calls Enjoy hassle-free, hands-free calls in stereo. The Tune Flex are equipped with 4 microphones, so you’ll always be heard with perfect clarity. Never hesitate to take or make a call again. And with VoiceAware, you can choose how much of your own voice to hear by controlling the amount of mic input routed back into your earbuds. Up to 32 Hours of Battery Life Never miss a beat with 32 (8+24) hours of battery life or 6 hours, plus 18 hours in the case when noise cancelling is engaged. Need a boost? Speed Charge for"
    },
    {
      "title": "JBL Tune 225TWS True Wireless Earbud Headphones",
      "price": "₵1,590.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-225TWS-True-Wireless-Earbud-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-225tws-true-wireless-earbud-headphones/",
      "description": "JBL PURE BASS SOUND: Powering festivals and concerts around the world for decades, now JBL brings your own world to life with incredible Pure Bass sound in these wireless earbuds WIRELESS IN STYLE: Experience total freedom with no cords with the True Wireless JBL Tune 225TWS earbuds. With 6 different colors, you’ll be able to find the perfect pair of earbuds to match exactly who you are UP TO 25 HOURS BATTERY (5 plus 20): these earphones have enough battery to last all day and all night. Keep your own private concert going for as long as you can keep"
    },
    {
      "title": "JBL Tune Beam Wireless ANC Earbuds",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-Beam-Wireless-ANC-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-beam-wireless-anc-earbuds/",
      "description": "ACTIVE NOISE CANCELLING: With the JBL Tune Beam TWS listen to more of what you want and less of what you don’t. Active Noise Cancellation technology allows you to reduce audio distractions SMART AMBIENT & TALKTHRU: Ambient Aware feature enables you to be more aware of your surroundings and feel more secure when you’re outside, while TalkThru allows you to have a quick conversation without the need to take off your headphones JBL PURE BASS SOUND: Smartly designed 6mm drivers enhanced by the stick’s form factor deliver JBL’s Pure Bass Sound, so you’ll feel every pulsing beat LONG PLAYTIME WITH"
    },
    {
      "title": "Samsung SM-R400 Galaxy Buds FE",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/SAMSUNG-BUDS-FE-SM-R400NZAAMEA-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/samsung-buds-fe-sm-r400nzaamea-black/",
      "description": "Your everyday audio companion Galaxy Buds FE, with their compact and ergonomic design, are here to deliver an outstanding listening experience. Block out unwanted noise with Active Noise Canceling, personalize the fit with various tips and seamlessly sync with your Samsung Galaxy devices. Experience the everyday audio companion that truly caters to you. * Galaxy S23 FE and Galaxy Tab S9 FE sold separately. S Pen included with Galaxy Tab S9 FE. ** Image simulated for illustrative purposes. Actual UI may be different. Timeless hues to match any tune Graphite and Mystic White are two timeless colors that keep you"
    },
    {
      "title": "JBL Tune Buds – True Wireless Noise Cancelling Earbuds",
      "price": "₵1,490.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-Buds-True-Wireless-Noise-Cancelling-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-buds-true-wireless-noise-cancelling-earbuds/",
      "description": "JBL Pure Bass Sound: Smartly designed 10mm drivers enhanced by the buds’ form factor deliver JBL’s Pure Bass Sound so you’ll feel every pulsing beat. Bluetooth 5.3 with LE audio support (*): Thanks to the next generation Bluetooth technology, the JBL Tune Buds earbuds stream audio with low power consumption at high quality. Plus, BT 5.3 allows to stream synchronized audio independently to each earbud, so that you can use either or both earbuds. Or you can share your video or music content with a friend wearing headphones, as BT 5.3 lets you seamlessly stream audio to multiple listeners. (*)"
    },
    {
      "title": "JBL Wave Beam 2",
      "price": "₵1,450.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Wave-Beam-2-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-wave-beam-2/",
      "description": "Life’s too short for boring Quality sound just got easier—and more fun. JBL Wave Beam 2 earbuds feature exciting JBL Pure Bass Sound, plus Active Noise Cancelling and Smart Ambient technology so you decide how much of the outside world you want to hear. Manage hands-free crisp, clear calls with just a tap on the earbuds. Use the JBL Headphones app to customize your sound and Voice Prompts language. Connect seamlessly with up to 8 Bluetooth® devices and switch effortlessly from one to another. And with up to 40 hours* of playback time, they’re a great everyday sound companion. (*with"
    },
    {
      "title": "JBL Free II True Wireless in-Ear Headphones",
      "price": "₵1,390.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Free-II-True-Wireless-in-Ear-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-free-ii-true-wireless-in-ear-headphones/",
      "description": "Truly Wireless: Discover the freedom of a wireless lifestyle listening to music, managing your calls or working out 24 hours of combined playback: Enjoy an entire day of wireless audio, with 4 hours of continuous playback and 20 hours of backup power from the charging case Handsfree calls: Integrated microphone for clear phone calls. Automatic stereo-mono mode switching for a natural call experience Comfort Stay Secure Fit: Best in calss ergonomics with 3 ear tip sizes and 2 gel sleeve sizes ensure a secure fit that stays with you, no matter what you are doing Splashproof: IPX5-certified design keeps the"
    },
    {
      "title": "Anker Soundcore Liberty 4 NC Noise Cancelling Earbud",
      "price": "₵1,350.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/04/Anker-Soundcore-A3947H11-Liberty-4-NC-Noise-Cancelling-Earbu-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-a3947h11-liberty-4-nc-noise-cancelling-earbu/",
      "description": "Reduce noise by up to 98.5% with our advanced noise cancelling system Adaptive ANC 2.0 adapts to ears and environment in real-time 11mm drivers, Hi-Res Wireless and LDAC technology for crisp sound Full adjustable EQ with Hear ID 2.0 for a tailored sound profile 10/50 hours of battery for long-lasting quiet Fast Pair and Bluetooth 5.3 multi-point connection IPX4 water-resistance against spills and rain 6 mics and an AI algorithm enable crystal clear calls"
    },
    {
      "title": "JBL Wave Buds 2 Earbud",
      "price": "₵1,299.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/07/JBL-Wave-Buds-2-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-wave-buds-2-earbud/",
      "description": "Life’s too short for boring Quality sound just got easier—and more fun. JBL Wave Buds 2 earbuds feature exciting JBL Pure Bass Sound, plus Active Noise Cancelling and Smart Ambient technology so you decide how much of the outside world you want to hear. Manage hands-free crisp, clear calls with just a tap on the earbuds. Use the JBL Headphones app to customize your sound and Voice Prompts language. Connect seamlessly with up to 8 Bluetooth® devices and switch effortlessly from one to another. And with up to 40 hours* of playback time, they’re a great everyday sound companion. (*with"
    },
    {
      "title": "JBL Tune 230NC TWS True Wireless In-Ear Noise Cancelling Headphones",
      "price": "₵1,290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-230NC-TWS-True-Wireless-In-Ear-Noise-Cancelling-Headphones.fw_-medium.png",
      "url": "https://telefonika.com/product/jbl-tune-230nc-tws-true-wireless-in-ear-noise-cancelling-headphones/",
      "description": "JBL Pure Bass Sound: Smartly designed 10mm drivers enhanced by the Dot form factor deliver JBL’s Pure Bass Sound so you’ll feel every pulsing beat..Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ears Product Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not"
    },
    {
      "title": "Sony WF-C500 Truly Wireless Earbuds",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Sony-WF-C500-Truly-Wireless-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/sony-wf-c500-truly-wireless-earbuds/",
      "description": "DSEE restores high frequency sounds lost in compression Up to 10hr battery life, total up to 20hr with charging case Splash-proof and sweat-proof with an IPX4 rating Easier, clearer hands-free calling Small and light for a great fit and all day wear Ergonomic Surface Design conforms to most ear shapes Fine-tune your sound using the Sony Headphones Connect app Optional use of one earbud only Easy button operation to take control without your phone Experience 360 Reality Audio for a truly immersive experience"
    },
    {
      "title": "Belkin SoundForm Move Plus True Wireless EarBuds",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Belkin-SoundForm-Move-Plus-True-Wireless-EarBuds-300x275.jpg",
      "url": "https://telefonika.com/product/belkin-soundform-move-plus-true-wireless-earbuds/",
      "description": "Extended battery life—Up to 5 hours of playtime with each charge, plus up to 19 hours of additional power in the case. That’s 24 hours of your favorite podcasts, playlists, and audiobooks. Microphone and touch controls in each earbud offer complete control without opening an app. Pick up calls, control volume, skip or repeat songs with just a tap. Dual connect gives you total freedom to use a single earbud for calls and music. Each earbud includes a dedicated, built-in microphone for making and taking phone calls while leaving your other ear free and allowing the second earbud to charge"
    },
    {
      "title": "JBL Wave Flex, In-Ear Wireless Earphones",
      "price": "₵1,190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Wave-Flex-In-Ear-Wireless-Earphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-wave-flex-in-ear-wireless-earphones/",
      "description": "Catch every detail: Trust these in-ear earbuds to power the everyday soundtrack of your life with their rich, punchy bass using JBL’s Deep Bass Sound technology, while keeping audio and vocals crisp Non stop tunes: With 8 hours of battery life and 24 in the case for all day listening, alongside an additional speed charging feature for an extra two hours after just 10 minutes of charging Water resistant: Power your soundtrack at the beach, poolside or at the gym without worrying about splashing or dust, thanks to IP54 and IPX2 waterproof certification on the earbuds and charging case Convenient:"
    },
    {
      "title": "JBL Wave Beam in-Ear Earbuds (TWS)",
      "price": "₵1,150.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-WAVE-BEAM-TRUE-WIRELESS-EARBUDS-BEIGE-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-wave-beam-in-ear-earbuds-tws/",
      "description": "JBL HEADPHONES APP: Listen all day-your way. Dial in your preferred sound with the dedicated app and transform the JBL Wave Beam into your ideal audio companion with your preferred sound signature Up To 32 (8h + 24h) TOTAL HOURS OF BATTERY LIFE WITH QUICK CHARGING: With 8 hours of battery life in the earbuds and 24 hours in the case, the JBL Wave Beam provide all-day audio. And when you need more power, you can speed charge an extra two hours in just ten minutes STAY AWARE OF YOUR SURROUNDING: With Ambient Aware technology, you can go anywhere and"
    },
    {
      "title": "JBL Tune 215TWS – True Wireless in-Ear Headphones",
      "price": "₵1,090.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Tune-215TWS-True-Wireless-in-Ear-Headphones-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-tune-215tws-true-wireless-in-ear-headphones/",
      "description": "let jbl bring your world to life with incredible pure bass sound. experience total freedom with no cords with the true wireless jbl tune 215tws earbuds. with up to 25 hours (5 hours from the earbuds and 20 hours from the case) of battery life, you can listen all day and all night. the power of dual connect gives you the choice to seamlessly enjoy music or make calls with either one or both buds. the charging case for the jbl tune 215tws is as thoughtfully designed as the earbuds it holds, with a shape inspired by a river stone,"
    },
    {
      "title": "JBL Wave Buds True Wireless Earbuds",
      "price": "₵990.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/JBL-Wave-Buds-In-Ear-Wireless-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/jbl-wave-buds-true-wireless-earbuds/",
      "description": "Catch every detail: Transform your listening experience with JBL Wave Buds which provide rich, punchy bass thanks to JBL’s Deep Bass Sound technology, while keeping audio and vocals crisp Non-stop tunes: With 8 hours of battery life and 24 in the case for all day listening, alongside an additional speed charging feature for an extra two hours after just 10 minutes of charging Water resistant: Power your soundtrack at the beach, poolside or at the gym without worrying about splashing or dust, thanks to IP54 and IPX2 waterproof certification on the earbuds and charging case Convenient: Avoid awkward fumbling when"
    },
    {
      "title": "Porodo Soundtec Pure Sound Wireless Earbuds V5.0",
      "price": "₵899.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Porodo-Soundtec-Pure-Sound-Wireless-Earbuds-V5.0-medium.jpg",
      "url": "https://telefonika.com/product/porodo-soundtec-pure-sound-wireless-earbuds-v5-0/",
      "description": "Wireless charging compatible. Single-sided use enabled Activate siri press and hold for 2 seconds Reject call, Press and hold for 1 second Works on both left+Right Earbuds Call Back press and hold twice Wireless charging output: 5V/0.4A Bluetooth protocols: HSP / HFP / A2DP Operating frequency: 2.4GHz Working temperature: -10C – 50C Answer/Hang up touch once Play/pause touch once Charging input: 5V/1A Bluetooth version: 5.0 2.5h Talk time Touch control"
    },
    {
      "title": "Anker Soundcore P40i Smart A3955H21 Noise Cancelling TWS Earbuds – White",
      "price": "₵890.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Anker-Soundcore-P40i-Smart-A3955H21-Noise-Cancelling-TWS-Earbuds-White-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-p40i-smart-a3955h21-noise-cancelling-tws-earbuds-white/",
      "description": "Smart Noise Cancelling : soundcore P40i noise cancelling earbuds feature adaptive ANC that automatically detects ambient noise and utilizes advanced algorithms to achieve effective noise cancellation, ensuring peace and tranquillity on the go. Long, Powerful Battery Life : Enjoy 12 hours of battery life on a single charge with a case that extends it to 60 hours. That’s long enough to last weeks, even a month. Thumping Beats : soundcore P40i wireless earbuds feature 11mm composite drivers for an intensive audio experience, enhanced with BassUp™ technology for real-time intense bass. Superior Call Quality : soundcore P40i noise cancelling earbuds enhanced"
    },
    {
      "title": "Green Lion Smart Display Earbuds – Black",
      "price": "₵540.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Lion-Smart-Display-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-smart-display-earbuds/",
      "description": "The Green Lion Smart Display Earbuds feature Bluetooth V5.3 for a stable connection and a 10-meter working distance. Enjoy up to 5 hours of music time with each earbud, powered by a 30 mAh battery. Fully recharge your case in just 1.5 hours, ensuring your earbuds are always charged up. The key feature of this device is the 1.83-inch curved screen on the charging case, offering a smart display for easy navigation. The 13mm speakers of thisearbud deliver high-quality sound, and using environmental noise cancellation reduces background noise. The Green Lion Smart Display Earbuds use multi-function touch controls, which makes navigation easier and"
    },
    {
      "title": "Green Lion Queens True Wireless Earbuds – Pink",
      "price": "₵470.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/GNQUEENSTWSPK-Green-Lion-Queens-True-Wireless-Earbuds-Pink-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-queens-true-wireless-earbuds-pink/",
      "description": "Introducing the Green Lion Queen’s True Wireless Earbuds: the perfect blend of style and exceptional functionality. Experience every beat with the powerful JL6983 Chipset and its wide frequency range of 20Hz to 20kHz. Connectivity is a breeze with the latest Bluetooth 5.3 protocol, supporting HFP, HSP, A2DP, TWS, and AVRCP profiles. With a staggering 36-foot range, you’ll enjoy seamless connectivity wherever you go. The Multifunction Touch guarantees effortless operation, while hands-free calls revolutionize convenience. Savor five continuous hours of music, which can be extended to sixteen hours with the durable charging case. The earbuds feature a built-in 35mAh battery, while"
    },
    {
      "title": "OPPO Enco Buds2",
      "price": "₵450.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/07/OPPO-Enco-Buds2-300x275.jpg",
      "url": "https://telefonika.com/product/oppo-enco-buds2/",
      "description": "Earphone Model: ETE41 Charging case model: ETE42 Audio quality Driver: 10 mm dynamic driver Driver sensitivity: 101 dB @ 1 kHz Frequency response range: 20 Hz – 20 kHz Bluetooth® Bluetooth® codec: AAC/SBC Bluetooth® version: 5.2 Bluetooth® range: 10 m Battery Life Battery type: Rechargeable Li-ion Cell Battery capacity: 40 mAh (Earbuds) / 460 mAh (Charging Case) Music play time (50% volume): 7 h (single charge)/ 28 h (with Charging Case) Communication time (50% volume): 4 h (single charge)/ 16 h (with Charging Case) Charging Charging time: 90 min(Earbuds)/ 200 min( Earbuds + Charging Case)Charging port: USB Type-C * The"
    },
    {
      "title": "Green Lion Transparent Pro 2 Wireless Earbuds – White",
      "price": "₵440.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Green-Lion-Transparent-Pro-2-Wireless-Earbuds-White-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-transparent-pro-2-wireless-earbuds-white/",
      "description": "The Green Lion Transparent Pro 2 Wireless Earbuds is a stylish yet practical earphone. This earbud can play nonstop music for up to 7 hours and can be on standby mode for 45 hours. It can stay connected within the distance of 10 meters and because it uses Bluetooth v5.3, you can expect a stable connection within that range. Additionally, due to the 4 ENC-equipped mics, the calls that you make would be as clear as they can be. In conclusion, the Green Lion Transparent Pro 2 Wireless Earbuds are one of the best earbuds for those who want convenience"
    },
    {
      "title": "Anker Soundcore R50i B2B TWS Earbuds With Powerful Sound",
      "price": "₵340.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/02/Anker-Soundcore-R50i-A3949H12-B2B-TWS-EARBUDS-BLACK-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-r50i-a3949h22-b2b-tws-earbuds-with-powerful-sound-white/",
      "description": "Big 10mm Drivers: The drivers produce powerful sound with punchy bass. 22 Preset EQs: Choose how you want to hear your music in the soundcore app. Ergonomic, Lightweight Fit: The small earbuds are lightweight, and comfortable for long listening sessions. They fit in a tiny case with a lanyard that can be stored and carried conveniently. All-Day Playtime: Get 10 hours of playtime on a single charge and stay powered for 30 hours in total with the case. AI-Clear Calls: 2 mics and AI processing ensures that your voice is heard in crystal clear clarity. Fast Charging: A fast 10-minute charge gives your earbuds an extra 2 hours of playtime. IPX5 Water-Resistant: soundcore R50i true wireless earbuds are protected from splashes of water, so you can wear them outside, even when it rains. *Note: Water resistance rating applies to earbuds, not the charging case. Instant Pairing: During first use, open the charging case, take soundcore R50i true wireless earbuds out and they will enter pairing mode. From then on, the earbuds will connect to the last paired device every time you use them. Single Earbud Mode: Leave one ear free to hear your surroundings while you listen to audio with the other. A solo earbud can play audio, while the other is in the case."
    },
    {
      "title": "Anker Soundcore P25i True Wireless in-Ear Earbuds",
      "price": "₵299.00",
      "image": "https://telefonika.com/wp-content/uploads/2024/11/Anker-Soundcore-P25i-True-Wireless-in-Ear-Earbuds-300x275.jpg",
      "url": "https://telefonika.com/product/anker-soundcore-p25i-true-wireless-in-ear-earbuds/",
      "description": "Powerful Bass: soundcore P25i true wireless earbuds have oversized 10mm drivers that deliver powerful sound with boosted bass so you can lose yourself in your favorite songs. Personalized Listening Experience: Use the soundcore app to customize the controls and choose from 22 EQ presets or use white noise for improving focus Long Playtime, Fast Charging: Get 10 hours of battery life on a single charge with a case that extends it to 30 hours. If P25i true wireless earbuds are low on power, a quick 10-minute charge will give you 2 hours of playtime. AI-Enhanced Clear Calls: 2 built-in mics"
    },
    {
      "title": "Porodo Blue Airpods Pro 2 – Pink",
      "price": "₵290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PB-ARPDP2-PK-Porodo-Blue-Airpods-Pro2-Pink-300x275.png",
      "url": "https://telefonika.com/product/porodo-blue-airpods-pro-2-pink/",
      "description": "Specifications The Porodo Blue Earbuds Pro2 is an excellent choice for your musical adventures. This earbud offers an impressive 20-hour music playback time with just two hours of charging. Equipped with convenient wireless charging capabilities, it simplifies the recharging process. It is equipped with a touch controls, enabling you to easily adjust the volume, as well as play and pause your music."
    },
    {
      "title": "Green Lion Tribe Earbuds",
      "price": "₵290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GNTRIBTWSBK-Green-Lion-Tribe-Earbuds-White-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-tribe-earbuds/",
      "description": "Enjoy music with no restrictions. This earphone was created using the most recent audio technology to give you a high-clarity sound. You will be able to use touch control with these earphones. With this option, you can skip to the next or previous song, pause the music, answer or end calls, and change the voice volume. The Green Lion True Earbuds 3 have a 6-hour battery life, if you charge this case for just five minutes, you can use it for over an hour. Green Lion Wireless Earbuds 3 has built in microphone for crystal clear calls. The Green Lion"
    },
    {
      "title": "Green Lion Solo Wireless Earbuds – Pink",
      "price": "₵290.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GNSOLOBUDSPK-Green-Lion-Solo-Wireless-Earbuds-Pink-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-solo-wireless-earbuds-pink/",
      "description": "The Green Lion Solo Wireless Earbuds redefine your music experience with their incredible design and features. Not only are these earbuds affordable, but they also offer amazing comfort. The earplugs are designed to fit snugly and gently, ensuring that you can fully enjoy your music without any discomfort or limitations. Moreover, these earbuds provide a clear and immersive music experience with their hands-free stereo capability. You can enjoy your favorite tunes while staying connected up to 10m away, thanks to the latest V5.3 wireless technology. But that’s not all! You can also take advantage of the voice assistant feature, allowing"
    },
    {
      "title": "Porodo Blue Deep Bass Wireless Earbuds 3 – Black",
      "price": "₵260.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/Porodo-Blue-Deep-Bass-Wireless-Earbuds-3-Black-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-blue-deep-bass-wireless-earbuds-3-black/",
      "description": "Enjoy music with no restrictions. The Porodo Blue Deep Bass Wireless Earbuds 3 provide clear stereo immersion sound quality blasting and a master/slave mode that lets your main device control your earphones over Bluetooth 5.2. These earbuds were created with the most recent audio technology, providing you with a high-clarity sound that you haven’t heard before. The Porodo Blue Deep Bass Wireless Earbuds 3 have a 20-hour battery life and may be used after wirelessly charging them. In the event that the initial connection is successful, your phone will automatically connect using the charging case. You may use the touch"
    },
    {
      "title": "Porodo Blue Airpods 3- Pink",
      "price": "₵250.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PB-ARPD3-PK-Porodo-Blue-Airpods-3-Pink-1-300x275.png",
      "url": "https://telefonika.com/product/porodo-blue-airpods-3-pink/",
      "description": "Description Porodo Deep Bass Wireless Earbuds are Bluetooth-compatible. With this product, you may enjoy music bursting in the deep bass range. For a high-clarity sound you’ve never heard before, this earphone was made employing the most modern audio technology. Only two hours are needed to completely charge the Porodo Deep Bass Wireless Earbuds, which have a 20-hour battery life. A complimentary Berlin charging case and an in-built microphone are included with the earbuds."
    },
    {
      "title": "Porodo Blue Airpods 2- Pink",
      "price": "₵250.00",
      "image": "https://telefonika.com/wp-content/uploads/2022/01/PB-ARPD2-PK-Porodo-Blue-Airpods-2-Pink-300x275.png",
      "url": "https://telefonika.com/product/porodo-blue-airpods-2-pink/",
      "description": "Description The Bluetooth-capable Porodo Deep Bass Wireless Earbuds are available. You might listen to music that is brimming with deep bass using this product. This earphone was created with the most advanced audio technology for a high-clarity sound you’ve never heard before. The 20-hour battery life of the Porodo Deep Bass Wireless Earbuds can be fully charged in only two hours. The earphones come with an integrated microphone and a free Berlin charging case."
    },
    {
      "title": "Porodo Blue Deep Bass Wireless Earbuds Pro 2 with Swipe Volume – White",
      "price": "₵240.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PB-ARPDP2-WH-Porodo-Blue-Deep-Bass-Wireless-Earbuds-Pro-2-with-Swipe-Volume-White-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-blue-deep-bass-wireless-earbuds-pro-2-with-swipe-volume-white/",
      "description": "A set of useful earphones that you can bring with you wherever you go is the Porodo Blue Wireless Earbuds. Because it can be used for 20 hours of playback after only two hours of charging, this gadget distinguishes out from the competition. The Porodo Wireless Earbuds allow you to control both music and phone calls. The 7-meter Bluetooth connection range allows for unrestricted mobility. This product has been thoughtfully created to give the perfect fit for your ears. It has a distinctive design that ensures the best sound delivery. With Siri’s assistance, making a phone call will be a"
    },
    {
      "title": "Green Lion SIENA True Wireless Earbud – Black",
      "price": "₵240.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/GNSIEBUDBK-Green-Lion-SIENA-True-Wireless-Earbud-Black-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-siena-true-wireless-earbud-black/",
      "description": "The Green Lion Siena True Wireless Earbuds are your best companion for listening to music. These earbuds are equipped with environmental noise cancellation that increases calls and music sound quality. The Siena earbuds are IPX5 water-resistant and are suitable for workout and gym sessions. Lastly, this earphone has Bluetooth version 5.4, which gives a stable and strong connection within a 10-meter range. If you care for the quality of the music and want clear calls with your earbuds, the Green Lion Siena True Wireless Earbuds should be your go-to option"
    },
    {
      "title": "Porodo Blue Deep Bass Wireless Earbuds 2 – White",
      "price": "₵215.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/02/PB-ARPD2-WH-Porodo-Blue-Deep-Bass-Wireless-Earbuds-2-White-300x275.jpg",
      "url": "https://telefonika.com/product/porodo-blue-deep-bass-wireless-earbuds-2-white/",
      "description": "The Bluetooth-capable Porodo Deep Bass Wireless Earbuds are available. You might listen to music that is brimming with deep bass using this product. This earphone was created with the most advanced audio technology for a high-clarity sound you’ve never heard before. The 20-hour battery life of the Porodo Deep Bass Wireless Earbuds can be fully charged in only two hours. The earphones come with an integrated microphone and a free Berlin charging case."
    },
    {
      "title": "Green Lion Kavala TWS Wireless Buds – White",
      "price": "₵190.00",
      "image": "https://telefonika.com/wp-content/uploads/2021/10/GNKVLATWSWH-Green-Lion-Kavala-TWS-Wireless-Buds-White-300x275.jpg",
      "url": "https://telefonika.com/product/green-lion-kavala-tws-wireless-buds-white/",
      "description": "The Green Lion Kavala Wireless Earbuds are designed to provide a perfect listening experience. They come with a variety of features, including multi-function touch controls and hands-free calling capabilities, that make them convenient and easy to use. With the help of the FTD chipset and Bluetooth Version 5.2, the earbuds bring a stable connection with a distance of up to 15 meters. They also have a powerful 40mAh battery in each earbud, and the charging case can provide an additional 3 charges. Thanks to 5 hours of talk time, 4.5 hours of music time, and a quick 90-minute charging time,"
    }
  ]
}